---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/feas_plan_log.log
  log type:  text
 opened on:  14 Mar 2023, 20:57:12

. 
. cd "$INPUT_PATH/Merge"
C:\Users\lijia\OneDrive - University of Toronto\Documents\School\1-5 ECO375\ECO375 Project\1 - Data\Merge

. 
end of do-file

. do "C:\Users\lijia\AppData\Local\Temp\STD2494_000000.tmp"

. use "HOLC_Voting_Merged.dta", clear

. 
end of do-file

. do "C:\Users\lijia\AppData\Local\Temp\STD2494_000000.tmp"

. regress tract_dvoteshare perc_tract_d _yr_median perc_pop_white perc_pop_black ///
> perc_pop_asian if tract_holc_share > 0.8, robust

Linear regression                               Number of obs     =      7,375
                                                F(5, 7369)        =    1701.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4301
                                                Root MSE          =     .11262

--------------------------------------------------------------------------------
               |               Robust
tract_dvotes~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
  perc_tract_d |   .0380467   .0029936    12.71   0.000     .0321783    .0439151
    _yr_median |   1.23e-06   5.47e-08    22.45   0.000     1.12e-06    1.34e-06
perc_pop_white |  -.2052477   .0074982   -27.37   0.000    -.2199462   -.1905491
perc_pop_black |   .1929972    .004312    44.76   0.000     .1845443      .20145
perc_pop_asian |  -.1378559   .0109387   -12.60   0.000    -.1592988    -.116413
         _cons |   .7427724   .0041657   178.31   0.000     .7346065    .7509383
--------------------------------------------------------------------------------

. 
end of do-file

. sum

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  tract_code |          0
perc_tract_a |     16,582     .038809    .1425828          0          1
perc_tract_b |     16,582    .1280874    .2532663          0          1
perc_tract_c |     16,582    .2857283    .3476808          0          1
perc_tract_d |     16,582    .1784976    .3083853          0          1
-------------+---------------------------------------------------------
        city |          0
       state |          0
tract_dem_~l |     16,352    1106.674    688.3517   .3680349   8746.938
tract_rep_~l |     16,352    389.5463    398.0105          0   5641.586
tract_lib_~l |     16,352    13.98636    13.26517          0   191.0164
-------------+---------------------------------------------------------
tract_oth_~l |     16,352    12.04759    11.64248          0   211.3497
tract_vote~l |     16,352    1522.254      912.96          1   10818.04
tract_dvot~e |     16,352    .7405509    .1634468   .0415478          1
tract_rvot~e |     16,352    .2425647    .1622107          0   .9557857
tract_holc~e |     16,582    .6311224    .3590859   2.21e-08   1.020579
-------------+---------------------------------------------------------
      GEO_ID |          0
   pop_total |     16,582    2814.975     1280.19          0      15478
   pop_white |     16,582    1380.858    1107.544          0      10833
   pop_black |     16,582    562.4321     699.978          0       6583
   pop_asian |     16,582    249.3463    441.8843          0       7534
-------------+---------------------------------------------------------
  _yr_median |     16,242    65086.31    37972.78       2500     250001
      _merge |     16,582           3           0          3          3
perc_pop_w~e |     16,515    .4749824    .2922239          0          1
perc_pop_b~k |     16,515    .2333328    .2793496          0    .986733
perc_pop_a~n |     16,515    .0781512    .1192888          0          1

. do "C:\Users\lijia\AppData\Local\Temp\STD2494_000000.tmp"

. regress tract_dvoteshare perc_tract_d if tract_holc_share > 0.8, robust

Linear regression                               Number of obs     =      7,434
                                                F(1, 7432)        =     385.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0396
                                                Root MSE          =      .1463

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0762276   .0038822    19.64   0.000     .0686174    .0838377
       _cons |   .7654135   .0021479   356.35   0.000     .7612029     .769624
------------------------------------------------------------------------------

. 
end of do-file

. exit, clear
