----------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/benlee/Documents/GitHub/eco375/3 - Output/jacob_test_log.log
  log type:  text
 opened on:  27 Feb 2023, 04:09:02

. 
. cd "$INPUT_PATH/Tracts_2020_HOLC"
/Users/benlee/Documents/GitHub/eco375/1 - Data/Tracts_2020_HOLC

. 
. * convert shapefile of HOLC to census tract crosswalk into dta format
. shp2dta using Tracts_2020_HOLC, database(Tracts_2020_HOLC) ///
>         coordinates(Tracts_2020_HOLC_coord) genid(id) replace
type: 5

. 
. * load dta created above
. use Tracts_2020_HOLC.dta

. 
. * clean data by removing extra 0s in the tract codes present in the original dataset
. gen tract_code1 = substr(GISJOIN, 2, 2)

. gen tract_code2 = substr(GISJOIN, 5, 3)

. gen tract_code3 = substr(GISJOIN, 9, 6)

. egen tract_code = concat(tract_code*)

. drop tract_code1-tract_code3

. 
. egen perc_tract_a = total(SUM_Perc) if FIRST_holc == "A", by(tract_code)
(38,481 missing values generated)

. egen perc_tract_b = total(SUM_Perc) if FIRST_holc == "B", by(tract_code)
(32,395 missing values generated)

. egen perc_tract_c = total(SUM_Perc) if FIRST_holc == "C", by(tract_code)
(24,027 missing values generated)

. egen perc_tract_d = total(SUM_Perc) if FIRST_holc == "D", by(tract_code)
(31,338 missing values generated)

. 
. duplicates drop tract_code, force

Duplicates in terms of tract_code

(25,481 observations deleted)

. save Tracts_2020_HOLC_cleaned, replace
file Tracts_2020_HOLC_cleaned.dta saved

. 
. * import and clean voting data
. cd "$INPUT_PATH/Voting_census_block"
/Users/benlee/Documents/GitHub/eco375/1 - Data/Voting_census_block

. clear all

. import delimited "2021blockgroupvoting.csv"
(encoding automatically selected: ISO-8859-1)
(9 vars, 233,866 obs)

. tostring blockgroup_geoid, replace format("%14.0f")
blockgroup_geoid was double now str12

. 
. replace blockgroup_geoid = "0" + blockgroup_geoid if strlen(blockgroup_geoid)==11
(43,877 real changes made)

. gen tract_code = substr(blockgroup_geoid, 1, 11)

. 
. egen tract_dem_total = total(dem), by(tract_code)

. egen tract_rep_total = total(rep), by(tract_code)

. egen tract_lib_total = total(lib), by(tract_code)

. egen tract_oth_total = total(oth), by(tract_code)

. gen tract_vote_total = tract_dem_total + tract_rep_total + tract_lib_total + tract_oth_total

. gen tract_dvoteshare = tract_dem_total / tract_vote_total
(145 missing values generated)

. gen tract_rvoteshare = tract_rep_total / tract_vote_total
(145 missing values generated)

. duplicates drop tract_code, force

Duplicates in terms of tract_code

(151,546 observations deleted)

. 
. drop rep-precincts

. drop blockgroup_geoid

. 
. save 2021blockgroupvoting_cleaned, replace
file 2021blockgroupvoting_cleaned.dta saved

. 
. * merge datasets
. cd "$INPUT_PATH/Merge"
/Users/benlee/Documents/GitHub/eco375/1 - Data/Merge

. clear all

. use "$INPUT_PATH/Tracts_2020_HOLC/Tracts_2020_HOLC_cleaned.dta"

. merge m:1 tract_code using "$INPUT_PATH/Voting_census_block/2021blockgroupvoting_cleaned.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                        66,187
        from master                       230  (_merge==1)
        from using                     65,957  (_merge==2)

    Matched                            16,363  (_merge==3)
    -----------------------------------------

. 
. * collapse data to tract level units of observation
. 
. collapse perc_tract_* tract_dvoteshare tract_rvoteshare, by(tract_code)

. save "$INPUT_PATH/Merge/HOLC_cleaned_collapsed.dta"
file /Users/benlee/Documents/GitHub/eco375/1 - Data/Merge/HOLC_cleaned_collapsed.dta saved

. 
end of do-file

. use "/Users/benlee/Documents/GitHub/eco375/1 - Data/Voting_census_block/2021blockgroupvoting_cleaned.dta
> "

. do "/var/folders/j7/_qnfgl017_v_qrh41nwsy5k40000gn/T//SD83936.000000"

. /*******************************************************************************
> Class:                          ECO375 Winter 2023
> Project:                        Feasibility Plan
> Name:                           Jia Jun (Jacob) Li 1006824750
> Name:                           Benjamin Lee 1007236475
> 
> Date Created:           Feb 27 2023
> Last Updated:           Feb 27 2023
> *******************************************************************************/
. 
. * Set up global directories and log file
. // global PATH "C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Proje
> ct/"w
. // global OUTPUT_PATH "$PATH/3 - Output"
. // global INPUT_PATH "$PATH/1 - Data"
. 
. * Directories for Ben
. global PATH "/Users/benlee/Documents/GitHub/eco375"

. global OUTPUT_PATH "$PATH/3 - Output"

. global INPUT_PATH "$PATH/1 - Data"

. 
. capture log close
