----------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/lijia/OneDrive - University of Toronto/Documents
> /School/1-5 ECO375/ECO375 Project//3 - Output/jacob_test_log.log
  log type:  text
 opened on:  22 Mar 2023, 15:01:49

. 
. cd "$INPUT_PATH/Tracts_2020_HOLC"
C:\Users\lijia\OneDrive - University of Toronto\Documents\School\1-5 E
> CO375\ECO375 Project\1 - Data\Tracts_2020_HOLC

. 
. * convert shapefile of HOLC to census tract crosswalk into dta forma
> t
. shp2dta using Tracts_2020_HOLC, database(Tracts_2020_HOLC) ///
>         coordinates(Tracts_2020_HOLC_coord) genid(id) replace
type: 5

. 
. * load dta created above
. use Tracts_2020_HOLC.dta

. 
. * clean data by removing extra 0s in the tract codes present in the 
> original dataset
. gen tract_code1 = substr(GISJOIN, 2, 2)

. gen tract_code2 = substr(GISJOIN, 5, 3)

. gen tract_code3 = substr(GISJOIN, 9, 6)

. egen tract_code = concat(tract_code*)

. drop tract_code1-tract_code3

. 
. egen perc_tract_a = total(SUM_Perc) if FIRST_holc == "A", by(tract_c
> ode)
(38,481 missing values generated)

. egen perc_tract_b = total(SUM_Perc) if FIRST_holc == "B", by(tract_c
> ode)
(32,395 missing values generated)

. egen perc_tract_c = total(SUM_Perc) if FIRST_holc == "C", by(tract_c
> ode)
(24,027 missing values generated)

. egen perc_tract_d = total(SUM_Perc) if FIRST_holc == "D", by(tract_c
> ode)
(31,338 missing values generated)

. 
. foreach var in perc_tract_a perc_tract_b perc_tract_c perc_tract_d {
  2.         replace `var' = 0 if `var' == .
  3.         replace `var' = 1 if `var' > 1
  4. }
(38,481 real changes made)
(0 real changes made)
(32,395 real changes made)
(12 real changes made)
(24,027 real changes made)
(132 real changes made)
(31,338 real changes made)
(52 real changes made)

. 
. 
. save "Tracts_2020_HOLC_cleaned.dta", replace
file Tracts_2020_HOLC_cleaned.dta saved

. 
. * import and clean voting data
. cd "$INPUT_PATH/Voting_census_block"
C:\Users\lijia\OneDrive - University of Toronto\Documents\School\1-5 E
> CO375\ECO375 Project\1 - Data\Voting_census_block

. clear all

. import delimited "2021blockgroupvoting.csv"
(encoding automatically selected: ISO-8859-1)
(9 vars, 233,866 obs)

. tostring blockgroup_geoid, replace format("%14.0f")
blockgroup_geoid was double now str12

. 
. replace blockgroup_geoid = "0" + blockgroup_geoid if strlen(blockgro
> up_geoid)==11
(43,877 real changes made)

. gen tract_code = substr(blockgroup_geoid, 1, 11)

. 
. egen tract_dem_total = total(dem), by(tract_code)

. egen tract_rep_total = total(rep), by(tract_code)

. egen tract_lib_total = total(lib), by(tract_code)

. egen tract_oth_total = total(oth), by(tract_code)

. gen tract_vote_total = tract_dem_total + tract_rep_total + tract_lib
> _total + tract_oth_total

. gen tract_dvoteshare = tract_dem_total / tract_vote_total
(145 missing values generated)

. gen tract_rvoteshare = tract_rep_total / tract_vote_total
(145 missing values generated)

. duplicates drop tract_code, force

Duplicates in terms of tract_code

(151,546 observations deleted)

. 
. drop rep-precincts

. drop blockgroup_geoid

. 
. save 2021blockgroupvoting_cleaned, replace
file 2021blockgroupvoting_cleaned.dta saved

. 
. * collapse HOLC data to tract level units of observation
. use "$INPUT_PATH/Tracts_2020_HOLC/Tracts_2020_HOLC_cleaned.dta"

. preserve

. collapse (max) perc_tract_* (first) GISJOIN MAX_city MAX_state , by(
> tract_code)

. save "$INPUT_PATH/Tracts_2020_HOLC/HOLC_collapsed.dta", replace
file C:/Users/lijia/OneDrive - University of
    Toronto/Documents/School/1-5 ECO375/ECO375 Project//1 -
    Data/Tracts_2020_HOLC/HOLC_collapsed.dta saved

. 
. restore

. 
. * merge datasets
. clear all

. use "$INPUT_PATH/Tracts_2020_HOLC/HOLC_collapsed.dta"

. merge m:1 tract_code using "$INPUT_PATH/Voting_census_block/2021bloc
> kgroupvoting_cleaned.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                        66,187
        from master                       230  (_merge==1)
        from using                     65,957  (_merge==2)

    Matched                            16,363  (_merge==3)
    -----------------------------------------

. * Three states did not report their results at the precinct level: S
> outh Dakota, Kentucky and West Virginia.
. 
. * clean merged dataset
. drop GISJOIN MAX_state

. rename MAX_city city

. 
. * remove census tracts that are not matched with HOLC tracts
. egen tract_holc_share = rowtotal(perc_tract_*)

. drop if tract_holc_share == 0
(65,957 observations deleted)

. drop if tract_holc_share > 1.05
(11 observations deleted)

. 
. save "$INPUT_PATH/Merge/HOLC_Voting_Merged.dta", replace
file C:/Users/lijia/OneDrive - University of
    Toronto/Documents/School/1-5 ECO375/ECO375 Project//1 -
    Data/Merge/HOLC_Voting_Merged.dta saved

. 
end of do-file

. do "C:\Users\lijia\AppData\Local\Temp\STD289c_000000.tmp"

. cd "$INPUT_PATH/Merge"
C:\Users\lijia\OneDrive - University of Toronto\Documents\School\1-5 E
> CO375\ECO375 Project\1 - Data\Merge

. use "HOLC_Voting_Merged.dta", clear

. 
. foreach file in "cleaned_Census Tract Population Data (2020).dta" \\
> \
{ required
r(100);

end of do-file

r(100);

. do "C:\Users\lijia\AppData\Local\Temp\STD289c_000000.tmp"

. cd "$INPUT_PATH/Merge"
C:\Users\lijia\OneDrive - University of Toronto\Documents\School\1-5 E
> CO375\ECO375 Project\1 - Data\Merge

. use "HOLC_Voting_Merged.dta", clear

. 
. foreach file in "cleaned_Census Tract Population Data (2020).dta" \\
> \
{ required
r(100);

end of do-file

r(100);

. do "C:\Users\lijia\AppData\Local\Temp\STD289c_000000.tmp"

. cd "$INPUT_PATH/Merge"
C:\Users\lijia\OneDrive - University of Toronto\Documents\School\1-5 E
> CO375\ECO375 Project\1 - Data\Merge

. use "HOLC_Voting_Merged.dta", clear

. 
end of do-file

. do "C:\Users\lijia\AppData\Local\Temp\STD289c_000000.tmp"

. foreach file in "cleaned_Census Tract Population Data (2020).dta" \\
> \
{ required
r(100);

end of do-file

r(100);

. do "C:\Users\lijia\AppData\Local\Temp\STD289c_000000.tmp"

. foreach file in "cleaned_Census Tract Population Data (2020).dta" "c
> leaned_Tract Level Income Data (2020)" "cleaned_Age and Sex Data" "c
> leaned_Education Data" {
  2.         capture drop _merge
  3.         merge 1:1 tract_code using "$INPUT_PATH/Covariates/`file'
> "
  4.         drop if _merge == 2
  5. }

    Result                      Number of obs
    -----------------------------------------
    Not matched                        68,813
        from master                         0  (_merge==1)
        from using                     68,813  (_merge==2)

    Matched                            16,582  (_merge==3)
    -----------------------------------------
(68,813 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        68,813
        from master                         0  (_merge==1)
        from using                     68,813  (_merge==2)

    Matched                            16,582  (_merge==3)
    -----------------------------------------
(68,813 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        68,813
        from master                         0  (_merge==1)
        from using                     68,813  (_merge==2)

    Matched                            16,582  (_merge==3)
    -----------------------------------------
(68,813 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        68,813
        from master                         0  (_merge==1)
        from using                     68,813  (_merge==2)

    Matched                            16,582  (_merge==3)
    -----------------------------------------
(68,813 observations deleted)

. 
end of do-file

. do "C:\Users\lijia\AppData\Local\Temp\STD289c_000000.tmp"

. * generate race proportion data
. foreach var of varlist pop_white pop_black pop_asian {
  2.         gen perc_`var' = `var' / pop_total
  3. }
(67 missing values generated)
(67 missing values generated)
(67 missing values generated)

. 
. save "$INPUT_PATH/Merge/HOLC_Voting_Covariates.dta", replace
(file C:/Users/lijia/OneDrive - University of
    Toronto/Documents/School/1-5 ECO375/ECO375 Project//1 -
    Data/Merge/HOLC_Voting_Covariates.dta not found)
file C:/Users/lijia/OneDrive - University of
    Toronto/Documents/School/1-5 ECO375/ECO375 Project//1 -
    Data/Merge/HOLC_Voting_Covariates.dta saved

. 
end of do-file

. do "C:\Users\lijia\AppData\Local\Temp\STD289c_000000.tmp"

. // Directories for Jacob
. global PATH "C:/Users/lijia/OneDrive - University of Toronto/Documen
> ts/School/1-5 ECO375/ECO375 Project/"

. global OUTPUT_PATH "$PATH/3 - Output"

. global INPUT_PATH "$PATH/1 - Data"

. 
. // * Directories for Ben
. // global PATH "/Users/benlee/Documents/GitHub/eco375"
. // global OUTPUT_PATH "$PATH/3 - Output"
. // global INPUT_PATH "$PATH/1 - Data"
. 
. cd "$OUTPUT_PATH"
C:\Users\lijia\OneDrive - University of Toronto\Documents\School\1-5 E
> CO375\ECO375 Project\3 - Output

. 
. capture log close
