------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/regression_analysis_log.log
  log type:  text
 opened on:   1 Apr 2023, 23:56:51

. 
. cd "$INPUT_PATH/Merge"
C:\Users\lijia\OneDrive - University of Toronto\Documents\School\1-5 ECO375\ECO375 Project\1 - Data\Merge

. 
. * Load collapsed data for regression
. use "HOLC_Voting_Covariates.dta", clear

. drop _merge

. replace _yr_median = _yr_median / 1000
variable _yr_median was long now double
(81,058 real changes made)

. replace male_female_ratio = male_female_ratio / 100
(81,630 real changes made)

. 
. 
. * label dataset
. foreach var of varlist perc_tract_a-perc_tract_d{
  2.         local name = "Grade " + strupper(substr("`var'", 12, 1)) + " share"
  3.         label variable `var' "`name'" 
  4. }

. label variable city "City"

. label variable state "State"

. label variable tract_dvoteshare "Dem share"

. label variable _yr_median "Median income ('000s)"

. label variable median_age "Median age"

. label variable male_female_ratio "M-F ratio"

. label variable perc_less_hs_total "Less HS share"

. label variable perc_hs_total "HS share"

. label variable perc_somecol_total "Some college share"

. label variable perc_bach_total "Bachelor's share"

. label variable perc_pop_white "White share"

. label variable perc_pop_black "Black share"

. label variable perc_pop_asian "Asian share"

. 
. * Generate variable that indicates if a tract has sufficient data for analysis
. gen incl = 0

. replace incl = 1 if tract_dem_total != . & pop_white != . & _yr_median != . & median_age != . & male_female_ratio != . & perc_less_hs_total != . & tract_holc_share > 0.9 & tract_holc_share < 1.05
(6,026 real changes made)

. 
. * Scatter plot
. twoway(scatter tract_dvoteshare perc_tract_d if incl == 1, msize(0.8) xtitle(, size(medlarge)) ytitle(, size(medlarge)))

. graph export "$OUTPUT_PATH\dshare_scatter.png", as(png) replace
file C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output\dshare_scatter.png saved as PNG format

. twoway(scatter tract_dvoteshare perc_tract_c if incl == 1, msize(0.8) xtitle(, size(medlarge)) ytitle(, size(medlarge)))

. graph export "$OUTPUT_PATH\cshare_scatter.png", as(png) replace
file C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output\cshare_scatter.png saved as PNG format

. 
. * Generate summary statistics
. eststo sum_stat: estpost sum perc_tract_a-perc_tract_d tract_dvoteshare _yr_median median_age male_female_ratio perc_less_hs_total-perc_pop_asian if incl == 1

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)     e(min)     e(max)     e(sum) 
-------------+----------------------------------------------------------------------------------------
perc_tract_a |      6026       6026   .0513216   .0326679   .1807426          0          1   309.2637 
perc_tract_b |      6026       6026   .2015847   .1121025    .334817          0          1    1214.75 
perc_tract_c |      6026       6026    .454133   .1774894   .4212949          0          1   2736.605 
perc_tract_d |      6026       6026   .2776713    .161035   .4012917          0          1   1673.247 
tract_dvot~e |      6026       6026   .7908419   .0221765   .1489178   .0415478   .9785084   4765.613 
  _yr_median |      6026       6026    63.3033   1310.938   36.20688      6.322    250.001   381465.7 
  median_age |      6026       6026   36.12061   42.13784   6.491367       10.9       72.4   217662.8 
male_femal~o |      6026       6026   .9592639   .0412585   .2031218       .347      4.103   5780.524 
perc_less_~l |      6026       6026   .1619919   .0138246   .1175782          0   .6462625   976.1634 
perc_hs_to~l |      6026       6026   .2508055   .0139715   .1182012          0   .7152256   1511.354 
perc_somec~l |      6026       6026   .2594869   .0089729   .0947256   .0181473   .8688588   1563.668 
perc_bach_~l |      6026       6026   .3277157   .0536631   .2316529    .007326   .9444444   1974.815 
perc_pop_w~e |      6026       6026   .3986796   .0837374   .2893742    .001224   .9546859   2402.443 
perc_pop_b~k |      6026       6026   .2688388   .0907404   .3012314          0   .9755827   1620.023 
perc_pop_a~n |      6026       6026   .0888438   .0173498   .1317188          0   .9106402    535.373 

. eststo sum_stat_not: estpost sum tract_dvoteshare _yr_median median_age male_female_ratio perc_less_hs_total-perc_pop_asian if incl == 0

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)     e(min)     e(max)     e(sum) 
-------------+----------------------------------------------------------------------------------------
tract_dvot~e |     76150      76150   .5141322   .0426592   .2065411          0          1   39151.17 
  _yr_median |     75032      75032   71.26697   1222.534   34.96475        2.5    250.001    5347303 
  median_age |     75604      75604   40.10454   70.88898   8.419559         10       89.2    3032064 
male_femal~o |     75604      75604   1.274347   275.7291   16.60509       .002     2429.5   96345.75 
perc_less_~l |     75712      75712   .1159134   .0087147   .0933526          0          1   8776.034 
perc_hs_to~l |     75712      75712   .2798682   .0125793   .1121575          0          1   21189.38 
perc_somec~l |     75712      75712   .3096169   .0081872    .090483          0          1   23441.71 
perc_bach_~l |     75712      75712   .2946016    .033827   .1839211          0          1   22304.87 
perc_pop_w~e |     75941      75941   .6533937   .0665953   .2580607          0          1   49619.37 
perc_pop_b~k |     75941      75941   .1212174   .0358684   .1893895          0          1   9205.368 
perc_pop_a~n |     75941      75941   .0532856   .0088424   .0940338          0          1   4046.559 

. 
. esttab sum_stat sum_stat_not using "$OUTPUT_PATH\sum_stat.tex", ///
> cells("count(pattern(1 1) fmt(%8.0f)) mean(fmt(%8.2g) pattern(1 1)) sd(fmt(%8.2g) pattern(1 1)) min(fmt(%8.2g) pattern(1 1)) max(fmt(%8.2g) pattern(1 1))") /// 
> label mtitles("Census tracts in study" "Census tracts not in study") nodepvar nonumbers booktabs replace
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output\sum_stat.tex)

. 
. * Regression
. eststo reg_baseline: regress tract_dvoteshare perc_tract_d if incl == 1, robust

Linear regression                               Number of obs     =      6,026
                                                F(1, 6024)        =     318.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0397
                                                Root MSE          =     .14595

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0739029   .0041403    17.85   0.000     .0657864    .0820194
       _cons |   .7703212   .0024052   320.28   0.000     .7656062    .7750362
------------------------------------------------------------------------------

. esttab reg_baseline using "$OUTPUT_PATH/base_regression.tex", ///
> se star(* 0.10 **       0.05 *** 0.01) replace booktabs label
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/base_regression.tex)

. estadd local city_controls "No"

added macro:
      e(city_controls) : "No"

. estadd local cluster_se "No"

added macro:
         e(cluster_se) : "No"

. 
. 
. * Robustness check -- does changing the tract_holc_share cutoff affect results?
. quietly

. foreach min_perc of numlist 0 5:100 {
  2.         eststo robustness_`min_perc': reg tract_dvoteshare perc_tract_d if tract_holc_share*100 >= `min_perc', robust
  3. }

Linear regression                               Number of obs     =     16,363
                                                F(1, 16361)       =    1483.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0608
                                                Root MSE          =     .15839

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1302126   .0033806    38.52   0.000     .1235862    .1368391
       _cons |   .7172509   .0014744   486.47   0.000      .714361    .7201409
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     14,593
                                                F(1, 14591)       =    1086.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0525
                                                Root MSE          =     .15415

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1130163   .0034288    32.96   0.000     .1062954    .1197371
       _cons |    .729631    .001545   472.25   0.000     .7266026    .7326595
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     14,081
                                                F(1, 14079)       =     985.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0502
                                                Root MSE          =     .15298

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1081631   .0034456    31.39   0.000     .1014093     .114917
       _cons |   .7332124   .0015692   467.27   0.000     .7301367    .7362882
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     13,638
                                                F(1, 13636)       =     914.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0486
                                                Root MSE          =     .15222

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1046589   .0034615    30.24   0.000     .0978739    .1114438
       _cons |   .7360549   .0015935   461.90   0.000     .7329313    .7391785
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     13,228
                                                F(1, 13226)       =     852.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0472
                                                Root MSE          =     .15145

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1014156   .0034739    29.19   0.000     .0946063     .108225
       _cons |   .7388256   .0016153   457.40   0.000     .7356594    .7419917
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     12,825
                                                F(1, 12823)       =     795.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0459
                                                Root MSE          =     .15052

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0982716   .0034851    28.20   0.000     .0914402     .105103
       _cons |    .741394   .0016352   453.40   0.000     .7381888    .7445992
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     12,413
                                                F(1, 12411)       =     739.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0445
                                                Root MSE          =     .14988

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0951203   .0034987    27.19   0.000     .0882623    .1019782
       _cons |   .7440399   .0016599   448.26   0.000     .7407864    .7472935
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     12,010
                                                F(1, 12008)       =     700.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0441
                                                Root MSE          =     .14892

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0930007   .0035126    26.48   0.000     .0861154     .099886
       _cons |   .7462973   .0016843   443.09   0.000     .7429958    .7495988
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     11,582
                                                F(1, 11580)       =     664.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0435
                                                Root MSE          =     .14865

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0910715   .0035324    25.78   0.000     .0841475    .0979955
       _cons |   .7481665   .0017165   435.86   0.000     .7448018    .7515312
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     11,176
                                                F(1, 11174)       =     632.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0430
                                                Root MSE          =     .14845

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0893263   .0035518    25.15   0.000     .0823641    .0962885
       _cons |   .7497548   .0017467   429.23   0.000     .7463309    .7531787
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     10,661
                                                F(1, 10659)       =     597.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0429
                                                Root MSE          =     .14768

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0873752   .0035757    24.44   0.000     .0803662    .0943842
       _cons |   .7523972   .0017829   422.01   0.000     .7489024     .755892
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     10,135
                                                F(1, 10133)       =     555.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0422
                                                Root MSE          =     .14696

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0849367   .0036045    23.56   0.000     .0778713    .0920022
       _cons |   .7553551   .0018276   413.31   0.000     .7517727    .7589374
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      9,666
                                                F(1, 9664)        =     518.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0414
                                                Root MSE          =     .14637

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0827288   .0036342    22.76   0.000      .075605    .0898526
       _cons |   .7572714    .001867   405.61   0.000     .7536117    .7609311
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      9,175
                                                F(1, 9173)        =     491.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0412
                                                Root MSE          =     .14635

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |    .081482   .0036761    22.17   0.000      .074276    .0886881
       _cons |   .7586105   .0019165   395.82   0.000     .7548537    .7623673
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      8,628
                                                F(1, 8626)        =     452.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0404
                                                Root MSE          =     .14653

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0795624   .0037384    21.28   0.000     .0722343    .0868905
       _cons |   .7606502   .0019854   383.13   0.000     .7567584     .764542
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      8,069
                                                F(1, 8067)        =     415.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0396
                                                Root MSE          =     .14666

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0776134   .0038086    20.38   0.000     .0701475    .0850793
       _cons |   .7628806   .0020577   370.75   0.000      .758847    .7669142
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      7,445
                                                F(1, 7443)        =     388.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0398
                                                Root MSE          =     .14624

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0764053   .0038784    19.70   0.000     .0688026     .084008
       _cons |   .7654309   .0021451   356.84   0.000      .761226    .7696358
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      6,755
                                                F(1, 6753)        =     366.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0410
                                                Root MSE          =      .1458

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0759771   .0039661    19.16   0.000     .0682022     .083752
       _cons |   .7674711   .0022587   339.79   0.000     .7630434    .7718989
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      6,084
                                                F(1, 6082)        =     321.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0401
                                                Root MSE          =     .14608

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0741973   .0041352    17.94   0.000     .0660907    .0823038
       _cons |   .7706248   .0023961   321.61   0.000     .7659275     .775322
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,207
                                                F(1, 5205)        =     288.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0409
                                                Root MSE          =     .14601

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0741168    .004364    16.98   0.000     .0655615    .0826721
       _cons |   .7752414   .0025946   298.79   0.000     .7701549    .7803279
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,011
                                                F(1, 3009)        =     174.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0425
                                                Root MSE          =      .1437

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0714881   .0054135    13.21   0.000     .0608735    .0821027
       _cons |   .7857163   .0034408   228.35   0.000     .7789697    .7924629
------------------------------------------------------------------------------

. esttab robustness_* using "$OUTPUT_PATH/min_tract_holc_share_robustness.csv", se star(* 0.10 ** 0.05 *** 0.01) replace
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/min_tract_holc_share_robustness.csv)

. 
. drop _est_robustness*

. 
. * Robustness check -- does changing the way we measure redlining affect results?
. eststo robustness2_d: regress tract_dvoteshare perc_tract_d if incl == 1

      Source |       SS           df       MS      Number of obs   =     6,026
-------------+----------------------------------   F(1, 6024)      =    248.78
       Model |  5.29907482         1  5.29907482   Prob > F        =    0.0000
    Residual |   128.31445     6,024   .02130054   R-squared       =    0.0397
-------------+----------------------------------   Adj R-squared   =    0.0395
       Total |  133.613525     6,025  .022176519   Root MSE        =    .14595

------------------------------------------------------------------------------
tract_dvot~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0739029   .0046855    15.77   0.000     .0647176    .0830882
       _cons |   .7703212   .0022864   336.92   0.000     .7658391    .7748033
------------------------------------------------------------------------------

. gen perc_tract_c_plus_d = perc_tract_c + perc_tract_d
(65,957 missing values generated)

. eststo robustness2_c_plus_d: regress tract_dvoteshare perc_tract_c_plus_d if incl == 1

      Source |       SS           df       MS      Number of obs   =     6,026
-------------+----------------------------------   F(1, 6024)      =    116.09
       Model |   2.5262533         1   2.5262533   Prob > F        =    0.0000
    Residual |  131.087272     6,024  .021760835   R-squared       =    0.0189
-------------+----------------------------------   Adj R-squared   =    0.0187
       Total |  133.613525     6,025  .022176519   Root MSE        =    .14752

-------------------------------------------------------------------------------------
   tract_dvoteshare | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
perc_tract_c_plus_d |   .0534715   .0049627    10.77   0.000     .0437428    .0632003
              _cons |   .7517112   .0040989   183.39   0.000     .7436759    .7597465
-------------------------------------------------------------------------------------

. eststo robustness2_c_and_d: regress tract_dvoteshare perc_tract_c perc_tract_d if incl == 1

      Source |       SS           df       MS      Number of obs   =     6,026
-------------+----------------------------------   F(2, 6023)      =    135.65
       Model |  5.75895195         2  2.87947597   Prob > F        =    0.0000
    Residual |  127.854573     6,023  .021227723   R-squared       =    0.0431
-------------+----------------------------------   Adj R-squared   =    0.0428
       Total |  133.613525     6,025  .022176519   Root MSE        =     .1457

------------------------------------------------------------------------------
tract_dvot~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_c |   .0251855    .005411     4.65   0.000     .0145779     .035793
perc_tract_d |   .0889074   .0056808    15.65   0.000     .0777711    .1000437
       _cons |   .7547173   .0040557   186.09   0.000     .7467667    .7626679
------------------------------------------------------------------------------

. eststo robustness2_b_c_d: regress tract_dvoteshare perc_tract_a perc_tract_c perc_tract_d if incl == 1

      Source |       SS           df       MS      Number of obs   =     6,026
-------------+----------------------------------   F(3, 6022)      =     90.84
       Model |  5.78446969         3  1.92815656   Prob > F        =    0.0000
    Residual |  127.829055     6,022   .02122701   R-squared       =    0.0433
-------------+----------------------------------   Adj R-squared   =    0.0428
       Total |  133.613525     6,025  .022176519   Root MSE        =    .14569

------------------------------------------------------------------------------
tract_dvot~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_a |  -.0129803   .0118388    -1.10   0.273    -.0361885     .010228
perc_tract_c |   .0221873   .0060627     3.66   0.000     .0103023    .0340723
perc_tract_d |   .0860432   .0062526    13.76   0.000     .0737859    .0983004
       _cons |   .7575403   .0048039   157.69   0.000      .748123    .7669577
------------------------------------------------------------------------------

. 
. esttab robustness2_* using "$OUTPUT_PATH/redlining_measure_robustness.csv", se star(* 0.10 ** 0.05 *** 0.01) replace
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/redlining_measure_robustness.csv)

. 
. noisily

. * Regression with selected covariates
. regress tract_dvoteshare perc_tract_d _yr_median perc_pop_white perc_pop_black ///
> perc_pop_asian if incl == 1, robust

Linear regression                               Number of obs     =      6,026
                                                F(5, 6020)        =    1451.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4373
                                                Root MSE          =     .11176

--------------------------------------------------------------------------------
               |               Robust
tract_dvotes~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
  perc_tract_d |   .0381437   .0031416    12.14   0.000     .0319851    .0443024
    _yr_median |   .0012724   .0000606    20.99   0.000     .0011535    .0013912
perc_pop_white |  -.2083987   .0083666   -24.91   0.000    -.2248003   -.1919972
perc_pop_black |   .1868163   .0043499    42.95   0.000     .1782888    .1953437
perc_pop_asian |  -.1567524   .0115021   -13.63   0.000    -.1793007   -.1342041
         _cons |    .746491   .0042465   175.79   0.000     .7381664    .7548156
--------------------------------------------------------------------------------

. 
. * Regression with selected covariates and city fixed effects
. encode city, generate(city2)

. gen perc_tract_d_sq = perc_tract_d^2
(65,957 missing values generated)

. gen perc_tract_d_cu = perc_tract_d^3
(65,957 missing values generated)

. label variable perc_tract_d_sq "Grade D squared"

. label variable perc_tract_d_cu "Grade D cubed"

. 
. gen perc_tract_c_sq = perc_tract_c^2
(65,957 missing values generated)

. gen perc_tract_c_cu = perc_tract_c^3
(65,957 missing values generated)

. label variable perc_tract_c_sq "Grade C squared"

. label variable perc_tract_c_cu "Grade C cubed"

. 
. global indep_vars perc_tract_d* perc_tract_c*

. 
. global controls _yr_median-male_female_ratio perc_hs_total-perc_pop_asian

. 
. #delimit ;
delimiter now ;
. eststo reg_base_c_d: regress tract_dvoteshare perc_tract_d perc_tract_c
> i.city2 if incl == 1, cluster(city2);

Linear regression                               Number of obs     =      6,026
                                                F(1, 165)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2831
                                                Root MSE          =     .12787

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |   .0803516   .0178641     4.50   0.000       .04508    .1156233
                     perc_tract_c |   .0222173   .0114498     1.94   0.054    -.0003896    .0448243
                                  |
                            city2 |
                          Albany  |   .1397589   .0045283    30.86   0.000      .130818    .1486998
                         Altoona  |  -.3177146   .0017943  -177.07   0.000    -.3212573   -.3141718
                        Amarillo  |  -.3046322   .0073298   -41.56   0.000    -.3191045   -.2901599
                       Arlington  |   .1761391    .002875    61.27   0.000     .1704626    .1818156
                         Atlanta  |   .1614598   .0060361    26.75   0.000     .1495419    .1733778
                   Atlantic City  |   .1173564   .0095717    12.26   0.000     .0984576    .1362551
                         Augusta  |   .2190935    .019938    10.99   0.000     .1797269      .25846
                          Aurora  |   .1020932   .0090336    11.30   0.000     .0842569    .1199296
                          Austin  |   .1462617   .0091821    15.93   0.000     .1281321    .1643914
                       Baltimore  |   .2151978   .0073862    29.13   0.000     .2006141    .2297816
                        Bay City  |  -.1231953   .0089236   -13.81   0.000    -.1408146   -.1055761
                        Beaumont  |   .2283257   .0040399    56.52   0.000     .2203491    .2363022
                         Belmont  |   .1307263   .0010381   125.93   0.000     .1286767     .132776
                      Bergen Co.  |  -.0218142   .0008545   -25.53   0.000    -.0235014   -.0201271
                      Birmingham  |   .1666932   .0085321    19.54   0.000     .1498471    .1835394
                          Boston  |     .16643      .0049    33.97   0.000     .1567553    .1761047
                        Brockton  |   .1550932   .0037413    41.45   0.000     .1477063    .1624801
                           Bronx  |    .140103   .0036326    38.57   0.000     .1329307    .1472753
                       Brookline  |   .2077469   .0031418    66.12   0.000     .2015435    .2139502
                        Brooklyn  |   .0348491   .0060898     5.72   0.000     .0228251     .046873
                         Buffalo  |   .1424335    .001527    93.28   0.000     .1394185    .1454485
                       Cambridge  |   .1954652    .005874    33.28   0.000     .1838674    .2070631
                          Camden  |   .0203978   .0011207    18.20   0.000     .0181851    .0226106
                          Canton  |   .0076507   .0020813     3.68   0.000     .0035414      .01176
                       Charlotte  |    .055573   .0059078     9.41   0.000     .0439083    .0672377
                     Chattanooga  |   .0537668   .0001901   282.78   0.000     .0533914    .0541422
                         Chelsea  |   .0894399   .0064177    13.94   0.000     .0767686    .1021112
                         Chicago  |   .1733806    .004059    42.71   0.000     .1653663    .1813949
                       Cleveland  |   .1301241   .0025698    50.64   0.000     .1250502    .1351981
                        Columbia  |   .0563019    .007092     7.94   0.000     .0422992    .0703046
                        Columbus  |   .1221186   .0020697    59.00   0.000      .118032    .1262052
                  Council Bluffs  |  -.2016495   .0096138   -20.97   0.000    -.2206315   -.1826675
                          Dallas  |   .0428791   .0010632    40.33   0.000     .0407799    .0449783
                       Davenport  |  -.0685464   .0014019   -48.90   0.000    -.0713143   -.0657784
                          Dayton  |   .0303442    .002899    10.47   0.000     .0246204    .0360681
                         Decatur  |   .0096372   .0015492     6.22   0.000     .0065783     .012696
                          Denver  |   .1619336   .0035389    45.76   0.000     .1549463    .1689209
                      Des Moines  |   .0064304   .0049646     1.30   0.197     -.003372    .0162328
                         Detroit  |   .1374038   .0036714    37.43   0.000     .1301548    .1446527
                         Dubuque  |  -.0734434   .0054026   -13.59   0.000    -.0841105   -.0627762
                          Duluth  |   .1041384   .0023112    45.06   0.000     .0995751    .1087017
                          Durham  |   .2117966   .0111013    19.08   0.000     .1898777    .2337155
                  East St. Louis  |   .2656567   .0070164    37.86   0.000     .2518032    .2795102
                         El Paso  |   .0728735   .0051332    14.20   0.000     .0627382    .0830088
                          Elmira  |   -.104126   .0016542   -62.95   0.000    -.1073922   -.1008599
                            Erie  |  -.0005126   .0018178    -0.28   0.778    -.0041018    .0030766
                       Essex Co.  |   .1712233   .0042674    40.12   0.000     .1627975    .1796491
                      Evansville  |  -.0401757   .0014993   -26.80   0.000    -.0431359   -.0372155
                         Everett  |   .0118892   .0032027     3.71   0.000     .0055658    .0182127
                           Flint  |   .2861592   .0012231   233.95   0.000     .2837442    .2885743
                      Fort Wayne  |    .006604   .0012969     5.09   0.000     .0040433    .0091647
                      Fort Worth  |    .048587   .0067879     7.16   0.000     .0351848    .0619893
                          Fresno  |   .0626042   .0021332    29.35   0.000     .0583923    .0668161
                       Galveston  |  -.0016824   .0064469    -0.26   0.794    -.0144115    .0110468
                    Grand Rapids  |     .04863   .0011618    41.86   0.000     .0463362    .0509238
             Greater Kansas City  |   .1227589   .0078947    15.55   0.000     .1071713    .1383466
                      Greensboro  |   .1771778   .0010157   174.44   0.000     .1751724    .1791833
                      Harrisburg  |   .1879655   .0076307    24.63   0.000     .1728991     .203032
                        Hartford  |   .1950689   .0002889   675.32   0.000     .1944986    .1956393
                Holyoke Chicopee  |  -.0429498   .0012753   -33.68   0.000    -.0454678   -.0404318
                         Houston  |   .1167611   .0063318    18.44   0.000     .1042592    .1292629
                      Hudson Co.  |   .0409966   .0073598     5.57   0.000      .026465    .0555282
                    Indianapolis  |   .0506998   .0033647    15.07   0.000     .0440564    .0573431
                         Jackson  |  -.0299842   .0046762    -6.41   0.000    -.0392171   -.0207514
                    Jacksonville  |   .0687821   .0085619     8.03   0.000     .0518771    .0856871
                       Johnstown  |  -.2520514   .0029408   -85.71   0.000    -.2578579   -.2462449
                          Joliet  |   .0078822    .002796     2.82   0.005     .0023617    .0134026
                         Kenosha  |  -.1440122    .003652   -39.43   0.000    -.1512228   -.1368016
                       Knoxville  |  -.0069279   .0068894    -1.01   0.316    -.0205307    .0066748
                   Lake Co. Gary  |   .2117593   .0050073    42.29   0.000     .2018726     .221646
                         Lansing  |   .0645308   .0020668    31.22   0.000       .06045    .0686117
                            Lima  |  -.1287248   .0009929  -129.64   0.000    -.1306853   -.1267643
                         Lincoln  |  -.0056949   .0013484    -4.22   0.000    -.0083572   -.0030326
                     Little Rock  |   .2116575    .001619   130.73   0.000     .2084609    .2148541
                     Los Angeles  |   .1116918   .0033735    33.11   0.000      .105031    .1183525
           Lower Westchester Co.  |   .0211073    .003529     5.98   0.000     .0141396    .0280751
                           Macon  |   .0864375   .0185002     4.67   0.000       .04991    .1229651
                         Madison  |   .1708974   .0017311    98.72   0.000     .1674794    .1743154
                          Malden  |   .0120698   .0096779     1.25   0.214    -.0070388    .0311783
                      Manchester  |  -.0954221   .0021127   -45.17   0.000    -.0995935   -.0912508
                       Manhattan  |   .1634393   .0125157    13.06   0.000     .1387278    .1881509
                         Medford  |   .0362475   .0028265    12.82   0.000     .0306666    .0418284
                         Melrose  |   .0555192   .0012578    44.14   0.000     .0530358    .0580026
                         Memphis  |   .1575357   .0075594    20.84   0.000       .14261    .1724613
                           Miami  |  -.0568646   .0036474   -15.59   0.000    -.0640662    -.049663
                   Milwaukee Co.  |   .1367105   .0051826    26.38   0.000     .1264777    .1469432
                     Minneapolis  |   .2085114   .0028318    73.63   0.000     .2029201    .2141027
                          Mobile  |  -.0359382   .0053951    -6.66   0.000    -.0465906   -.0252857
                      Montgomery  |   .0545219   .0091278     5.97   0.000     .0364997    .0725442
                        Muskegon  |   .2267153   .0133427    16.99   0.000     .2003709    .2530598
                       Nashville  |   .0289465   .0103124     2.81   0.006     .0085852    .0493077
                     New Britain  |   .0200947   .0008907    22.56   0.000     .0183361    .0218533
                      New Castle  |  -.1703353   .0048766   -34.93   0.000    -.1799638   -.1607068
                       New Haven  |   .0198526   .0010267    19.34   0.000     .0178255    .0218797
                     New Orleans  |   .1641381   .0087599    18.74   0.000     .1468422    .1814341
                          Newton  |   .1571593   .0011382   138.07   0.000     .1549119    .1594068
                   Niagara Falls  |   .0349096   .0022677    15.39   0.000     .0304322     .039387
                         Norfolk  |   .1305735   .0082677    15.79   0.000     .1142495    .1468976
                         Oakland  |   .2277356   .0044838    50.79   0.000     .2188827    .2365886
                           Ogden  |  -.1302102   .0046863   -27.79   0.000    -.1394631   -.1209574
                   Oklahoma City  |   .0199577   .0022094     9.03   0.000     .0155953    .0243201
                           Omaha  |   .0521888   .0043508    12.00   0.000     .0435984    .0607792
                         Oshkosh  |  -.1200674   .0153577    -7.82   0.000    -.1503904   -.0897444
       Pawtucket & Central Falls  |   .0274089   .0030703     8.93   0.000     .0213467    .0334711
                          Peoria  |   .1126448   .0064078    17.58   0.000     .0999928    .1252967
                    Philadelphia  |   .1691256   .0082312    20.55   0.000     .1528736    .1853776
                         Phoenix  |   .1151802    .006635    17.36   0.000     .1020797    .1282808
                      Pittsburgh  |   .1157053   .0045573    25.39   0.000     .1067072    .1247033
                         Pontiac  |   .1745124   .0043354    40.25   0.000     .1659523    .1830724
                     Port Arthur  |   .1220282    .005602    21.78   0.000     .1109673     .133089
                        Portland  |   .2113334   .0033177    63.70   0.000     .2047828     .217884
                    Poughkeepsie  |   .1002238   .0036045    27.81   0.000     .0931069    .1073407
                      Providence  |   .1138032   .0013155    86.51   0.000     .1112059    .1164005
                          Pueblo  |  -.0266273   .0042162    -6.32   0.000     -.034952   -.0183026
                          Queens  |    .079604   .0027038    29.44   0.000     .0742655    .0849426
                          Quincy  |  -.0028278   .0024501    -1.15   0.250    -.0076655    .0020098
                          Racine  |  -.0565103   .0002182  -258.93   0.000    -.0569412   -.0560794
                          Revere  |  -.0128728   .0053562    -2.40   0.017    -.0234482   -.0022973
                        Richmond  |   .0919597    .001011    90.96   0.000     .0899636    .0939558
                       Rochester  |   .1621251   .0033608    48.24   0.000     .1554893    .1687608
                        Rockford  |   -.031092   .0049743    -6.25   0.000    -.0409135   -.0212706
                      Sacramento  |   .1405604   .0033086    42.48   0.000     .1340277     .147093
                         Saginaw  |   .0650281   .0023858    27.26   0.000     .0603174    .0697388
                  Salt Lake City  |   .0987066   .0058446    16.89   0.000     .0871668    .1102464
                     San Antonio  |    .078631   .0064655    12.16   0.000     .0658652    .0913967
                       San Diego  |    .086021     .00636    13.53   0.000     .0734635    .0985786
                   San Francisco  |   .1633553   .0061748    26.46   0.000     .1511635     .175547
                        San Jose  |   .1207163   .0034891    34.60   0.000     .1138273    .1276053
                        Savannah  |   .2216112   .0007736   286.48   0.000     .2200839    .2231386
                     Schenectady  |  -.1229428   .0045866   -26.80   0.000    -.1319988   -.1138869
                         Seattle  |    .220179   .0037249    59.11   0.000     .2128244    .2275336
                      Shreveport  |   .0977223    .001936    50.48   0.000     .0938998    .1015448
                      Sioux City  |  -.1688011   .0059802   -28.23   0.000    -.1806087   -.1569935
                      Somerville  |   .2134427   .0034063    62.66   0.000     .2067172    .2201681
                      South Bend  |   .0418898   .0010366    40.41   0.000     .0398431    .0439365
                         Spokane  |   -.083167   .0014613   -56.91   0.000    -.0860522   -.0802818
                     Springfield  |   -.006648   .0082422    -0.81   0.421    -.0229218    .0096257
                      St. Joseph  |   -.178031   .0192877    -9.23   0.000    -.2161136   -.1399484
                       St. Louis  |    .196387   .0036767    53.41   0.000     .1891276    .2036464
                        St. Paul  |   .1474864   .0039933    36.93   0.000     .1396019    .1553709
                  St. Petersburg  |   .0861872   .0050074    17.21   0.000     .0763003    .0960741
Stamford, Darien, and New Canaan  |   .0554071   .0043742    12.67   0.000     .0467704    .0640437
                   Staten Island  |  -.1355775   .0056874   -23.84   0.000     -.146807    -.124348
                        Stockton  |   .0598006   .0024435    24.47   0.000      .054976    .0646251
                        Syracuse  |   .0625485   .0005928   105.52   0.000     .0613781    .0637189
                          Tacoma  |   .0118129   .0042479     2.78   0.006     .0034257    .0202002
                           Tampa  |   .0293785   .0120402     2.44   0.016     .0056058    .0531512
                     Terre Haute  |  -.0821028   .0041643   -19.72   0.000     -.090325   -.0738806
                          Toledo  |   .0754829     .00138    54.70   0.000     .0727583    .0782076
                          Topeka  |  -.0252782   .0037404    -6.76   0.000    -.0326635   -.0178929
                         Trenton  |   .1486592   .0017436    85.26   0.000     .1452166    .1521019
                           Tulsa  |   .0155051   .0057468     2.70   0.008     .0041583    .0268518
                       Union Co.  |   .0627961   .0015514    40.48   0.000     .0597329    .0658592
                           Utica  |  -.0654027   .0015069   -43.40   0.000    -.0683779   -.0624275
                            Waco  |   .0375644   .0020167    18.63   0.000     .0335826    .0415462
                          Warren  |  -.0517784   .0034817   -14.87   0.000    -.0586528    -.044904
                       Waterbury  |   .0370982   .0024273    15.28   0.000     .0323057    .0418908
                        Waterloo  |   .0003229   .0071992     0.04   0.964    -.0138916    .0145374
                       Watertown  |   .0849855   .0058101    14.63   0.000     .0735139    .0964572
                         Wichita  |  -.0596591   .0129059    -4.62   0.000     -.085141   -.0341772
                    Wilkes-Barre  |  -.0678786    .005602   -12.12   0.000    -.0789395   -.0568178
                   Winston-Salem  |   .1887663   .0071752    26.31   0.000     .1745993    .2029333
                      Woonsocket  |   -.117624    .003131   -37.57   0.000     -.123806    -.111442
                            York  |    .051306    .004152    12.36   0.000      .043108    .0595039
                      Youngstown  |   .0589885   .0040414    14.60   0.000     .0510091     .066968
                                  |
                            _cons |   .6508363    .005602   116.18   0.000     .6397754    .6618972
---------------------------------------------------------------------------------------------------

. testparm i.city2;

 ( 1)  2.city2 = 0
 ( 2)  3.city2 = 0
 ( 3)  4.city2 = 0
 ( 4)  5.city2 = 0
 ( 5)  7.city2 = 0
 ( 6)  8.city2 = 0
 ( 7)  9.city2 = 0
 ( 8)  10.city2 = 0
 ( 9)  11.city2 = 0
 (10)  12.city2 = 0
 (11)  14.city2 = 0
 (12)  15.city2 = 0
 (13)  16.city2 = 0
 (14)  17.city2 = 0
 (15)  20.city2 = 0
 (16)  21.city2 = 0
 (17)  23.city2 = 0
 (18)  24.city2 = 0
 (19)  25.city2 = 0
 (20)  26.city2 = 0
 (21)  27.city2 = 0
 (22)  28.city2 = 0
 (23)  29.city2 = 0
 (24)  30.city2 = 0
 (25)  32.city2 = 0
 (26)  33.city2 = 0
 (27)  34.city2 = 0
 (28)  36.city2 = 0
 (29)  37.city2 = 0
 (30)  38.city2 = 0
 (31)  39.city2 = 0
 (32)  40.city2 = 0
 (33)  42.city2 = 0
 (34)  43.city2 = 0
 (35)  44.city2 = 0
 (36)  45.city2 = 0
 (37)  47.city2 = 0
 (38)  48.city2 = 0
 (39)  49.city2 = 0
 (40)  50.city2 = 0
 (41)  51.city2 = 0
 (42)  52.city2 = 0
 (43)  53.city2 = 0
 (44)  54.city2 = 0
 (45)  55.city2 = 0
 (46)  56.city2 = 0
 (47)  57.city2 = 0
 (48)  58.city2 = 0
 (49)  59.city2 = 0
 (50)  60.city2 = 0
 (51)  61.city2 = 0
 (52)  62.city2 = 0
 (53)  63.city2 = 0
 (54)  64.city2 = 0
 (55)  65.city2 = 0
 (56)  66.city2 = 0
 (57)  67.city2 = 0
 (58)  69.city2 = 0
 (59)  70.city2 = 0
 (60)  72.city2 = 0
 (61)  73.city2 = 0
 (62)  74.city2 = 0
 (63)  76.city2 = 0
 (64)  77.city2 = 0
 (65)  78.city2 = 0
 (66)  79.city2 = 0
 (67)  80.city2 = 0
 (68)  82.city2 = 0
 (69)  83.city2 = 0
 (70)  84.city2 = 0
 (71)  86.city2 = 0
 (72)  88.city2 = 0
 (73)  89.city2 = 0
 (74)  90.city2 = 0
 (75)  92.city2 = 0
 (76)  94.city2 = 0
 (77)  96.city2 = 0
 (78)  97.city2 = 0
 (79)  98.city2 = 0
 (80)  99.city2 = 0
 (81)  100.city2 = 0
 (82)  101.city2 = 0
 (83)  102.city2 = 0
 (84)  103.city2 = 0
 (85)  104.city2 = 0
 (86)  106.city2 = 0
 (87)  107.city2 = 0
 (88)  108.city2 = 0
 (89)  109.city2 = 0
 (90)  111.city2 = 0
 (91)  112.city2 = 0
 (92)  114.city2 = 0
 (93)  115.city2 = 0
 (94)  116.city2 = 0
 (95)  117.city2 = 0
 (96)  119.city2 = 0
 (97)  120.city2 = 0
 (98)  121.city2 = 0
 (99)  122.city2 = 0
 (100)  123.city2 = 0
 (101)  124.city2 = 0
 (102)  125.city2 = 0
 (103)  126.city2 = 0
 (104)  127.city2 = 0
 (105)  128.city2 = 0
 (106)  129.city2 = 0
 (107)  130.city2 = 0
 (108)  131.city2 = 0
 (109)  132.city2 = 0
 (110)  133.city2 = 0
 (111)  134.city2 = 0
 (112)  136.city2 = 0
 (113)  137.city2 = 0
 (114)  138.city2 = 0
 (115)  139.city2 = 0
 (116)  140.city2 = 0
 (117)  141.city2 = 0
 (118)  142.city2 = 0
 (119)  143.city2 = 0
 (120)  145.city2 = 0
 (121)  146.city2 = 0
 (122)  147.city2 = 0
 (123)  148.city2 = 0
 (124)  149.city2 = 0
 (125)  150.city2 = 0
 (126)  151.city2 = 0
 (127)  152.city2 = 0
 (128)  153.city2 = 0
 (129)  155.city2 = 0
 (130)  156.city2 = 0
 (131)  157.city2 = 0
 (132)  158.city2 = 0
 (133)  159.city2 = 0
 (134)  160.city2 = 0
 (135)  161.city2 = 0
 (136)  162.city2 = 0
 (137)  163.city2 = 0
 (138)  164.city2 = 0
 (139)  165.city2 = 0
 (140)  166.city2 = 0
 (141)  167.city2 = 0
 (142)  168.city2 = 0
 (143)  169.city2 = 0
 (144)  170.city2 = 0
 (145)  171.city2 = 0
 (146)  172.city2 = 0
 (147)  173.city2 = 0
 (148)  174.city2 = 0
 (149)  175.city2 = 0
 (150)  176.city2 = 0
 (151)  177.city2 = 0
 (152)  179.city2 = 0
 (153)  180.city2 = 0
 (154)  181.city2 = 0
 (155)  182.city2 = 0
 (156)  184.city2 = 0
 (157)  185.city2 = 0
 (158)  186.city2 = 0
 (159)  187.city2 = 0
 (160)  189.city2 = 0
 (161)  190.city2 = 0
 (162)  192.city2 = 0
 (163)  194.city2 = 0
 (164)  195.city2 = 0
 (165)  196.city2 = 0
       Constraint 1 dropped
       Constraint 2 dropped
       Constraint 3 dropped
       Constraint 4 dropped
       Constraint 5 dropped
       Constraint 6 dropped
       Constraint 8 dropped
       Constraint 9 dropped
       Constraint 10 dropped
       Constraint 11 dropped
       Constraint 12 dropped
       Constraint 13 dropped
       Constraint 14 dropped
       Constraint 15 dropped
       Constraint 16 dropped
       Constraint 17 dropped
       Constraint 18 dropped
       Constraint 19 dropped
       Constraint 20 dropped
       Constraint 21 dropped
       Constraint 22 dropped
       Constraint 23 dropped
       Constraint 24 dropped
       Constraint 25 dropped
       Constraint 26 dropped
       Constraint 27 dropped
       Constraint 28 dropped
       Constraint 29 dropped
       Constraint 30 dropped
       Constraint 31 dropped
       Constraint 32 dropped
       Constraint 33 dropped
       Constraint 34 dropped
       Constraint 35 dropped
       Constraint 36 dropped
       Constraint 37 dropped
       Constraint 38 dropped
       Constraint 39 dropped
       Constraint 40 dropped
       Constraint 41 dropped
       Constraint 42 dropped
       Constraint 43 dropped
       Constraint 44 dropped
       Constraint 45 dropped
       Constraint 46 dropped
       Constraint 47 dropped
       Constraint 48 dropped
       Constraint 49 dropped
       Constraint 50 dropped
       Constraint 51 dropped
       Constraint 52 dropped
       Constraint 53 dropped
       Constraint 54 dropped
       Constraint 55 dropped
       Constraint 56 dropped
       Constraint 57 dropped
       Constraint 58 dropped
       Constraint 59 dropped
       Constraint 60 dropped
       Constraint 61 dropped
       Constraint 62 dropped
       Constraint 63 dropped
       Constraint 64 dropped
       Constraint 65 dropped
       Constraint 66 dropped
       Constraint 67 dropped
       Constraint 68 dropped
       Constraint 69 dropped
       Constraint 70 dropped
       Constraint 71 dropped
       Constraint 72 dropped
       Constraint 73 dropped
       Constraint 74 dropped
       Constraint 75 dropped
       Constraint 76 dropped
       Constraint 77 dropped
       Constraint 78 dropped
       Constraint 79 dropped
       Constraint 80 dropped
       Constraint 81 dropped
       Constraint 82 dropped
       Constraint 83 dropped
       Constraint 84 dropped
       Constraint 85 dropped
       Constraint 86 dropped
       Constraint 87 dropped
       Constraint 88 dropped
       Constraint 89 dropped
       Constraint 90 dropped
       Constraint 91 dropped
       Constraint 92 dropped
       Constraint 93 dropped
       Constraint 94 dropped
       Constraint 95 dropped
       Constraint 96 dropped
       Constraint 97 dropped
       Constraint 98 dropped
       Constraint 99 dropped
       Constraint 100 dropped
       Constraint 101 dropped
       Constraint 102 dropped
       Constraint 103 dropped
       Constraint 104 dropped
       Constraint 105 dropped
       Constraint 106 dropped
       Constraint 107 dropped
       Constraint 108 dropped
       Constraint 109 dropped
       Constraint 111 dropped
       Constraint 112 dropped
       Constraint 113 dropped
       Constraint 114 dropped
       Constraint 115 dropped
       Constraint 116 dropped
       Constraint 117 dropped
       Constraint 118 dropped
       Constraint 119 dropped
       Constraint 120 dropped
       Constraint 121 dropped
       Constraint 122 dropped
       Constraint 123 dropped
       Constraint 124 dropped
       Constraint 125 dropped
       Constraint 126 dropped
       Constraint 127 dropped
       Constraint 128 dropped
       Constraint 129 dropped
       Constraint 130 dropped
       Constraint 131 dropped
       Constraint 132 dropped
       Constraint 133 dropped
       Constraint 134 dropped
       Constraint 135 dropped
       Constraint 136 dropped
       Constraint 137 dropped
       Constraint 138 dropped
       Constraint 139 dropped
       Constraint 140 dropped
       Constraint 141 dropped
       Constraint 142 dropped
       Constraint 143 dropped
       Constraint 144 dropped
       Constraint 145 dropped
       Constraint 146 dropped
       Constraint 147 dropped
       Constraint 148 dropped
       Constraint 149 dropped
       Constraint 150 dropped
       Constraint 151 dropped
       Constraint 152 dropped
       Constraint 153 dropped
       Constraint 154 dropped
       Constraint 155 dropped
       Constraint 156 dropped
       Constraint 157 dropped
       Constraint 158 dropped
       Constraint 159 dropped
       Constraint 160 dropped
       Constraint 161 dropped
       Constraint 162 dropped
       Constraint 163 dropped
       Constraint 164 dropped
       Constraint 165 dropped

       F(  2,   165) =  237.25
            Prob > F =    0.0000

. scalar f_p_value = r(F);

. estadd scalar f_p_value = r(F);

added scalar:
          e(f_p_value) =  237.24758

. eststo reg_base_cube: regress tract_dvoteshare $indep_vars i.city2 
> if incl == 1, cluster(city2);
note: perc_tract_c_plus_d omitted because of collinearity.

Linear regression                               Number of obs     =      6,026
                                                F(5, 165)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2892
                                                Root MSE          =     .12737

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |   .5159228   .0773815     6.67   0.000     .3631372    .6687085
                  perc_tract_d_sq |  -1.228243   .2013706    -6.10   0.000    -1.625838   -.8306476
                  perc_tract_d_cu |   .8027136   .1382262     5.81   0.000     .5297936    1.075634
                     perc_tract_c |   .2050051   .0550567     3.72   0.000     .0962985    .3137116
              perc_tract_c_plus_d |          0  (omitted)
                  perc_tract_c_sq |  -.6036984   .1195279    -5.05   0.000    -.8396997    -.367697
                  perc_tract_c_cu |   .4283361   .0800539     5.35   0.000      .270274    .5863982
                                  |
                            city2 |
                          Albany  |   .1473148   .0041086    35.86   0.000     .1392026     .155427
                         Altoona  |  -.3094285   .0025453  -121.57   0.000     -.314454    -.304403
                        Amarillo  |  -.3017325   .0066651   -45.27   0.000    -.3148924   -.2885725
                       Arlington  |   .1723081   .0031475    54.74   0.000     .1660936    .1785226
                         Atlanta  |   .1661169   .0054522    30.47   0.000     .1553517     .176882
                   Atlantic City  |   .1219279   .0082014    14.87   0.000     .1057347    .1381212
                         Augusta  |   .2185302   .0201367    10.85   0.000     .1787713     .258289
                          Aurora  |   .1026465   .0081711    12.56   0.000     .0865131      .11878
                          Austin  |   .1499365   .0088218    17.00   0.000     .1325184    .1673547
                       Baltimore  |   .2158011   .0068465    31.52   0.000     .2022831    .2293192
                        Bay City  |  -.1183725   .0073047   -16.20   0.000    -.1327953   -.1039498
                        Beaumont  |   .2255251   .0034292    65.77   0.000     .2187543     .232296
                         Belmont  |   .1381803   .0023439    58.95   0.000     .1335524    .1428081
                      Bergen Co.  |  -.0172047   .0015733   -10.94   0.000    -.0203111   -.0140983
                      Birmingham  |   .1668912   .0076779    21.74   0.000     .1517317    .1820508
                          Boston  |   .1685976   .0042572    39.60   0.000     .1601919    .1770033
                        Brockton  |   .1616809   .0052618    30.73   0.000     .1512917    .1720702
                           Bronx  |   .1436563   .0033942    42.32   0.000     .1369546     .150358
                       Brookline  |   .2137805   .0046578    45.90   0.000     .2045839    .2229772
                        Brooklyn  |   .0380959   .0053001     7.19   0.000     .0276312    .0485606
                         Buffalo  |   .1521436   .0028857    52.72   0.000     .1464459    .1578413
                       Cambridge  |   .1981219   .0051272    38.64   0.000     .1879985    .2082454
                          Camden  |   .0306118   .0019689    15.55   0.000     .0267243    .0344993
                          Canton  |   .0065422   .0026345     2.48   0.014     .0013405     .011744
                       Charlotte  |   .0537318   .0050122    10.72   0.000     .0438354    .0636281
                     Chattanooga  |    .057344   .0017665    32.46   0.000     .0538561    .0608319
                         Chelsea  |   .0960423    .005079    18.91   0.000     .0860141    .1060705
                         Chicago  |   .1755668    .003676    47.76   0.000     .1683086    .1828249
                       Cleveland  |   .1336687   .0020754    64.41   0.000      .129571    .1377664
                        Columbia  |   .0319103   .0090522     3.53   0.001     .0140373    .0497834
                        Columbus  |   .1237553   .0020405    60.65   0.000     .1197265    .1277842
                  Council Bluffs  |  -.2136142   .0089887   -23.76   0.000    -.2313619   -.1958665
                          Dallas  |   .0515222   .0025231    20.42   0.000     .0465405    .0565038
                       Davenport  |  -.0685366   .0012892   -53.16   0.000    -.0710821   -.0659911
                          Dayton  |    .035594   .0027836    12.79   0.000     .0300981      .04109
                         Decatur  |    .003126    .004101     0.76   0.447    -.0049711    .0112232
                          Denver  |   .1678496   .0029011    57.86   0.000     .1621216    .1735777
                      Des Moines  |   .0064997    .004016     1.62   0.107    -.0014296     .014429
                         Detroit  |   .1414035   .0029717    47.58   0.000      .135536     .147271
                         Dubuque  |  -.0924454   .0072995   -12.66   0.000    -.1068579    -.078033
                          Duluth  |   .0924247   .0032543    28.40   0.000     .0859992    .0988502
                          Durham  |   .2223566   .0087785    25.33   0.000      .205024    .2396892
                  East St. Louis  |   .2592327   .0064951    39.91   0.000     .2464085    .2720569
                         El Paso  |   .0669536   .0051062    13.11   0.000     .0568716    .0770355
                          Elmira  |  -.1106255   .0035519   -31.15   0.000    -.1176386   -.1036124
                            Erie  |  -.0018808   .0021259    -0.88   0.378    -.0060784    .0023167
                       Essex Co.  |   .1731809   .0036548    47.39   0.000     .1659648     .180397
                      Evansville  |  -.0371366   .0018784   -19.77   0.000    -.0408455   -.0334277
                         Everett  |   .0123166   .0034148     3.61   0.000     .0055742    .0190591
                           Flint  |   .2977286   .0023999   124.06   0.000     .2929902     .302467
                      Fort Wayne  |   .0250574   .0057021     4.39   0.000      .013799    .0363158
                      Fort Worth  |    .043372   .0063528     6.83   0.000     .0308286    .0559153
                          Fresno  |   .0733279    .003171    23.12   0.000     .0670668    .0795889
                       Galveston  |   .0077746   .0058329     1.33   0.184    -.0037421    .0192913
                    Grand Rapids  |   .0493853   .0016704    29.56   0.000     .0460871    .0526835
             Greater Kansas City  |     .12663   .0065442    19.35   0.000     .1137089     .139551
                      Greensboro  |   .1673451   .0046548    35.95   0.000     .1581545    .1765357
                      Harrisburg  |   .1761901   .0082848    21.27   0.000     .1598321    .1925481
                        Hartford  |   .2038832   .0023897    85.32   0.000     .1991649    .2086015
                Holyoke Chicopee  |  -.0520179   .0021377   -24.33   0.000    -.0562387    -.047797
                         Houston  |   .1258977   .0059386    21.20   0.000     .1141722    .1376232
                      Hudson Co.  |    .043069   .0063377     6.80   0.000     .0305556    .0555824
                    Indianapolis  |    .050901   .0027534    18.49   0.000     .0454646    .0563374
                         Jackson  |  -.0260997   .0033641    -7.76   0.000     -.032742   -.0194574
                    Jacksonville  |   .0561285   .0093691     5.99   0.000     .0376297    .0746273
                       Johnstown  |  -.2676851   .0049443   -54.14   0.000    -.2774473   -.2579229
                          Joliet  |   .0091451   .0024118     3.79   0.000     .0043833     .013907
                         Kenosha  |  -.1586297    .005667   -27.99   0.000    -.1698189   -.1474406
                       Knoxville  |  -.0001255   .0053501    -0.02   0.981     -.010689     .010438
                   Lake Co. Gary  |   .2302854   .0063271    36.40   0.000     .2177929     .242778
                         Lansing  |    .063932   .0025331    25.24   0.000     .0589306    .0689335
                            Lima  |  -.1184195   .0031611   -37.46   0.000     -.124661    -.112178
                         Lincoln  |  -.0046584   .0023103    -2.02   0.045    -.0092201   -.0000968
                     Little Rock  |    .200654   .0027123    73.98   0.000     .1952986    .2060094
                     Los Angeles  |   .1141603   .0030223    37.77   0.000     .1081929    .1201277
           Lower Westchester Co.  |    .022342   .0042929     5.20   0.000      .013866     .030818
                           Macon  |    .097225   .0160402     6.06   0.000     .0655546    .1288954
                         Madison  |   .1697361   .0025632    66.22   0.000     .1646753    .1747969
                          Malden  |   .0156223    .008016     1.95   0.053    -.0002049    .0314494
                      Manchester  |  -.1070837    .002946   -36.35   0.000    -.1129004    -.101267
                       Manhattan  |   .1691035   .0114009    14.83   0.000     .1465931    .1916139
                         Medford  |   .0482359   .0042702    11.30   0.000     .0398047    .0566672
                         Melrose  |   .0631314   .0020426    30.91   0.000     .0590984    .0671645
                         Memphis  |    .160785   .0065698    24.47   0.000     .1478134    .1737566
                           Miami  |  -.0502073   .0026518   -18.93   0.000     -.055443   -.0449715
                   Milwaukee Co.  |   .1389094     .00425    32.68   0.000      .130518    .1473008
                     Minneapolis  |   .2043481   .0029745    68.70   0.000     .1984751    .2102212
                          Mobile  |  -.0286714   .0060109    -4.77   0.000    -.0405395   -.0168032
                      Montgomery  |   .0570625   .0075696     7.54   0.000     .0421167    .0720084
                        Muskegon  |   .2329616   .0096942    24.03   0.000     .2138208    .2521023
                       Nashville  |   .0325282   .0088795     3.66   0.000     .0149962    .0500603
                     New Britain  |   .0223396   .0008512    26.24   0.000     .0206589    .0240203
                      New Castle  |  -.1577166   .0057871   -27.25   0.000    -.1691429   -.1462903
                       New Haven  |   .0261434   .0026041    10.04   0.000     .0210018     .031285
                     New Orleans  |   .1658614   .0076292    21.74   0.000      .150798    .1809248
                          Newton  |   .1692858    .002413    70.16   0.000     .1645216    .1740501
                   Niagara Falls  |   .0431599   .0044617     9.67   0.000     .0343505    .0519694
                         Norfolk  |   .1417592   .0062999    22.50   0.000     .1293204    .1541979
                         Oakland  |   .2331162    .003973    58.68   0.000     .2252717    .2409607
                           Ogden  |  -.1248001   .0034852   -35.81   0.000    -.1316814   -.1179187
                   Oklahoma City  |   .0262378   .0021041    12.47   0.000     .0220834    .0303923
                           Omaha  |    .058527   .0049555    11.81   0.000     .0487426    .0683114
                         Oshkosh  |  -.1005523   .0109551    -9.18   0.000    -.1221826    -.078922
       Pawtucket & Central Falls  |    .035931   .0044163     8.14   0.000     .0272112    .0446507
                          Peoria  |    .127462    .005381    23.69   0.000     .1168375    .1380866
                    Philadelphia  |   .1724625   .0075371    22.88   0.000     .1575809    .1873441
                         Phoenix  |   .1226511    .005782    21.21   0.000     .1112348    .1340675
                      Pittsburgh  |   .1184652   .0038294    30.94   0.000     .1109042    .1260261
                         Pontiac  |   .1758099    .003339    52.65   0.000     .1692173    .1824025
                     Port Arthur  |   .1296165   .0071245    18.19   0.000     .1155495    .1436835
                        Portland  |   .2086801   .0028797    72.47   0.000     .2029942     .214366
                    Poughkeepsie  |   .0866599   .0039137    22.14   0.000     .0789326    .0943873
                      Providence  |   .1178645    .002382    49.48   0.000     .1131613    .1225677
                          Pueblo  |  -.0299849   .0052017    -5.76   0.000    -.0402553   -.0197145
                          Queens  |   .0822999   .0043489    18.92   0.000     .0737133    .0908865
                          Quincy  |   .0065779   .0042845     1.54   0.127    -.0018816    .0150374
                          Racine  |  -.0650615   .0022656   -28.72   0.000    -.0695348   -.0605883
                          Revere  |  -.0028878   .0052279    -0.55   0.581      -.01321    .0074344
                        Richmond  |   .0947932   .0020904    45.35   0.000     .0906658    .0989206
                       Rochester  |   .1663195    .002858    58.20   0.000     .1606766    .1719623
                        Rockford  |  -.0320662     .00532    -6.03   0.000    -.0425702   -.0215622
                      Sacramento  |   .1522967   .0034776    43.79   0.000     .1454304     .159163
                         Saginaw  |   .0751154   .0031718    23.68   0.000     .0688527     .081378
                  Salt Lake City  |   .1053369   .0050488    20.86   0.000     .0953684    .1153054
                     San Antonio  |   .0788138   .0054445    14.48   0.000     .0680639    .0895638
                       San Diego  |    .089654   .0055713    16.09   0.000     .0786538    .1006542
                   San Francisco  |   .1687974   .0054174    31.16   0.000     .1581011    .1794938
                        San Jose  |   .1041785   .0047549    21.91   0.000     .0947902    .1135669
                        Savannah  |   .2293429    .001629   140.79   0.000     .2261266    .2325593
                     Schenectady  |  -.1190833   .0049085   -24.26   0.000    -.1287748   -.1093917
                         Seattle  |   .2226855   .0030006    74.21   0.000      .216761      .22861
                      Shreveport  |    .087315    .003138    27.82   0.000     .0811191    .0935108
                      Sioux City  |  -.1680777    .005243   -32.06   0.000    -.1784296   -.1577257
                      Somerville  |    .220482    .004912    44.89   0.000     .2107834    .2301805
                      South Bend  |   .0542708   .0028553    19.01   0.000     .0486332    .0599084
                         Spokane  |  -.0865132   .0018117   -47.75   0.000    -.0900904    -.082936
                     Springfield  |  -.0122535   .0073501    -1.67   0.097    -.0267659    .0022589
                      St. Joseph  |  -.1660442    .017381    -9.55   0.000    -.2003621   -.1317263
                       St. Louis  |   .1986927   .0031522    63.03   0.000      .192469    .2049165
                        St. Paul  |   .1457834   .0034968    41.69   0.000      .138879    .1526877
                  St. Petersburg  |   .0970577   .0047209    20.56   0.000     .0877366    .1063788
Stamford, Darien, and New Canaan  |   .0611514   .0035504    17.22   0.000     .0541414    .0681613
                   Staten Island  |  -.1334017   .0046511   -28.68   0.000    -.1425851   -.1242183
                        Stockton  |   .0545448   .0039014    13.98   0.000     .0468417    .0622478
                        Syracuse  |   .0658838   .0018204    36.19   0.000     .0622896     .069478
                          Tacoma  |   -.001027   .0051703    -0.20   0.843    -.0112355    .0091816
                           Tampa  |   .0344343   .0106522     3.23   0.001      .013402    .0554666
                     Terre Haute  |  -.0899293    .004404   -20.42   0.000    -.0986249   -.0812338
                          Toledo  |   .0812353   .0022056    36.83   0.000     .0768805    .0855902
                          Topeka  |  -.0547063   .0064017    -8.55   0.000    -.0673461   -.0420665
                         Trenton  |   .1497406   .0025496    58.73   0.000     .1447064    .1547747
                           Tulsa  |   .0234794    .004425     5.31   0.000     .0147425    .0322162
                       Union Co.  |   .0649242   .0011017    58.93   0.000      .062749    .0670994
                           Utica  |  -.0579522   .0014684   -39.47   0.000    -.0608515   -.0550529
                            Waco  |   .0323149   .0026208    12.33   0.000     .0271403    .0374894
                          Warren  |   -.060064   .0034349   -17.49   0.000    -.0668461    -.053282
                       Waterbury  |   .0322287   .0030005    10.74   0.000     .0263045     .038153
                        Waterloo  |   .0023173   .0063447     0.37   0.715    -.0102101    .0148446
                       Watertown  |   .0899315   .0080636    11.15   0.000     .0740104    .1058526
                         Wichita  |  -.0507482   .0109339    -4.64   0.000    -.0723365   -.0291599
                    Wilkes-Barre  |  -.0602903   .0071245    -8.46   0.000    -.0743573   -.0462233
                   Winston-Salem  |   .1807201   .0067314    26.85   0.000     .1674294    .1940108
                      Woonsocket  |  -.1368815   .0073241   -18.69   0.000    -.1513427   -.1224204
                            York  |   .0378794   .0057076     6.64   0.000       .02661    .0491487
                      Youngstown  |   .0599951   .0033516    17.90   0.000     .0533774    .0666127
                                  |
                            _cons |   .6432479   .0071245    90.29   0.000      .629181    .6573149
---------------------------------------------------------------------------------------------------

. testparm i.city2;

 ( 1)  2.city2 = 0
 ( 2)  3.city2 = 0
 ( 3)  4.city2 = 0
 ( 4)  5.city2 = 0
 ( 5)  7.city2 = 0
 ( 6)  8.city2 = 0
 ( 7)  9.city2 = 0
 ( 8)  10.city2 = 0
 ( 9)  11.city2 = 0
 (10)  12.city2 = 0
 (11)  14.city2 = 0
 (12)  15.city2 = 0
 (13)  16.city2 = 0
 (14)  17.city2 = 0
 (15)  20.city2 = 0
 (16)  21.city2 = 0
 (17)  23.city2 = 0
 (18)  24.city2 = 0
 (19)  25.city2 = 0
 (20)  26.city2 = 0
 (21)  27.city2 = 0
 (22)  28.city2 = 0
 (23)  29.city2 = 0
 (24)  30.city2 = 0
 (25)  32.city2 = 0
 (26)  33.city2 = 0
 (27)  34.city2 = 0
 (28)  36.city2 = 0
 (29)  37.city2 = 0
 (30)  38.city2 = 0
 (31)  39.city2 = 0
 (32)  40.city2 = 0
 (33)  42.city2 = 0
 (34)  43.city2 = 0
 (35)  44.city2 = 0
 (36)  45.city2 = 0
 (37)  47.city2 = 0
 (38)  48.city2 = 0
 (39)  49.city2 = 0
 (40)  50.city2 = 0
 (41)  51.city2 = 0
 (42)  52.city2 = 0
 (43)  53.city2 = 0
 (44)  54.city2 = 0
 (45)  55.city2 = 0
 (46)  56.city2 = 0
 (47)  57.city2 = 0
 (48)  58.city2 = 0
 (49)  59.city2 = 0
 (50)  60.city2 = 0
 (51)  61.city2 = 0
 (52)  62.city2 = 0
 (53)  63.city2 = 0
 (54)  64.city2 = 0
 (55)  65.city2 = 0
 (56)  66.city2 = 0
 (57)  67.city2 = 0
 (58)  69.city2 = 0
 (59)  70.city2 = 0
 (60)  72.city2 = 0
 (61)  73.city2 = 0
 (62)  74.city2 = 0
 (63)  76.city2 = 0
 (64)  77.city2 = 0
 (65)  78.city2 = 0
 (66)  79.city2 = 0
 (67)  80.city2 = 0
 (68)  82.city2 = 0
 (69)  83.city2 = 0
 (70)  84.city2 = 0
 (71)  86.city2 = 0
 (72)  88.city2 = 0
 (73)  89.city2 = 0
 (74)  90.city2 = 0
 (75)  92.city2 = 0
 (76)  94.city2 = 0
 (77)  96.city2 = 0
 (78)  97.city2 = 0
 (79)  98.city2 = 0
 (80)  99.city2 = 0
 (81)  100.city2 = 0
 (82)  101.city2 = 0
 (83)  102.city2 = 0
 (84)  103.city2 = 0
 (85)  104.city2 = 0
 (86)  106.city2 = 0
 (87)  107.city2 = 0
 (88)  108.city2 = 0
 (89)  109.city2 = 0
 (90)  111.city2 = 0
 (91)  112.city2 = 0
 (92)  114.city2 = 0
 (93)  115.city2 = 0
 (94)  116.city2 = 0
 (95)  117.city2 = 0
 (96)  119.city2 = 0
 (97)  120.city2 = 0
 (98)  121.city2 = 0
 (99)  122.city2 = 0
 (100)  123.city2 = 0
 (101)  124.city2 = 0
 (102)  125.city2 = 0
 (103)  126.city2 = 0
 (104)  127.city2 = 0
 (105)  128.city2 = 0
 (106)  129.city2 = 0
 (107)  130.city2 = 0
 (108)  131.city2 = 0
 (109)  132.city2 = 0
 (110)  133.city2 = 0
 (111)  134.city2 = 0
 (112)  136.city2 = 0
 (113)  137.city2 = 0
 (114)  138.city2 = 0
 (115)  139.city2 = 0
 (116)  140.city2 = 0
 (117)  141.city2 = 0
 (118)  142.city2 = 0
 (119)  143.city2 = 0
 (120)  145.city2 = 0
 (121)  146.city2 = 0
 (122)  147.city2 = 0
 (123)  148.city2 = 0
 (124)  149.city2 = 0
 (125)  150.city2 = 0
 (126)  151.city2 = 0
 (127)  152.city2 = 0
 (128)  153.city2 = 0
 (129)  155.city2 = 0
 (130)  156.city2 = 0
 (131)  157.city2 = 0
 (132)  158.city2 = 0
 (133)  159.city2 = 0
 (134)  160.city2 = 0
 (135)  161.city2 = 0
 (136)  162.city2 = 0
 (137)  163.city2 = 0
 (138)  164.city2 = 0
 (139)  165.city2 = 0
 (140)  166.city2 = 0
 (141)  167.city2 = 0
 (142)  168.city2 = 0
 (143)  169.city2 = 0
 (144)  170.city2 = 0
 (145)  171.city2 = 0
 (146)  172.city2 = 0
 (147)  173.city2 = 0
 (148)  174.city2 = 0
 (149)  175.city2 = 0
 (150)  176.city2 = 0
 (151)  177.city2 = 0
 (152)  179.city2 = 0
 (153)  180.city2 = 0
 (154)  181.city2 = 0
 (155)  182.city2 = 0
 (156)  184.city2 = 0
 (157)  185.city2 = 0
 (158)  186.city2 = 0
 (159)  187.city2 = 0
 (160)  189.city2 = 0
 (161)  190.city2 = 0
 (162)  192.city2 = 0
 (163)  194.city2 = 0
 (164)  195.city2 = 0
 (165)  196.city2 = 0
       Constraint 1 dropped
       Constraint 2 dropped
       Constraint 3 dropped
       Constraint 4 dropped
       Constraint 5 dropped
       Constraint 6 dropped
       Constraint 8 dropped
       Constraint 9 dropped
       Constraint 10 dropped
       Constraint 11 dropped
       Constraint 12 dropped
       Constraint 13 dropped
       Constraint 14 dropped
       Constraint 15 dropped
       Constraint 16 dropped
       Constraint 17 dropped
       Constraint 18 dropped
       Constraint 19 dropped
       Constraint 20 dropped
       Constraint 21 dropped
       Constraint 22 dropped
       Constraint 23 dropped
       Constraint 24 dropped
       Constraint 25 dropped
       Constraint 26 dropped
       Constraint 27 dropped
       Constraint 28 dropped
       Constraint 29 dropped
       Constraint 30 dropped
       Constraint 31 dropped
       Constraint 32 dropped
       Constraint 33 dropped
       Constraint 34 dropped
       Constraint 35 dropped
       Constraint 36 dropped
       Constraint 37 dropped
       Constraint 38 dropped
       Constraint 39 dropped
       Constraint 40 dropped
       Constraint 41 dropped
       Constraint 43 dropped
       Constraint 44 dropped
       Constraint 45 dropped
       Constraint 46 dropped
       Constraint 47 dropped
       Constraint 48 dropped
       Constraint 49 dropped
       Constraint 50 dropped
       Constraint 51 dropped
       Constraint 52 dropped
       Constraint 53 dropped
       Constraint 54 dropped
       Constraint 55 dropped
       Constraint 56 dropped
       Constraint 57 dropped
       Constraint 58 dropped
       Constraint 59 dropped
       Constraint 60 dropped
       Constraint 61 dropped
       Constraint 62 dropped
       Constraint 63 dropped
       Constraint 64 dropped
       Constraint 65 dropped
       Constraint 66 dropped
       Constraint 67 dropped
       Constraint 68 dropped
       Constraint 69 dropped
       Constraint 70 dropped
       Constraint 71 dropped
       Constraint 72 dropped
       Constraint 73 dropped
       Constraint 74 dropped
       Constraint 75 dropped
       Constraint 76 dropped
       Constraint 77 dropped
       Constraint 78 dropped
       Constraint 79 dropped
       Constraint 80 dropped
       Constraint 81 dropped
       Constraint 82 dropped
       Constraint 83 dropped
       Constraint 84 dropped
       Constraint 85 dropped
       Constraint 86 dropped
       Constraint 87 dropped
       Constraint 88 dropped
       Constraint 89 dropped
       Constraint 90 dropped
       Constraint 91 dropped
       Constraint 92 dropped
       Constraint 93 dropped
       Constraint 94 dropped
       Constraint 95 dropped
       Constraint 96 dropped
       Constraint 97 dropped
       Constraint 98 dropped
       Constraint 99 dropped
       Constraint 100 dropped
       Constraint 101 dropped
       Constraint 102 dropped
       Constraint 103 dropped
       Constraint 104 dropped
       Constraint 105 dropped
       Constraint 106 dropped
       Constraint 107 dropped
       Constraint 108 dropped
       Constraint 109 dropped
       Constraint 111 dropped
       Constraint 112 dropped
       Constraint 113 dropped
       Constraint 114 dropped
       Constraint 115 dropped
       Constraint 116 dropped
       Constraint 117 dropped
       Constraint 118 dropped
       Constraint 119 dropped
       Constraint 120 dropped
       Constraint 121 dropped
       Constraint 122 dropped
       Constraint 123 dropped
       Constraint 124 dropped
       Constraint 125 dropped
       Constraint 126 dropped
       Constraint 127 dropped
       Constraint 128 dropped
       Constraint 129 dropped
       Constraint 130 dropped
       Constraint 131 dropped
       Constraint 132 dropped
       Constraint 133 dropped
       Constraint 134 dropped
       Constraint 135 dropped
       Constraint 136 dropped
       Constraint 137 dropped
       Constraint 138 dropped
       Constraint 139 dropped
       Constraint 140 dropped
       Constraint 141 dropped
       Constraint 142 dropped
       Constraint 143 dropped
       Constraint 144 dropped
       Constraint 145 dropped
       Constraint 146 dropped
       Constraint 147 dropped
       Constraint 148 dropped
       Constraint 149 dropped
       Constraint 150 dropped
       Constraint 151 dropped
       Constraint 152 dropped
       Constraint 153 dropped
       Constraint 154 dropped
       Constraint 155 dropped
       Constraint 157 dropped
       Constraint 158 dropped
       Constraint 160 dropped
       Constraint 161 dropped
       Constraint 162 dropped
       Constraint 164 dropped
       Constraint 165 dropped

       F(  6,   165) = 1538.62
            Prob > F =    0.0000

. scalar f_p_value = r(F);

. estadd scalar f_p_value = r(F);

added scalar:
          e(f_p_value) =  1538.6194

. eststo reg_all_cov_lin: regress tract_dvoteshare perc_tract_d perc_tract_c 
> $controls i.city2 
> if incl == 1, cluster(city2);

Linear regression                               Number of obs     =      6,026
                                                F(10, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7494
                                                Root MSE          =     .07565

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |   .0312474   .0181959     1.72   0.088    -.0046794    .0671743
                     perc_tract_c |   .0154344   .0095318     1.62   0.107    -.0033855    .0342544
                       _yr_median |  -.0000227   .0002617    -0.09   0.931    -.0005393     .000494
                       median_age |  -.0018218   .0005512    -3.31   0.001    -.0029102   -.0007334
                male_female_ratio |   .0124751    .012639     0.99   0.325      -.01248    .0374302
                    perc_hs_total |  -.1157813   .0369861    -3.13   0.002    -.1888082   -.0427543
               perc_somecol_total |   .0849478   .0828969     1.02   0.307    -.0787276    .2486233
                  perc_bach_total |   .4629688   .1149631     4.03   0.000     .2359805    .6899572
                   perc_pop_white |  -.5288009   .1489596    -3.55   0.001    -.8229136   -.2346882
                   perc_pop_black |   .0556247   .0673823     0.83   0.410    -.0774179    .1886674
                   perc_pop_asian |  -.3273401   .0625682    -5.23   0.000    -.4508776   -.2038026
                                  |
                            city2 |
                          Albany  |   -.020343   .0373055    -0.55   0.586    -.0940006    .0533147
                         Altoona  |  -.1453086   .0217827    -6.67   0.000    -.1883174   -.1022997
                        Amarillo  |  -.2855496   .0102042   -27.98   0.000    -.3056974   -.2654019
                       Arlington  |    .058635   .0483454     1.21   0.227    -.0368203    .1540902
                         Atlanta  |  -.1043787   .0553246    -1.89   0.061    -.2136142    .0048567
                   Atlantic City  |  -.0994465   .0553844    -1.80   0.074       -.2088     .009907
                         Augusta  |   .0684848   .0479349     1.43   0.155    -.0261601    .1631297
                          Aurora  |  -.0414289   .0550759    -0.75   0.453    -.1501733    .0673155
                          Austin  |   .0101748   .0444331     0.23   0.819     -.077556    .0979056
                       Baltimore  |  -.0471543   .0472728    -1.00   0.320    -.1404919    .0461833
                        Bay City  |   .0251964   .0117265     2.15   0.033     .0020431    .0483497
                        Beaumont  |   .0106104   .0335045     0.32   0.752    -.0555424    .0767633
                         Belmont  |   .0212082   .0509858     0.42   0.678    -.0794605    .1218768
                      Bergen Co.  |  -.1535393   .0630001    -2.44   0.016    -.2779296    -.029149
                      Birmingham  |  -.0577702   .0450511    -1.28   0.202    -.1467211    .0311807
                          Boston  |  -.0350249   .0598105    -0.59   0.559    -.1531174    .0830676
                        Brockton  |  -.0414211   .0498476    -0.83   0.407    -.1398424    .0570002
                           Bronx  |   -.109618   .0680877    -1.61   0.109    -.2440535    .0248176
                       Brookline  |    .007264   .0613911     0.12   0.906    -.1139494    .1284774
                        Brooklyn  |  -.1316725   .0522993    -2.52   0.013    -.2349346   -.0284104
                         Buffalo  |  -.0042315   .0291586    -0.15   0.885    -.0618035    .0533406
                       Cambridge  |   .0180137   .0609899     0.30   0.768    -.1024075     .138435
                          Camden  |  -.0302447   .0285718    -1.06   0.291    -.0866581    .0261688
                          Canton  |  -.0118284   .0029654    -3.99   0.000    -.0176834   -.0059734
                       Charlotte  |  -.1352429    .046968    -2.88   0.005    -.2279786   -.0425072
                     Chattanooga  |  -.0603103   .0163162    -3.70   0.000    -.0925258   -.0280948
                         Chelsea  |  -.1055696   .0749038    -1.41   0.161    -.2534631    .0423238
                         Chicago  |  -.0543599   .0588128    -0.92   0.357    -.1704825    .0617627
                       Cleveland  |  -.0361317   .0325183    -1.11   0.268    -.1003372    .0280739
                        Columbia  |  -.1062645   .0306405    -3.47   0.001    -.1667625   -.0457665
                        Columbus  |   .0221749   .0177464     1.25   0.213    -.0128645    .0572143
                  Council Bluffs  |  -.0242347   .0134809    -1.80   0.074     -.050852    .0023825
                          Dallas  |  -.1548083   .0507857    -3.05   0.003    -.2550819   -.0545347
                       Davenport  |  -.0007749   .0034684    -0.22   0.823     -.007623    .0060732
                          Dayton  |  -.0766709   .0178681    -4.29   0.000    -.1119505   -.0413913
                         Decatur  |  -.0683975   .0052775   -12.96   0.000    -.0788176   -.0579775
                          Denver  |    .025644    .045491     0.56   0.574    -.0641754    .1154635
                      Des Moines  |   .0143351   .0121243     1.18   0.239    -.0096036    .0382738
                         Detroit  |  -.0276574   .0315788    -0.88   0.382    -.0900081    .0346933
                         Dubuque  |   .0059974    .013621     0.44   0.660    -.0208966    .0328914
                          Duluth  |   .0945966   .0051719    18.29   0.000     .0843849    .1048083
                          Durham  |  -.0515011   .0534284    -0.96   0.336    -.1569926    .0539904
                  East St. Louis  |  -.0424716     .04087    -1.04   0.300    -.1231671    .0382239
                         El Paso  |  -.0544431   .0509291    -1.07   0.287    -.1549998    .0461135
                          Elmira  |  -.0503021   .0087483    -5.75   0.000    -.0675752    -.033029
                            Erie  |   .0402309   .0073986     5.44   0.000     .0256227    .0548392
                       Essex Co.  |   -.092638    .062387    -1.48   0.139    -.2158177    .0305417
                      Evansville  |  -.0257072   .0030668    -8.38   0.000    -.0317624   -.0196521
                         Everett  |  -.0877924   .0516642    -1.70   0.091    -.1898005    .0142158
                           Flint  |  -.0162101   .0424519    -0.38   0.703     -.100029    .0676089
                      Fort Wayne  |  -.0370831   .0155144    -2.39   0.018    -.0677155   -.0064507
                      Fort Worth  |  -.0977954   .0427822    -2.29   0.024    -.1822664   -.0133244
                          Fresno  |  -.0827968   .0499774    -1.66   0.099    -.1814746    .0158809
                       Galveston  |  -.0882932   .0306558    -2.88   0.005    -.1488214   -.0277651
                    Grand Rapids  |  -.0489254   .0275999    -1.77   0.078      -.10342    .0055691
             Greater Kansas City  |  -.0137163   .0377668    -0.36   0.717    -.0882848    .0608521
                      Greensboro  |  -.0708105   .0397611    -1.78   0.077    -.1493166    .0076955
                      Harrisburg  |   .0048216   .0319729     0.15   0.880     -.058307    .0679503
                        Hartford  |  -.0336356   .0488124    -0.69   0.492     -.130013    .0627418
                Holyoke Chicopee  |  -.0205168   .0126338    -1.62   0.106    -.0454616     .004428
                         Houston  |  -.1144888   .0548041    -2.09   0.038    -.2226964   -.0062812
                      Hudson Co.  |  -.1541256    .074544    -2.07   0.040    -.3013086   -.0069425
                    Indianapolis  |    -.05434   .0237297    -2.29   0.023    -.1011931   -.0074869
                         Jackson  |  -.0383317    .002487   -15.41   0.000     -.043242   -.0334213
                    Jacksonville  |  -.0456757   .0215776    -2.12   0.036    -.0882794   -.0030719
                       Johnstown  |    -.04947   .0228081    -2.17   0.032    -.0945033   -.0044367
                          Joliet  |  -.0671218   .0266003    -2.52   0.013    -.1196427    -.014601
                         Kenosha  |  -.0620762   .0088945    -6.98   0.000    -.0796379   -.0445145
                       Knoxville  |   .0462813   .0036287    12.75   0.000     .0391166     .053446
                   Lake Co. Gary  |  -.0181679   .0628932    -0.29   0.773     -.142347    .1060113
                         Lansing  |   .0371286   .0149201     2.49   0.014     .0076697    .0665875
                            Lima  |  -.1227914   .0183842    -6.68   0.000    -.1590901   -.0864927
                         Lincoln  |    -.01146   .0079711    -1.44   0.152    -.0271984    .0042784
                     Little Rock  |  -.0267595   .0347027    -0.77   0.442    -.0952782    .0417592
                     Los Angeles  |  -.0796067   .0690501    -1.15   0.251    -.2159424    .0567289
           Lower Westchester Co.  |  -.1484206   .0617054    -2.41   0.017    -.2702546   -.0265867
                           Macon  |  -.1665316   .0345865    -4.81   0.000    -.2348207   -.0982426
                         Madison  |   .1198281   .0226044     5.30   0.000     .0751968    .1644593
                          Malden  |  -.0680623   .0531281    -1.28   0.202    -.1729609    .0368362
                      Manchester  |  -.0432863   .0062586    -6.92   0.000    -.0556436   -.0309289
                       Manhattan  |  -.0353017   .0727167    -0.49   0.628    -.1788769    .1082735
                         Medford  |  -.0444776   .0446047    -1.00   0.320    -.1325472     .043592
                         Melrose  |  -.0035068   .0400869    -0.09   0.930    -.0826562    .0756425
                         Memphis  |  -.0788019   .0371421    -2.12   0.035    -.1521369   -.0054669
                           Miami  |  -.3146718   .0805262    -3.91   0.000    -.4736665   -.1556771
                   Milwaukee Co.  |  -.0258606   .0343042    -0.75   0.452    -.0935923    .0418711
                     Minneapolis  |   .0489226   .0348467     1.40   0.162    -.0198804    .1177256
                          Mobile  |  -.2087364   .0382984    -5.45   0.000    -.2843545   -.1331183
                      Montgomery  |  -.1202063    .024835    -4.84   0.000    -.1692416    -.071171
                        Muskegon  |  -.0144794   .0392987    -0.37   0.713    -.0920725    .0631138
                       Nashville  |  -.1059783   .0364036    -2.91   0.004    -.1778551   -.0341014
                     New Britain  |  -.0487896   .0246872    -1.98   0.050    -.0975331   -.0000462
                      New Castle  |  -.0205098   .0280965    -0.73   0.466    -.0759849    .0349653
                       New Haven  |  -.0530737   .0258638    -2.05   0.042    -.1041403    -.002007
                     New Orleans  |  -.0459862   .0463993    -0.99   0.323    -.1375991    .0456268
                          Newton  |   .0079399   .0637068     0.12   0.901    -.1178457    .1337254
                   Niagara Falls  |   -.005621   .0059236    -0.95   0.344    -.0173168    .0060749
                         Norfolk  |  -.0639338   .0420441    -1.52   0.130    -.1469476    .0190801
                         Oakland  |   .0156611   .0742505     0.21   0.833    -.1309425    .1622647
                           Ogden  |  -.1143957   .0165011    -6.93   0.000    -.1469761   -.0818152
                   Oklahoma City  |  -.0902084   .0343222    -2.63   0.009    -.1579757   -.0224411
                           Omaha  |  -.0292699   .0176886    -1.65   0.100     -.064195    .0056553
                         Oshkosh  |   .0009684    .008903     0.11   0.914    -.0166101    .0185468
       Pawtucket & Central Falls  |  -.0173143   .0226764    -0.76   0.446    -.0620875     .027459
                          Peoria  |  -.0103817   .0228639    -0.45   0.650    -.0555252    .0347617
                    Philadelphia  |  -.0178186     .04383    -0.41   0.685    -.1043586    .0687215
                         Phoenix  |  -.0171769   .0376631    -0.46   0.649    -.0915408    .0571869
                      Pittsburgh  |   .0138739   .0247218     0.56   0.575     -.034938    .0626858
                         Pontiac  |  -.0057773   .0284733    -0.20   0.839    -.0619962    .0504416
                     Port Arthur  |  -.0920066   .0385184    -2.39   0.018    -.1680591    -.015954
                        Portland  |   .1105181   .0405522     2.73   0.007       .03045    .1905861
                    Poughkeepsie  |   -.067204   .0432821    -1.55   0.122    -.1526622    .0182542
                      Providence  |  -.0412438   .0482418    -0.85   0.394    -.1364947    .0540071
                          Pueblo  |  -.0422554   .0198909    -2.12   0.035     -.081529   -.0029819
                          Queens  |  -.1025141   .0726803    -1.41   0.160    -.2460174    .0409892
                          Quincy  |  -.0198645   .0392062    -0.51   0.613    -.0972751     .057546
                          Racine  |   -.028334   .0052172    -5.43   0.000    -.0386352   -.0180329
                          Revere  |  -.0332498   .0382272    -0.87   0.386    -.1087273    .0422277
                        Richmond  |  -.0794151   .0398628    -1.99   0.048    -.1581221    -.000708
                       Rochester  |  -.0278627   .0344606    -0.81   0.420    -.0959034     .040178
                        Rockford  |   -.053168   .0146278    -3.63   0.000    -.0820497   -.0242862
                      Sacramento  |   -.008384   .0508144    -0.16   0.869    -.1087144    .0919463
                         Saginaw  |  -.0267818    .018644    -1.44   0.153    -.0635934    .0100298
                  Salt Lake City  |   .0331652   .0280509     1.18   0.239    -.0222198    .0885502
                     San Antonio  |  -.0041781   .0412839    -0.10   0.920    -.0856909    .0773347
                       San Diego  |  -.0715591   .0605517    -1.18   0.239    -.1911151    .0479969
                   San Francisco  |  -.0051982   .0845978    -0.06   0.951    -.1722319    .1618355
                        San Jose  |   -.037271    .066641    -0.56   0.577    -.1688501     .094308
                        Savannah  |   .0046801   .0275967     0.17   0.866    -.0498081    .0591683
                     Schenectady  |   -.086195   .0139691    -6.17   0.000    -.1137762   -.0586138
                         Seattle  |   .0643928   .0562031     1.15   0.254    -.0465771    .1753628
                      Shreveport  |  -.1893695   .0563246    -3.36   0.001    -.3005793   -.0781597
                      Sioux City  |  -.1419845   .0125243   -11.34   0.000    -.1667131   -.1172559
                      Somerville  |   .0628708    .050777     1.24   0.217    -.0373855    .1631272
                      South Bend  |  -.0031125   .0134861    -0.23   0.818      -.02974     .023515
                         Spokane  |  -.0432984   .0099437    -4.35   0.000    -.0629316   -.0236651
                     Springfield  |  -.0307981   .0081501    -3.78   0.000    -.0468901   -.0147062
                      St. Joseph  |   -.045941   .0120285    -3.82   0.000    -.0696905   -.0221915
                       St. Louis  |  -.0245665   .0381672    -0.64   0.521    -.0999256    .0507926
                        St. Paul  |   .0544317   .0307875     1.77   0.079    -.0063565    .1152199
                  St. Petersburg  |   -.056177   .0324384    -1.73   0.085    -.1202249     .007871
Stamford, Darien, and New Canaan  |  -.1639364   .0655278    -2.50   0.013    -.2933175   -.0345552
                   Staten Island  |  -.2059079     .04515    -4.56   0.000    -.2950541   -.1167617
                        Stockton  |  -.0783056   .0499473    -1.57   0.119    -.1769239    .0203127
                        Syracuse  |  -.0084458   .0119113    -0.71   0.479    -.0319641    .0150724
                          Tacoma  |  -.0043252   .0298284    -0.15   0.885    -.0632197    .0545693
                           Tampa  |  -.1277549    .045342    -2.82   0.005    -.2172801   -.0382296
                     Terre Haute  |  -.0749385   .0049334   -15.19   0.000    -.0846792   -.0651979
                          Toledo  |  -.0123203   .0158014    -0.78   0.437    -.0435193    .0188788
                          Topeka  |  -.0273862   .0104704    -2.62   0.010    -.0480594    -.006713
                         Trenton  |  -.0807292   .0553046    -1.46   0.146    -.1899251    .0284667
                           Tulsa  |  -.0873958   .0349212    -2.50   0.013    -.1563458   -.0184458
                       Union Co.  |  -.1358504   .0648404    -2.10   0.038    -.2638743   -.0078265
                           Utica  |  -.0570716   .0110614    -5.16   0.000    -.0789117   -.0352314
                            Waco  |  -.1195029   .0306038    -3.90   0.000    -.1799285   -.0590773
                          Warren  |   .0495583   .0250083     1.98   0.049     .0001808    .0989358
                       Waterbury  |  -.1222111   .0396536    -3.08   0.002     -.200505   -.0439172
                        Waterloo  |  -.0001528   .0072313    -0.02   0.983    -.0144305     .014125
                       Watertown  |  -.0330388   .0475127    -0.70   0.488      -.12685    .0607724
                         Wichita  |  -.1055524    .028595    -3.69   0.000    -.1620118   -.0490931
                    Wilkes-Barre  |  -.0660716    .004883   -13.53   0.000    -.0757127   -.0564305
                   Winston-Salem  |  -.0360372   .0332316    -1.08   0.280    -.1016511    .0295768
                      Woonsocket  |   -.088012   .0048253   -18.24   0.000    -.0975393   -.0784847
                            York  |  -.0548906   .0337582    -1.63   0.106    -.1215444    .0117632
                      Youngstown  |  -.0130591   .0167851    -0.78   0.438    -.0462003    .0200822
                                  |
                            _cons |     .97262   .0462161    21.05   0.000      .881369    1.063871
---------------------------------------------------------------------------------------------------

. testparm i.city2;

 ( 1)  2.city2 = 0
 ( 2)  3.city2 = 0
 ( 3)  4.city2 = 0
 ( 4)  5.city2 = 0
 ( 5)  7.city2 = 0
 ( 6)  8.city2 = 0
 ( 7)  9.city2 = 0
 ( 8)  10.city2 = 0
 ( 9)  11.city2 = 0
 (10)  12.city2 = 0
 (11)  14.city2 = 0
 (12)  15.city2 = 0
 (13)  16.city2 = 0
 (14)  17.city2 = 0
 (15)  20.city2 = 0
 (16)  21.city2 = 0
 (17)  23.city2 = 0
 (18)  24.city2 = 0
 (19)  25.city2 = 0
 (20)  26.city2 = 0
 (21)  27.city2 = 0
 (22)  28.city2 = 0
 (23)  29.city2 = 0
 (24)  30.city2 = 0
 (25)  32.city2 = 0
 (26)  33.city2 = 0
 (27)  34.city2 = 0
 (28)  36.city2 = 0
 (29)  37.city2 = 0
 (30)  38.city2 = 0
 (31)  39.city2 = 0
 (32)  40.city2 = 0
 (33)  42.city2 = 0
 (34)  43.city2 = 0
 (35)  44.city2 = 0
 (36)  45.city2 = 0
 (37)  47.city2 = 0
 (38)  48.city2 = 0
 (39)  49.city2 = 0
 (40)  50.city2 = 0
 (41)  51.city2 = 0
 (42)  52.city2 = 0
 (43)  53.city2 = 0
 (44)  54.city2 = 0
 (45)  55.city2 = 0
 (46)  56.city2 = 0
 (47)  57.city2 = 0
 (48)  58.city2 = 0
 (49)  59.city2 = 0
 (50)  60.city2 = 0
 (51)  61.city2 = 0
 (52)  62.city2 = 0
 (53)  63.city2 = 0
 (54)  64.city2 = 0
 (55)  65.city2 = 0
 (56)  66.city2 = 0
 (57)  67.city2 = 0
 (58)  69.city2 = 0
 (59)  70.city2 = 0
 (60)  72.city2 = 0
 (61)  73.city2 = 0
 (62)  74.city2 = 0
 (63)  76.city2 = 0
 (64)  77.city2 = 0
 (65)  78.city2 = 0
 (66)  79.city2 = 0
 (67)  80.city2 = 0
 (68)  82.city2 = 0
 (69)  83.city2 = 0
 (70)  84.city2 = 0
 (71)  86.city2 = 0
 (72)  88.city2 = 0
 (73)  89.city2 = 0
 (74)  90.city2 = 0
 (75)  92.city2 = 0
 (76)  94.city2 = 0
 (77)  96.city2 = 0
 (78)  97.city2 = 0
 (79)  98.city2 = 0
 (80)  99.city2 = 0
 (81)  100.city2 = 0
 (82)  101.city2 = 0
 (83)  102.city2 = 0
 (84)  103.city2 = 0
 (85)  104.city2 = 0
 (86)  106.city2 = 0
 (87)  107.city2 = 0
 (88)  108.city2 = 0
 (89)  109.city2 = 0
 (90)  111.city2 = 0
 (91)  112.city2 = 0
 (92)  114.city2 = 0
 (93)  115.city2 = 0
 (94)  116.city2 = 0
 (95)  117.city2 = 0
 (96)  119.city2 = 0
 (97)  120.city2 = 0
 (98)  121.city2 = 0
 (99)  122.city2 = 0
 (100)  123.city2 = 0
 (101)  124.city2 = 0
 (102)  125.city2 = 0
 (103)  126.city2 = 0
 (104)  127.city2 = 0
 (105)  128.city2 = 0
 (106)  129.city2 = 0
 (107)  130.city2 = 0
 (108)  131.city2 = 0
 (109)  132.city2 = 0
 (110)  133.city2 = 0
 (111)  134.city2 = 0
 (112)  136.city2 = 0
 (113)  137.city2 = 0
 (114)  138.city2 = 0
 (115)  139.city2 = 0
 (116)  140.city2 = 0
 (117)  141.city2 = 0
 (118)  142.city2 = 0
 (119)  143.city2 = 0
 (120)  145.city2 = 0
 (121)  146.city2 = 0
 (122)  147.city2 = 0
 (123)  148.city2 = 0
 (124)  149.city2 = 0
 (125)  150.city2 = 0
 (126)  151.city2 = 0
 (127)  152.city2 = 0
 (128)  153.city2 = 0
 (129)  155.city2 = 0
 (130)  156.city2 = 0
 (131)  157.city2 = 0
 (132)  158.city2 = 0
 (133)  159.city2 = 0
 (134)  160.city2 = 0
 (135)  161.city2 = 0
 (136)  162.city2 = 0
 (137)  163.city2 = 0
 (138)  164.city2 = 0
 (139)  165.city2 = 0
 (140)  166.city2 = 0
 (141)  167.city2 = 0
 (142)  168.city2 = 0
 (143)  169.city2 = 0
 (144)  170.city2 = 0
 (145)  171.city2 = 0
 (146)  172.city2 = 0
 (147)  173.city2 = 0
 (148)  174.city2 = 0
 (149)  175.city2 = 0
 (150)  176.city2 = 0
 (151)  177.city2 = 0
 (152)  179.city2 = 0
 (153)  180.city2 = 0
 (154)  181.city2 = 0
 (155)  182.city2 = 0
 (156)  184.city2 = 0
 (157)  185.city2 = 0
 (158)  186.city2 = 0
 (159)  187.city2 = 0
 (160)  189.city2 = 0
 (161)  190.city2 = 0
 (162)  192.city2 = 0
 (163)  194.city2 = 0
 (164)  195.city2 = 0
 (165)  196.city2 = 0
       Constraint 1 dropped
       Constraint 2 dropped
       Constraint 3 dropped
       Constraint 4 dropped
       Constraint 5 dropped
       Constraint 6 dropped
       Constraint 8 dropped
       Constraint 9 dropped
       Constraint 10 dropped
       Constraint 11 dropped
       Constraint 12 dropped
       Constraint 13 dropped
       Constraint 14 dropped
       Constraint 15 dropped
       Constraint 16 dropped
       Constraint 17 dropped
       Constraint 18 dropped
       Constraint 19 dropped
       Constraint 20 dropped
       Constraint 21 dropped
       Constraint 22 dropped
       Constraint 23 dropped
       Constraint 24 dropped
       Constraint 25 dropped
       Constraint 26 dropped
       Constraint 28 dropped
       Constraint 29 dropped
       Constraint 30 dropped
       Constraint 31 dropped
       Constraint 32 dropped
       Constraint 33 dropped
       Constraint 34 dropped
       Constraint 35 dropped
       Constraint 36 dropped
       Constraint 37 dropped
       Constraint 38 dropped
       Constraint 39 dropped
       Constraint 40 dropped
       Constraint 41 dropped
       Constraint 42 dropped
       Constraint 45 dropped
       Constraint 46 dropped
       Constraint 47 dropped
       Constraint 48 dropped
       Constraint 49 dropped
       Constraint 50 dropped
       Constraint 51 dropped
       Constraint 52 dropped
       Constraint 53 dropped
       Constraint 54 dropped
       Constraint 55 dropped
       Constraint 56 dropped
       Constraint 59 dropped
       Constraint 60 dropped
       Constraint 61 dropped
       Constraint 62 dropped
       Constraint 63 dropped
       Constraint 64 dropped
       Constraint 65 dropped
       Constraint 66 dropped
       Constraint 67 dropped
       Constraint 68 dropped
       Constraint 69 dropped
       Constraint 70 dropped
       Constraint 71 dropped
       Constraint 72 dropped
       Constraint 73 dropped
       Constraint 74 dropped
       Constraint 75 dropped
       Constraint 78 dropped
       Constraint 79 dropped
       Constraint 80 dropped
       Constraint 81 dropped
       Constraint 82 dropped
       Constraint 83 dropped
       Constraint 84 dropped
       Constraint 85 dropped
       Constraint 86 dropped
       Constraint 87 dropped
       Constraint 88 dropped
       Constraint 89 dropped
       Constraint 90 dropped
       Constraint 91 dropped
       Constraint 92 dropped
       Constraint 93 dropped
       Constraint 94 dropped
       Constraint 95 dropped
       Constraint 96 dropped
       Constraint 97 dropped
       Constraint 98 dropped
       Constraint 99 dropped
       Constraint 100 dropped
       Constraint 101 dropped
       Constraint 102 dropped
       Constraint 104 dropped
       Constraint 105 dropped
       Constraint 106 dropped
       Constraint 107 dropped
       Constraint 108 dropped
       Constraint 109 dropped
       Constraint 110 dropped
       Constraint 111 dropped
       Constraint 112 dropped
       Constraint 113 dropped
       Constraint 114 dropped
       Constraint 115 dropped
       Constraint 116 dropped
       Constraint 117 dropped
       Constraint 118 dropped
       Constraint 120 dropped
       Constraint 121 dropped
       Constraint 122 dropped
       Constraint 123 dropped
       Constraint 124 dropped
       Constraint 125 dropped
       Constraint 126 dropped
       Constraint 128 dropped
       Constraint 129 dropped
       Constraint 130 dropped
       Constraint 131 dropped
       Constraint 132 dropped
       Constraint 133 dropped
       Constraint 134 dropped
       Constraint 135 dropped
       Constraint 136 dropped
       Constraint 137 dropped
       Constraint 138 dropped
       Constraint 139 dropped
       Constraint 140 dropped
       Constraint 141 dropped
       Constraint 142 dropped
       Constraint 143 dropped
       Constraint 144 dropped
       Constraint 145 dropped
       Constraint 146 dropped
       Constraint 147 dropped
       Constraint 148 dropped
       Constraint 149 dropped
       Constraint 150 dropped
       Constraint 151 dropped
       Constraint 152 dropped
       Constraint 153 dropped
       Constraint 154 dropped
       Constraint 155 dropped
       Constraint 156 dropped
       Constraint 157 dropped
       Constraint 158 dropped
       Constraint 159 dropped
       Constraint 160 dropped
       Constraint 161 dropped
       Constraint 162 dropped
       Constraint 163 dropped
       Constraint 164 dropped
       Constraint 165 dropped

       F( 11,   165) = 1389.29
            Prob > F =    0.0000

. scalar f_p_value = r(F);

. estadd scalar f_p_value = r(F);

added scalar:
          e(f_p_value) =  1389.2901

. eststo reg_all_cov: regress tract_dvoteshare $indep_vars 
> $controls i.city2 
> if incl == 1, cluster(city2);
note: perc_tract_c_plus_d omitted because of collinearity.

Linear regression                               Number of obs     =      6,026
                                                F(14, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7500
                                                Root MSE          =      .0756

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |    .114366   .0384276     2.98   0.003     .0384929    .1902392
                  perc_tract_d_sq |  -.2511542   .1073339    -2.34   0.020    -.4630792   -.0392292
                  perc_tract_d_cu |   .1721504   .0716972     2.40   0.017     .0305881    .3137126
                     perc_tract_c |   .1232328   .0370191     3.33   0.001     .0501406     .196325
              perc_tract_c_plus_d |          0  (omitted)
                  perc_tract_c_sq |  -.2906397   .0684118    -4.25   0.000    -.4257151   -.1555643
                  perc_tract_c_cu |   .1874544   .0438335     4.28   0.000     .1009075    .2740013
                       _yr_median |  -.0000156   .0002639    -0.06   0.953    -.0005367    .0005054
                       median_age |  -.0018103   .0005499    -3.29   0.001     -.002896   -.0007245
                male_female_ratio |    .012338   .0125741     0.98   0.328    -.0124889    .0371648
                    perc_hs_total |  -.1166325   .0370462    -3.15   0.002    -.1897781   -.0434869
               perc_somecol_total |   .0856474   .0823745     1.04   0.300    -.0769965    .2482913
                  perc_bach_total |   .4611262   .1147257     4.02   0.000     .2346065    .6876459
                   perc_pop_white |  -.5272898   .1493491    -3.53   0.001    -.8221715   -.2324081
                   perc_pop_black |   .0561635   .0675038     0.83   0.407    -.0771191    .1894461
                   perc_pop_asian |  -.3260139   .0626383    -5.20   0.000    -.4496898    -.202338
                                  |
                            city2 |
                          Albany  |  -.0184932   .0372868    -0.50   0.621     -.092114    .0551276
                         Altoona  |  -.1425691    .021192    -6.73   0.000    -.1844116   -.1007266
                        Amarillo  |  -.2834451   .0093402   -30.35   0.000    -.3018867   -.2650034
                       Arlington  |   .0536647   .0491938     1.09   0.277    -.0434658    .1507952
                         Atlanta  |  -.1025189   .0550275    -1.86   0.064    -.2111677    .0061299
                   Atlantic City  |  -.0974717   .0549179    -1.77   0.078     -.205904    .0109607
                         Augusta  |   .0700417   .0468893     1.49   0.137    -.0225386    .1626221
                          Aurora  |  -.0410095   .0550904    -0.74   0.458    -.1497824    .0677635
                          Austin  |    .013043    .043479     0.30   0.765    -.0728038    .0988899
                       Baltimore  |  -.0454202   .0462849    -0.98   0.328    -.1368072    .0459668
                        Bay City  |   .0294304   .0135525     2.17   0.031     .0026717    .0561892
                        Beaumont  |    .008427   .0336913     0.25   0.803    -.0580947    .0749487
                         Belmont  |   .0232661    .050747     0.46   0.647    -.0769311    .1234634
                      Bergen Co.  |  -.1517876   .0626318    -2.42   0.016    -.2754506   -.0281246
                      Birmingham  |  -.0575269   .0448023    -1.28   0.201    -.1459867    .0309328
                          Boston  |  -.0337943   .0590845    -0.57   0.568    -.1504534    .0828647
                        Brockton  |   -.039392   .0493524    -0.80   0.426    -.1368356    .0580516
                           Bronx  |  -.1074939   .0672111    -1.60   0.112    -.2401986    .0252109
                       Brookline  |   .0089991   .0609347     0.15   0.883    -.1113131    .1293114
                        Brooklyn  |  -.1296817   .0515114    -2.52   0.013    -.2313881   -.0279752
                         Buffalo  |   .0000737   .0286378     0.00   0.998      -.05647    .0566175
                       Cambridge  |   .0200396   .0603145     0.33   0.740     -.099048    .1391272
                          Camden  |  -.0275622   .0287476    -0.96   0.339    -.0843228    .0291985
                          Canton  |  -.0128275   .0027899    -4.60   0.000     -.018336    -.007319
                       Charlotte  |  -.1352435   .0467098    -2.90   0.004    -.2274695   -.0430176
                     Chattanooga  |   -.056695   .0160875    -3.52   0.001    -.0884589    -.024931
                         Chelsea  |  -.1044132   .0743283    -1.40   0.162    -.2511703     .042344
                         Chicago  |   -.052866   .0578945    -0.91   0.362    -.1671757    .0614436
                       Cleveland  |  -.0347066   .0321323    -1.08   0.282      -.09815    .0287368
                        Columbia  |  -.1133638   .0307553    -3.69   0.000    -.1740886   -.0526391
                        Columbus  |   .0220856   .0180655     1.22   0.223    -.0135838     .057755
                  Council Bluffs  |   -.026097   .0155553    -1.68   0.095    -.0568101    .0046162
                          Dallas  |  -.1515166   .0505549    -3.00   0.003    -.2513344   -.0516988
                       Davenport  |   -.000404   .0035975    -0.11   0.911    -.0075069     .006699
                          Dayton  |  -.0749762     .01779    -4.21   0.000    -.1101017   -.0398508
                         Decatur  |  -.0702897   .0068507   -10.26   0.000    -.0838161   -.0567633
                          Denver  |   .0273402    .045024     0.61   0.545    -.0615572    .1162375
                      Des Moines  |   .0150157   .0116063     1.29   0.198    -.0079002    .0379316
                         Detroit  |  -.0258147    .030687    -0.84   0.401    -.0864046    .0347751
                         Dubuque  |   .0025681   .0152805     0.17   0.867    -.0276024    .0327387
                          Duluth  |   .0913789   .0051641    17.70   0.000     .0811827     .101575
                          Durham  |  -.0519399   .0536998    -0.97   0.335    -.1579673    .0540875
                  East St. Louis  |  -.0447289   .0409727    -1.09   0.277    -.1256273    .0361695
                         El Paso  |  -.0560925    .050949    -1.10   0.273    -.1566885    .0445035
                          Elmira  |  -.0509869    .008454    -6.03   0.000    -.0676788   -.0342949
                            Erie  |   .0404484   .0075635     5.35   0.000     .0255146    .0553822
                       Essex Co.  |  -.0913316   .0621122    -1.47   0.143    -.2139687    .0313055
                      Evansville  |  -.0259117   .0032248    -8.04   0.000    -.0322789   -.0195446
                         Everett  |  -.0870585   .0512268    -1.70   0.091     -.188203    .0140861
                           Flint  |  -.0135074   .0429683    -0.31   0.754    -.0983459    .0713311
                      Fort Wayne  |   -.034628   .0180467    -1.92   0.057    -.0702601    .0010041
                      Fort Worth  |  -.0982939   .0424244    -2.32   0.022    -.1820586   -.0145292
                          Fresno  |  -.0797869   .0504097    -1.58   0.115     -.179318    .0197443
                       Galveston  |  -.0844594   .0295128    -2.86   0.005    -.1427309   -.0261879
                    Grand Rapids  |  -.0492527   .0276622    -1.78   0.077    -.1038702    .0053648
             Greater Kansas City  |  -.0127681    .037544    -0.34   0.734    -.0868967    .0613604
                      Greensboro  |  -.0762352   .0415515    -1.83   0.068    -.1582764    .0058059
                      Harrisburg  |   .0050555   .0302855     0.17   0.868    -.0547417    .0648527
                        Hartford  |  -.0303486   .0483586    -0.63   0.531    -.1258301    .0651329
                Holyoke Chicopee  |  -.0220508   .0127129    -1.73   0.085    -.0471517    .0030501
                         Houston  |  -.1096087   .0539823    -2.03   0.044    -.2161938   -.0030236
                      Hudson Co.  |  -.1524886    .073952    -2.06   0.041    -.2985028   -.0064744
                    Indianapolis  |  -.0540468   .0231212    -2.34   0.021    -.0996984   -.0083953
                         Jackson  |   -.037593   .0023504   -15.99   0.000    -.0422336   -.0329523
                    Jacksonville  |  -.0494718   .0216482    -2.29   0.024     -.092215   -.0067285
                       Johnstown  |  -.0493659    .022894    -2.16   0.033    -.0945688   -.0041629
                          Joliet  |  -.0674745   .0269337    -2.51   0.013    -.1206535   -.0142954
                         Kenosha  |  -.0622588   .0088219    -7.06   0.000    -.0796773   -.0448404
                       Knoxville  |   .0474129   .0037856    12.52   0.000     .0399383    .0548874
                   Lake Co. Gary  |  -.0112464   .0628307    -0.18   0.858    -.1353021    .1128093
                         Lansing  |    .037851   .0143588     2.64   0.009     .0095004    .0662015
                            Lima  |  -.1180399   .0190586    -6.19   0.000    -.1556701   -.0804097
                         Lincoln  |   -.011991   .0086019    -1.39   0.165     -.028975     .004993
                     Little Rock  |  -.0311465   .0347186    -0.90   0.371    -.0996965    .0374035
                     Los Angeles  |  -.0778715   .0683534    -1.14   0.256    -.2128317    .0570886
           Lower Westchester Co.  |  -.1462881   .0610484    -2.40   0.018    -.2668248   -.0257513
                           Macon  |  -.1632908   .0333162    -4.90   0.000    -.2290717   -.0975099
                         Madison  |   .1206164   .0217276     5.55   0.000     .0777164    .1635163
                          Malden  |  -.0674487   .0525813    -1.28   0.201    -.1712677    .0363703
                      Manchester  |  -.0448691    .005839    -7.68   0.000    -.0563979   -.0333403
                       Manhattan  |  -.0319423    .071696    -0.45   0.657    -.1735022    .1096175
                         Medford  |  -.0410887   .0443912    -0.93   0.356    -.1287368    .0465593
                         Melrose  |  -.0035235   .0408503    -0.09   0.931    -.0841802    .0771332
                         Memphis  |    -.07774   .0368156    -2.11   0.036    -.1504304   -.0050496
                           Miami  |  -.3123072    .080377    -3.89   0.000    -.4710072   -.1536072
                   Milwaukee Co.  |  -.0244017   .0336539    -0.73   0.469    -.0908495     .042046
                     Minneapolis  |   .0486293   .0343429     1.42   0.159     -.019179    .1164375
                          Mobile  |  -.2054094   .0387052    -5.31   0.000    -.2818308    -.128988
                      Montgomery  |  -.1189408   .0240926    -4.94   0.000    -.1665104   -.0713712
                        Muskegon  |  -.0149174    .038019    -0.39   0.695    -.0899837     .060149
                       Nashville  |   -.104649   .0356608    -2.93   0.004    -.1750593   -.0342387
                     New Britain  |  -.0480752   .0245789    -1.96   0.052    -.0966048    .0004545
                      New Castle  |  -.0160445   .0286973    -0.56   0.577    -.0727057    .0406168
                       New Haven  |  -.0530777   .0269087    -1.97   0.050    -.1062075    .0000522
                     New Orleans  |  -.0450199    .046087    -0.98   0.330    -.1360163    .0459765
                          Newton  |   .0112743    .063936     0.18   0.860    -.1149639    .1375125
                   Niagara Falls  |  -.0008625   .0050406    -0.17   0.864     -.010815    .0090899
                         Norfolk  |   -.061753   .0415796    -1.49   0.139    -.1438496    .0203437
                         Oakland  |   .0179046    .074138     0.24   0.809    -.1284768     .164286
                           Ogden  |  -.1124764   .0159657    -7.04   0.000    -.1439998   -.0809531
                   Oklahoma City  |  -.0878973   .0337783    -2.60   0.010    -.1545908   -.0212038
                           Omaha  |    -.02562   .0168907    -1.52   0.131    -.0589698    .0077299
                         Oshkosh  |   .0020426   .0108497     0.19   0.851    -.0193796    .0234647
       Pawtucket & Central Falls  |  -.0130826   .0219907    -0.59   0.553    -.0565021    .0303368
                          Peoria  |  -.0064576   .0228188    -0.28   0.778     -.051512    .0385968
                    Philadelphia  |  -.0153355   .0430309    -0.36   0.722    -.1002976    .0696266
                         Phoenix  |  -.0141396   .0370649    -0.38   0.703    -.0873223    .0590431
                      Pittsburgh  |    .015118   .0242535     0.62   0.534    -.0327693    .0630053
                         Pontiac  |   -.006411   .0286083    -0.22   0.823    -.0628966    .0500746
                     Port Arthur  |  -.0866747   .0371983    -2.33   0.021    -.1601207   -.0132288
                        Portland  |    .110104   .0401891     2.74   0.007     .0307529    .1894551
                    Poughkeepsie  |  -.0735105   .0434836    -1.69   0.093    -.1593664    .0123454
                      Providence  |  -.0397772     .04804    -0.83   0.409    -.1346296    .0550752
                          Pueblo  |  -.0410356   .0191313    -2.14   0.033    -.0788095   -.0032618
                          Queens  |  -.1009918   .0715757    -1.41   0.160    -.2423142    .0403306
                          Quincy  |  -.0183355   .0389109    -0.47   0.638    -.0951629     .058492
                          Racine  |  -.0321439   .0055534    -5.79   0.000    -.0431088   -.0211791
                          Revere  |  -.0327224   .0377122    -0.87   0.387     -.107183    .0417383
                        Richmond  |  -.0790478   .0395833    -2.00   0.047    -.1572028   -.0008928
                       Rochester  |  -.0257811   .0337929    -0.76   0.447    -.0925033    .0409411
                        Rockford  |  -.0528278   .0152626    -3.46   0.001    -.0829631   -.0226926
                      Sacramento  |  -.0029704   .0513841    -0.06   0.954    -.1044254    .0984847
                         Saginaw  |  -.0242564    .019009    -1.28   0.204    -.0617885    .0132758
                  Salt Lake City  |    .036318    .027468     1.32   0.188     -.017916     .090552
                     San Antonio  |  -.0032718   .0406807    -0.08   0.936    -.0835935      .07705
                       San Diego  |  -.0698182   .0599784    -1.16   0.246    -.1882424    .0486059
                   San Francisco  |  -.0031562   .0842129    -0.04   0.970      -.16943    .1631176
                        San Jose  |   -.041726   .0666436    -0.63   0.532    -.1733103    .0898582
                        Savannah  |   .0070292   .0281616     0.25   0.803    -.0485743    .0626326
                     Schenectady  |  -.0833454   .0133945    -6.22   0.000    -.1097922   -.0568986
                         Seattle  |    .065043   .0558176     1.17   0.246    -.0451658    .1752518
                      Shreveport  |    -.19168   .0568089    -3.37   0.001     -.303846    -.079514
                      Sioux City  |  -.1429341   .0127483   -11.21   0.000    -.1681049   -.1177633
                      Somerville  |   .0648445   .0503532     1.29   0.200    -.0345752    .1642642
                      South Bend  |   .0016896   .0132775     0.13   0.899     -.024526    .0279053
                         Spokane  |  -.0439456   .0099137    -4.43   0.000    -.0635196   -.0243716
                     Springfield  |  -.0335772   .0080459    -4.17   0.000    -.0494635   -.0176909
                      St. Joseph  |  -.0415299   .0132809    -3.13   0.002    -.0677523   -.0153074
                       St. Louis  |  -.0232082    .037606    -0.62   0.538    -.0974593    .0510429
                        St. Paul  |     .05458    .030135     1.81   0.072    -.0049199    .1140798
                  St. Petersburg  |   -.053215   .0327676    -1.62   0.106    -.1179128    .0114828
Stamford, Darien, and New Canaan  |  -.1621783   .0655502    -2.47   0.014    -.2916037    -.032753
                   Staten Island  |  -.2051465   .0448518    -4.57   0.000    -.2937039    -.116589
                        Stockton  |  -.0844576   .0513493    -1.64   0.102     -.185844    .0169288
                        Syracuse  |  -.0057338   .0115829    -0.50   0.621    -.0286037     .017136
                          Tacoma  |  -.0072309   .0298762    -0.24   0.809    -.0662199     .051758
                           Tampa  |  -.1266078    .044834    -2.82   0.005    -.2151302   -.0380855
                     Terre Haute  |  -.0754439   .0051528   -14.64   0.000    -.0856178     -.06527
                          Toledo  |  -.0102174   .0152072    -0.67   0.503    -.0402433    .0198084
                          Topeka  |  -.0355891   .0103852    -3.43   0.001    -.0560941   -.0150842
                         Trenton  |  -.0801996   .0551766    -1.45   0.148    -.1891427    .0287435
                           Tulsa  |  -.0852532   .0344447    -2.48   0.014    -.1532624    -.017244
                       Union Co.  |  -.1352336   .0647839    -2.09   0.038    -.2631458   -.0073214
                           Utica  |  -.0552574   .0110324    -5.01   0.000    -.0770404   -.0334745
                            Waco  |   -.120619   .0310175    -3.89   0.000    -.1818614   -.0593767
                          Warren  |   .0430768    .024652     1.75   0.082    -.0055972    .0917508
                       Waterbury  |  -.1229064   .0401269    -3.06   0.003    -.2021347   -.0436781
                        Waterloo  |   .0010972   .0068543     0.16   0.873    -.0124361    .0146306
                       Watertown  |   -.030888   .0463505    -0.67   0.506    -.1224046    .0606285
                         Wichita  |  -.1028402   .0279188    -3.68   0.000    -.1579643    -.047716
                    Wilkes-Barre  |  -.0610845   .0051096   -11.95   0.000    -.0711731   -.0509958
                   Winston-Salem  |  -.0384934   .0334438    -1.15   0.251    -.1045262    .0275395
                      Woonsocket  |  -.0885153   .0046635   -18.98   0.000    -.0977231   -.0793075
                            York  |    -.05618   .0342377    -1.64   0.103    -.1237804    .0114204
                      Youngstown  |  -.0134195   .0166526    -0.81   0.421    -.0462992    .0194602
                                  |
                            _cons |   .9664073   .0454542    21.26   0.000     .8766604    1.056154
---------------------------------------------------------------------------------------------------

. testparm i.city2;

 ( 1)  2.city2 = 0
 ( 2)  3.city2 = 0
 ( 3)  4.city2 = 0
 ( 4)  5.city2 = 0
 ( 5)  7.city2 = 0
 ( 6)  8.city2 = 0
 ( 7)  9.city2 = 0
 ( 8)  10.city2 = 0
 ( 9)  11.city2 = 0
 (10)  12.city2 = 0
 (11)  14.city2 = 0
 (12)  15.city2 = 0
 (13)  16.city2 = 0
 (14)  17.city2 = 0
 (15)  20.city2 = 0
 (16)  21.city2 = 0
 (17)  23.city2 = 0
 (18)  24.city2 = 0
 (19)  25.city2 = 0
 (20)  26.city2 = 0
 (21)  27.city2 = 0
 (22)  28.city2 = 0
 (23)  29.city2 = 0
 (24)  30.city2 = 0
 (25)  32.city2 = 0
 (26)  33.city2 = 0
 (27)  34.city2 = 0
 (28)  36.city2 = 0
 (29)  37.city2 = 0
 (30)  38.city2 = 0
 (31)  39.city2 = 0
 (32)  40.city2 = 0
 (33)  42.city2 = 0
 (34)  43.city2 = 0
 (35)  44.city2 = 0
 (36)  45.city2 = 0
 (37)  47.city2 = 0
 (38)  48.city2 = 0
 (39)  49.city2 = 0
 (40)  50.city2 = 0
 (41)  51.city2 = 0
 (42)  52.city2 = 0
 (43)  53.city2 = 0
 (44)  54.city2 = 0
 (45)  55.city2 = 0
 (46)  56.city2 = 0
 (47)  57.city2 = 0
 (48)  58.city2 = 0
 (49)  59.city2 = 0
 (50)  60.city2 = 0
 (51)  61.city2 = 0
 (52)  62.city2 = 0
 (53)  63.city2 = 0
 (54)  64.city2 = 0
 (55)  65.city2 = 0
 (56)  66.city2 = 0
 (57)  67.city2 = 0
 (58)  69.city2 = 0
 (59)  70.city2 = 0
 (60)  72.city2 = 0
 (61)  73.city2 = 0
 (62)  74.city2 = 0
 (63)  76.city2 = 0
 (64)  77.city2 = 0
 (65)  78.city2 = 0
 (66)  79.city2 = 0
 (67)  80.city2 = 0
 (68)  82.city2 = 0
 (69)  83.city2 = 0
 (70)  84.city2 = 0
 (71)  86.city2 = 0
 (72)  88.city2 = 0
 (73)  89.city2 = 0
 (74)  90.city2 = 0
 (75)  92.city2 = 0
 (76)  94.city2 = 0
 (77)  96.city2 = 0
 (78)  97.city2 = 0
 (79)  98.city2 = 0
 (80)  99.city2 = 0
 (81)  100.city2 = 0
 (82)  101.city2 = 0
 (83)  102.city2 = 0
 (84)  103.city2 = 0
 (85)  104.city2 = 0
 (86)  106.city2 = 0
 (87)  107.city2 = 0
 (88)  108.city2 = 0
 (89)  109.city2 = 0
 (90)  111.city2 = 0
 (91)  112.city2 = 0
 (92)  114.city2 = 0
 (93)  115.city2 = 0
 (94)  116.city2 = 0
 (95)  117.city2 = 0
 (96)  119.city2 = 0
 (97)  120.city2 = 0
 (98)  121.city2 = 0
 (99)  122.city2 = 0
 (100)  123.city2 = 0
 (101)  124.city2 = 0
 (102)  125.city2 = 0
 (103)  126.city2 = 0
 (104)  127.city2 = 0
 (105)  128.city2 = 0
 (106)  129.city2 = 0
 (107)  130.city2 = 0
 (108)  131.city2 = 0
 (109)  132.city2 = 0
 (110)  133.city2 = 0
 (111)  134.city2 = 0
 (112)  136.city2 = 0
 (113)  137.city2 = 0
 (114)  138.city2 = 0
 (115)  139.city2 = 0
 (116)  140.city2 = 0
 (117)  141.city2 = 0
 (118)  142.city2 = 0
 (119)  143.city2 = 0
 (120)  145.city2 = 0
 (121)  146.city2 = 0
 (122)  147.city2 = 0
 (123)  148.city2 = 0
 (124)  149.city2 = 0
 (125)  150.city2 = 0
 (126)  151.city2 = 0
 (127)  152.city2 = 0
 (128)  153.city2 = 0
 (129)  155.city2 = 0
 (130)  156.city2 = 0
 (131)  157.city2 = 0
 (132)  158.city2 = 0
 (133)  159.city2 = 0
 (134)  160.city2 = 0
 (135)  161.city2 = 0
 (136)  162.city2 = 0
 (137)  163.city2 = 0
 (138)  164.city2 = 0
 (139)  165.city2 = 0
 (140)  166.city2 = 0
 (141)  167.city2 = 0
 (142)  168.city2 = 0
 (143)  169.city2 = 0
 (144)  170.city2 = 0
 (145)  171.city2 = 0
 (146)  172.city2 = 0
 (147)  173.city2 = 0
 (148)  174.city2 = 0
 (149)  175.city2 = 0
 (150)  176.city2 = 0
 (151)  177.city2 = 0
 (152)  179.city2 = 0
 (153)  180.city2 = 0
 (154)  181.city2 = 0
 (155)  182.city2 = 0
 (156)  184.city2 = 0
 (157)  185.city2 = 0
 (158)  186.city2 = 0
 (159)  187.city2 = 0
 (160)  189.city2 = 0
 (161)  190.city2 = 0
 (162)  192.city2 = 0
 (163)  194.city2 = 0
 (164)  195.city2 = 0
 (165)  196.city2 = 0
       Constraint 1 dropped
       Constraint 2 dropped
       Constraint 3 dropped
       Constraint 4 dropped
       Constraint 5 dropped
       Constraint 6 dropped
       Constraint 8 dropped
       Constraint 9 dropped
       Constraint 10 dropped
       Constraint 11 dropped
       Constraint 12 dropped
       Constraint 13 dropped
       Constraint 14 dropped
       Constraint 15 dropped
       Constraint 16 dropped
       Constraint 17 dropped
       Constraint 18 dropped
       Constraint 19 dropped
       Constraint 20 dropped
       Constraint 21 dropped
       Constraint 22 dropped
       Constraint 23 dropped
       Constraint 24 dropped
       Constraint 25 dropped
       Constraint 26 dropped
       Constraint 28 dropped
       Constraint 29 dropped
       Constraint 30 dropped
       Constraint 31 dropped
       Constraint 32 dropped
       Constraint 33 dropped
       Constraint 34 dropped
       Constraint 35 dropped
       Constraint 36 dropped
       Constraint 37 dropped
       Constraint 38 dropped
       Constraint 39 dropped
       Constraint 40 dropped
       Constraint 41 dropped
       Constraint 42 dropped
       Constraint 44 dropped
       Constraint 45 dropped
       Constraint 46 dropped
       Constraint 47 dropped
       Constraint 48 dropped
       Constraint 49 dropped
       Constraint 50 dropped
       Constraint 52 dropped
       Constraint 54 dropped
       Constraint 55 dropped
       Constraint 56 dropped
       Constraint 58 dropped
       Constraint 59 dropped
       Constraint 60 dropped
       Constraint 61 dropped
       Constraint 62 dropped
       Constraint 63 dropped
       Constraint 64 dropped
       Constraint 65 dropped
       Constraint 66 dropped
       Constraint 67 dropped
       Constraint 69 dropped
       Constraint 71 dropped
       Constraint 72 dropped
       Constraint 73 dropped
       Constraint 74 dropped
       Constraint 75 dropped
       Constraint 76 dropped
       Constraint 77 dropped
       Constraint 78 dropped
       Constraint 79 dropped
       Constraint 80 dropped
       Constraint 81 dropped
       Constraint 82 dropped
       Constraint 84 dropped
       Constraint 85 dropped
       Constraint 86 dropped
       Constraint 87 dropped
       Constraint 88 dropped
       Constraint 89 dropped
       Constraint 90 dropped
       Constraint 91 dropped
       Constraint 92 dropped
       Constraint 93 dropped
       Constraint 94 dropped
       Constraint 95 dropped
       Constraint 96 dropped
       Constraint 97 dropped
       Constraint 98 dropped
       Constraint 99 dropped
       Constraint 100 dropped
       Constraint 101 dropped
       Constraint 102 dropped
       Constraint 104 dropped
       Constraint 105 dropped
       Constraint 106 dropped
       Constraint 107 dropped
       Constraint 108 dropped
       Constraint 109 dropped
       Constraint 111 dropped
       Constraint 112 dropped
       Constraint 113 dropped
       Constraint 114 dropped
       Constraint 115 dropped
       Constraint 116 dropped
       Constraint 117 dropped
       Constraint 118 dropped
       Constraint 120 dropped
       Constraint 121 dropped
       Constraint 122 dropped
       Constraint 123 dropped
       Constraint 124 dropped
       Constraint 125 dropped
       Constraint 126 dropped
       Constraint 128 dropped
       Constraint 129 dropped
       Constraint 130 dropped
       Constraint 131 dropped
       Constraint 132 dropped
       Constraint 133 dropped
       Constraint 134 dropped
       Constraint 135 dropped
       Constraint 136 dropped
       Constraint 137 dropped
       Constraint 138 dropped
       Constraint 139 dropped
       Constraint 140 dropped
       Constraint 141 dropped
       Constraint 142 dropped
       Constraint 143 dropped
       Constraint 145 dropped
       Constraint 146 dropped
       Constraint 147 dropped
       Constraint 148 dropped
       Constraint 149 dropped
       Constraint 150 dropped
       Constraint 151 dropped
       Constraint 152 dropped
       Constraint 153 dropped
       Constraint 154 dropped
       Constraint 155 dropped
       Constraint 156 dropped
       Constraint 157 dropped
       Constraint 158 dropped
       Constraint 159 dropped
       Constraint 160 dropped
       Constraint 161 dropped
       Constraint 163 dropped
       Constraint 164 dropped
       Constraint 165 dropped

       F( 15,   165) =  200.04
            Prob > F =    0.0000

. scalar f_p_value = r(F);

. estadd scalar f_p_value = r(F);

added scalar:
          e(f_p_value) =  200.04151

. eststo reg_all_cov_no_c: regress tract_dvoteshare perc_tract_d perc_tract_d_sq 
> perc_tract_d_cu $controls i.city2 
> if incl == 1, cluster(city2);

Linear regression                               Number of obs     =      6,026
                                                F(11, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7487
                                                Root MSE          =     .07577

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |   .0786223    .044531     1.77   0.079    -.0093018    .1665464
                  perc_tract_d_sq |   -.131984   .0966436    -1.37   0.174    -.3228014    .0588335
                  perc_tract_d_cu |   .0746606   .0645031     1.16   0.249    -.0526972    .2020184
                       _yr_median |  -.0000539   .0002488    -0.22   0.829    -.0005451    .0004373
                       median_age |  -.0019028   .0005241    -3.63   0.000    -.0029375    -.000868
                male_female_ratio |   .0132654   .0125723     1.06   0.293    -.0115579    .0380886
                    perc_hs_total |  -.1151978   .0369596    -3.12   0.002    -.1881725   -.0422231
               perc_somecol_total |   .0786855     .08021     0.98   0.328    -.0796848    .2370559
                  perc_bach_total |    .458895   .1136345     4.04   0.000     .2345299      .68326
                   perc_pop_white |  -.5276054    .149491    -3.53   0.001    -.8227672   -.2324436
                   perc_pop_black |   .0556772   .0681356     0.82   0.415    -.0788528    .1902072
                   perc_pop_asian |  -.3258871   .0618439    -5.27   0.000    -.4479946   -.2037796
                                  |
                            city2 |
                          Albany  |  -.0192424   .0375315    -0.51   0.609    -.0933464    .0548615
                         Altoona  |  -.1430107   .0228129    -6.27   0.000    -.1880535    -.097968
                        Amarillo  |  -.2901673   .0130282   -22.27   0.000    -.3158908   -.2644437
                       Arlington  |   .0591738   .0490194     1.21   0.229    -.0376123    .1559599
                         Atlanta  |  -.0990899   .0535621    -1.85   0.066    -.2048453    .0066654
                   Atlantic City  |   -.096175   .0545385    -1.76   0.080    -.2038584    .0115084
                         Augusta  |   .0723836   .0470449     1.54   0.126    -.0205039    .1652711
                          Aurora  |  -.0416544   .0559608    -0.74   0.458     -.152146    .0688371
                          Austin  |   .0093088    .045652     0.20   0.839    -.0808286    .0994463
                       Baltimore  |  -.0448609   .0467652    -0.96   0.339    -.1371962    .0474745
                        Bay City  |    .023345   .0114078     2.05   0.042      .000821     .045869
                        Beaumont  |   .0048631   .0366735     0.13   0.895    -.0675466    .0772729
                         Belmont  |   .0255052   .0498242     0.51   0.609      -.07287    .1238804
                      Bergen Co.  |  -.1484824   .0613219    -2.42   0.017    -.2695591   -.0274056
                      Birmingham  |  -.0555394   .0444845    -1.25   0.214    -.1433716    .0322927
                          Boston  |  -.0287572   .0576439    -0.50   0.619    -.1425718    .0850575
                        Brockton  |  -.0358084   .0479147    -0.75   0.456    -.1304135    .0587967
                           Bronx  |  -.1051463   .0668742    -1.57   0.118    -.2371858    .0268932
                       Brookline  |   .0147399   .0588267     0.25   0.802    -.1014101      .13089
                        Brooklyn  |  -.1288008   .0517122    -2.49   0.014    -.2309037   -.0266979
                         Buffalo  |  -.0044573   .0297516    -0.15   0.881    -.0632002    .0542856
                       Cambridge  |   .0242883   .0587862     0.41   0.680    -.0917818    .1403585
                          Camden  |  -.0285994   .0284535    -1.01   0.316    -.0847793    .0275804
                          Canton  |  -.0151979   .0026815    -5.67   0.000    -.0204925   -.0099034
                       Charlotte  |  -.1335134   .0465419    -2.87   0.005    -.2254078    -.041619
                     Chattanooga  |  -.0613913   .0168968    -3.63   0.000    -.0947531   -.0280295
                         Chelsea  |  -.1005067   .0736738    -1.36   0.174    -.2459715    .0449582
                         Chicago  |  -.0481508   .0566537    -0.85   0.397    -.1600104    .0637089
                       Cleveland  |  -.0350434   .0323916    -1.08   0.281    -.0989988    .0289121
                        Columbia  |  -.1082863   .0314984    -3.44   0.001    -.1704782   -.0460944
                        Columbus  |   .0224282   .0178603     1.26   0.211     -.012836    .0576925
                  Council Bluffs  |  -.0289365   .0119757    -2.42   0.017    -.0525819    -.005291
                          Dallas  |  -.1507618   .0496462    -3.04   0.003    -.2487857    -.052738
                       Davenport  |   .0021859   .0033504     0.65   0.515    -.0044294    .0088011
                          Dayton  |  -.0791592   .0191194    -4.14   0.000    -.1169094   -.0414089
                         Decatur  |  -.0702399   .0059018   -11.90   0.000    -.0818927   -.0585871
                          Denver  |   .0320396   .0431297     0.74   0.459    -.0531177    .1171969
                      Des Moines  |   .0141118    .012515     1.13   0.261    -.0105984     .038822
                         Detroit  |  -.0241707   .0304338    -0.79   0.428    -.0842606    .0359191
                         Dubuque  |  -.0016296   .0104338    -0.16   0.876    -.0222306    .0189713
                          Duluth  |   .0915613   .0055334    16.55   0.000      .080636    .1024867
                          Durham  |  -.0496793    .053522    -0.93   0.355    -.1553556     .055997
                  East St. Louis  |   -.043653    .041615    -1.05   0.296    -.1258196    .0385136
                         El Paso  |  -.0571776   .0528229    -1.08   0.281    -.1614735    .0471183
                          Elmira  |  -.0537822   .0075465    -7.13   0.000    -.0686824   -.0388821
                            Erie  |   .0371061   .0065306     5.68   0.000     .0242117    .0500005
                       Essex Co.  |  -.0902092   .0618503    -1.46   0.147    -.2123293    .0319109
                      Evansville  |  -.0242576    .002439    -9.95   0.000    -.0290733   -.0194419
                         Everett  |  -.0831484   .0496985    -1.67   0.096    -.1812754    .0149786
                           Flint  |  -.0137529   .0417527    -0.33   0.742    -.0961914    .0686855
                      Fort Wayne  |   -.035583   .0154607    -2.30   0.023    -.0661094   -.0050567
                      Fort Worth  |  -.1010587   .0448651    -2.25   0.026    -.1896424    -.012475
                          Fresno  |  -.0792131    .049019    -1.62   0.108    -.1759985    .0175724
                       Galveston  |  -.0915037    .032659    -2.80   0.006     -.155987   -.0270203
                    Grand Rapids  |  -.0453319   .0261973    -1.73   0.085    -.0970571    .0063933
             Greater Kansas City  |  -.0110561    .036982    -0.30   0.765    -.0840751    .0619629
                      Greensboro  |  -.0713013   .0401318    -1.78   0.077    -.1505393    .0079368
                      Harrisburg  |  -.0020566   .0351601    -0.06   0.953    -.0714782    .0673651
                        Hartford  |  -.0312417   .0484312    -0.65   0.520    -.1268665    .0643831
                Holyoke Chicopee  |  -.0204036   .0120221    -1.70   0.092    -.0441407    .0033334
                         Houston  |  -.1154647   .0560733    -2.06   0.041    -.2261783   -.0047511
                      Hudson Co.  |  -.1492842   .0730824    -2.04   0.043    -.2935813    -.004987
                    Indianapolis  |  -.0514307   .0227007    -2.27   0.025    -.0962519   -.0066095
                         Jackson  |  -.0392534   .0028428   -13.81   0.000    -.0448664   -.0336404
                    Jacksonville  |  -.0469438   .0222443    -2.11   0.036    -.0908639   -.0030237
                       Johnstown  |  -.0500513   .0235471    -2.13   0.035    -.0965438   -.0035589
                          Joliet  |  -.0696168   .0281945    -2.47   0.015    -.1252854   -.0139482
                         Kenosha  |  -.0621881   .0078631    -7.91   0.000    -.0777133    -.046663
                       Knoxville  |   .0491307   .0031609    15.54   0.000     .0428897    .0553716
                   Lake Co. Gary  |  -.0106546   .0600647    -0.18   0.859    -.1292491    .1079398
                         Lansing  |   .0406395   .0133089     3.05   0.003     .0143618    .0669172
                            Lima  |  -.1247422   .0174072    -7.17   0.000    -.1591117   -.0903727
                         Lincoln  |  -.0131003   .0089861    -1.46   0.147    -.0308429    .0046423
                     Little Rock  |  -.0262226   .0345989    -0.76   0.450    -.0945363    .0420911
                     Los Angeles  |  -.0749953   .0677578    -1.11   0.270    -.2087793    .0587888
           Lower Westchester Co.  |  -.1489076   .0625522    -2.38   0.018    -.2724134   -.0254017
                           Macon  |  -.1645315   .0342209    -4.81   0.000    -.2320988   -.0969641
                         Madison  |   .1227487   .0213686     5.74   0.000     .0805575    .1649398
                          Malden  |  -.0630001   .0514902    -1.22   0.223    -.1646646    .0386644
                      Manchester  |   -.043106   .0051566    -8.36   0.000    -.0532875   -.0329246
                       Manhattan  |  -.0320887   .0723154    -0.44   0.658    -.1748715    .1106942
                         Medford  |  -.0367867   .0415696    -0.88   0.377    -.1188635    .0452902
                         Melrose  |   .0002315   .0390643     0.01   0.995    -.0768989     .077362
                         Memphis  |  -.0776076   .0369997    -2.10   0.037    -.1506615   -.0045538
                           Miami  |  -.3120992   .0802548    -3.89   0.000     -.470558   -.1536405
                   Milwaukee Co.  |  -.0235346   .0336514    -0.70   0.485    -.0899774    .0429082
                     Minneapolis  |   .0479983   .0356658     1.35   0.180     -.022422    .1184185
                          Mobile  |   -.204526   .0367912    -5.56   0.000    -.2771682   -.1318839
                      Montgomery  |  -.1189587   .0246137    -4.83   0.000    -.1675571   -.0703602
                        Muskegon  |  -.0145847   .0399743    -0.36   0.716    -.0935118    .0643424
                       Nashville  |  -.1046231   .0364684    -2.87   0.005    -.1766279   -.0326182
                     New Britain  |  -.0494349   .0255091    -1.94   0.054    -.0998012    .0009315
                      New Castle  |  -.0151314   .0303277    -0.50   0.618    -.0750118    .0447489
                       New Haven  |  -.0514974   .0255555    -2.02   0.046    -.1019554   -.0010394
                     New Orleans  |  -.0428806    .045449    -0.94   0.347    -.1326173    .0468561
                          Newton  |   .0137862   .0619183     0.22   0.824    -.1084681    .1360405
                   Niagara Falls  |  -.0079441   .0066153    -1.20   0.232    -.0210056    .0051175
                         Norfolk  |  -.0600211    .040975    -1.46   0.145     -.140924    .0208819
                         Oakland  |   .0186335   .0737497     0.25   0.801    -.1269813    .1642483
                           Ogden  |   -.115159   .0174333    -6.61   0.000    -.1495801   -.0807378
                   Oklahoma City  |  -.0896677   .0348347    -2.57   0.011    -.1584469   -.0208885
                           Omaha  |  -.0336886   .0202857    -1.66   0.099    -.0737416    .0063643
                         Oshkosh  |   .0040626   .0104997     0.39   0.699    -.0166684    .0247936
       Pawtucket & Central Falls  |   -.020563   .0250104    -0.82   0.412    -.0699447    .0288186
                          Peoria  |  -.0063674   .0216097    -0.29   0.769    -.0490347    .0362998
                    Philadelphia  |  -.0177098   .0443585    -0.40   0.690    -.1052933    .0698737
                         Phoenix  |  -.0207789   .0403799    -0.51   0.608    -.1005069    .0589491
                      Pittsburgh  |   .0147303   .0247269     0.60   0.552    -.0340917    .0635522
                         Pontiac  |  -.0088697    .030027    -0.30   0.768    -.0681564    .0504169
                     Port Arthur  |  -.0990695   .0422395    -2.35   0.020    -.1824691   -.0156699
                        Portland  |   .1128127   .0398435     2.83   0.005     .0341439    .1914815
                    Poughkeepsie  |  -.0698122   .0448282    -1.56   0.121     -.158323    .0186986
                      Providence  |  -.0388722   .0478052    -0.81   0.417    -.1332609    .0555166
                          Pueblo  |   -.047743   .0225794    -2.11   0.036    -.0923249   -.0031611
                          Queens  |  -.0947558   .0699072    -1.36   0.177    -.2327836    .0432721
                          Quincy  |  -.0127095   .0366248    -0.35   0.729    -.0850232    .0596043
                          Racine  |  -.0281852   .0048425    -5.82   0.000    -.0377465   -.0186239
                          Revere  |  -.0273745   .0364677    -0.75   0.454     -.099378     .044629
                        Richmond  |  -.0763834    .039263    -1.95   0.053    -.1539059    .0011392
                       Rochester  |   -.024024   .0331601    -0.72   0.470    -.0894967    .0414488
                        Rockford  |  -.0531741   .0145323    -3.66   0.000    -.0818673    -.024481
                      Sacramento  |  -.0027183   .0484316    -0.06   0.955    -.0983438    .0929072
                         Saginaw  |  -.0223834   .0169501    -1.32   0.188    -.0558505    .0110837
                  Salt Lake City  |   .0332113   .0286721     1.16   0.248    -.0234001    .0898227
                     San Antonio  |   -.004486   .0420777    -0.11   0.915    -.0875661    .0785942
                       San Diego  |  -.0670513   .0592592    -1.13   0.259    -.1840554    .0499529
                   San Francisco  |    -.00036   .0834559    -0.00   0.997    -.1651391    .1644191
                        San Jose  |  -.0363262   .0663985    -0.55   0.585    -.1674265    .0947741
                        Savannah  |   .0052749   .0276038     0.19   0.849    -.0492273     .059777
                     Schenectady  |   -.079977   .0106923    -7.48   0.000    -.1010882   -.0588657
                         Seattle  |   .0667503   .0559363     1.19   0.234     -.043693    .1771936
                      Shreveport  |  -.1878384   .0558455    -3.36   0.001    -.2981023   -.0775746
                      Sioux City  |  -.1430727   .0134964   -10.60   0.000    -.1697206   -.1164248
                      Somerville  |   .0707607   .0478302     1.48   0.141    -.0236774    .1651989
                      South Bend  |  -.0017533   .0133323    -0.13   0.896    -.0280771    .0245705
                         Spokane  |  -.0415658   .0088588    -4.69   0.000     -.059057   -.0240746
                     Springfield  |  -.0319845   .0088515    -3.61   0.000    -.0494612   -.0145078
                      St. Joseph  |  -.0442874   .0123256    -3.59   0.000    -.0686235   -.0199512
                       St. Louis  |  -.0254116   .0389195    -0.65   0.515     -.102256    .0514327
                        St. Paul  |   .0543116   .0312785     1.74   0.084     -.007446    .1160692
                  St. Petersburg  |  -.0529696   .0314353    -1.69   0.094    -.1150368    .0090976
Stamford, Darien, and New Canaan  |  -.1632426   .0661437    -2.47   0.015    -.2938397   -.0326454
                   Staten Island  |   -.202285   .0439232    -4.61   0.000    -.2890091    -.115561
                        Stockton  |  -.0796548   .0514586    -1.55   0.124     -.181257    .0219474
                        Syracuse  |   -.009511   .0125939    -0.76   0.451     -.034377     .015355
                          Tacoma  |  -.0037876   .0292311    -0.13   0.897    -.0615028    .0539275
                           Tampa  |  -.1253656   .0449933    -2.79   0.006    -.2142023   -.0365288
                     Terre Haute  |   -.074775   .0054575   -13.70   0.000    -.0855505   -.0639995
                          Toledo  |  -.0125463   .0161397    -0.78   0.438    -.0444132    .0193206
                          Topeka  |  -.0328287     .01257    -2.61   0.010    -.0576474     -.00801
                         Trenton  |  -.0786761   .0549608    -1.43   0.154    -.1871931     .029841
                           Tulsa  |  -.0872603   .0355308    -2.46   0.015     -.157414   -.0171067
                       Union Co.  |   -.134039   .0646504    -2.07   0.040    -.2616876   -.0063903
                           Utica  |  -.0549801   .0105116    -5.23   0.000    -.0757347   -.0342254
                            Waco  |    -.12323   .0325613    -3.78   0.000    -.1875205   -.0589395
                          Warren  |   .0447058   .0228871     1.95   0.052    -.0004835    .0898951
                       Waterbury  |  -.1227729   .0400223    -3.07   0.003    -.2017947    -.043751
                        Waterloo  |  -.0019077    .008179    -0.23   0.816    -.0180567    .0142413
                       Watertown  |  -.0223407   .0430548    -0.52   0.605    -.1073501    .0626687
                         Wichita  |  -.1046963   .0289933    -3.61   0.000    -.1619419   -.0474506
                    Wilkes-Barre  |  -.0732661   .0086688    -8.45   0.000    -.0903821   -.0561501
                   Winston-Salem  |  -.0376729   .0340109    -1.11   0.270    -.1048256    .0294797
                      Woonsocket  |  -.0936919    .006835   -13.71   0.000    -.1071873   -.0801966
                            York  |  -.0569805   .0343034    -1.66   0.099    -.1247108    .0107498
                      Youngstown  |  -.0121583   .0165624    -0.73   0.464    -.0448599    .0205433
                                  |
                            _cons |   .9847629     .05289    18.62   0.000     .8803344    1.089191
---------------------------------------------------------------------------------------------------

. testparm i.city2;

 ( 1)  2.city2 = 0
 ( 2)  3.city2 = 0
 ( 3)  4.city2 = 0
 ( 4)  5.city2 = 0
 ( 5)  7.city2 = 0
 ( 6)  8.city2 = 0
 ( 7)  9.city2 = 0
 ( 8)  10.city2 = 0
 ( 9)  11.city2 = 0
 (10)  12.city2 = 0
 (11)  14.city2 = 0
 (12)  15.city2 = 0
 (13)  16.city2 = 0
 (14)  17.city2 = 0
 (15)  20.city2 = 0
 (16)  21.city2 = 0
 (17)  23.city2 = 0
 (18)  24.city2 = 0
 (19)  25.city2 = 0
 (20)  26.city2 = 0
 (21)  27.city2 = 0
 (22)  28.city2 = 0
 (23)  29.city2 = 0
 (24)  30.city2 = 0
 (25)  32.city2 = 0
 (26)  33.city2 = 0
 (27)  34.city2 = 0
 (28)  36.city2 = 0
 (29)  37.city2 = 0
 (30)  38.city2 = 0
 (31)  39.city2 = 0
 (32)  40.city2 = 0
 (33)  42.city2 = 0
 (34)  43.city2 = 0
 (35)  44.city2 = 0
 (36)  45.city2 = 0
 (37)  47.city2 = 0
 (38)  48.city2 = 0
 (39)  49.city2 = 0
 (40)  50.city2 = 0
 (41)  51.city2 = 0
 (42)  52.city2 = 0
 (43)  53.city2 = 0
 (44)  54.city2 = 0
 (45)  55.city2 = 0
 (46)  56.city2 = 0
 (47)  57.city2 = 0
 (48)  58.city2 = 0
 (49)  59.city2 = 0
 (50)  60.city2 = 0
 (51)  61.city2 = 0
 (52)  62.city2 = 0
 (53)  63.city2 = 0
 (54)  64.city2 = 0
 (55)  65.city2 = 0
 (56)  66.city2 = 0
 (57)  67.city2 = 0
 (58)  69.city2 = 0
 (59)  70.city2 = 0
 (60)  72.city2 = 0
 (61)  73.city2 = 0
 (62)  74.city2 = 0
 (63)  76.city2 = 0
 (64)  77.city2 = 0
 (65)  78.city2 = 0
 (66)  79.city2 = 0
 (67)  80.city2 = 0
 (68)  82.city2 = 0
 (69)  83.city2 = 0
 (70)  84.city2 = 0
 (71)  86.city2 = 0
 (72)  88.city2 = 0
 (73)  89.city2 = 0
 (74)  90.city2 = 0
 (75)  92.city2 = 0
 (76)  94.city2 = 0
 (77)  96.city2 = 0
 (78)  97.city2 = 0
 (79)  98.city2 = 0
 (80)  99.city2 = 0
 (81)  100.city2 = 0
 (82)  101.city2 = 0
 (83)  102.city2 = 0
 (84)  103.city2 = 0
 (85)  104.city2 = 0
 (86)  106.city2 = 0
 (87)  107.city2 = 0
 (88)  108.city2 = 0
 (89)  109.city2 = 0
 (90)  111.city2 = 0
 (91)  112.city2 = 0
 (92)  114.city2 = 0
 (93)  115.city2 = 0
 (94)  116.city2 = 0
 (95)  117.city2 = 0
 (96)  119.city2 = 0
 (97)  120.city2 = 0
 (98)  121.city2 = 0
 (99)  122.city2 = 0
 (100)  123.city2 = 0
 (101)  124.city2 = 0
 (102)  125.city2 = 0
 (103)  126.city2 = 0
 (104)  127.city2 = 0
 (105)  128.city2 = 0
 (106)  129.city2 = 0
 (107)  130.city2 = 0
 (108)  131.city2 = 0
 (109)  132.city2 = 0
 (110)  133.city2 = 0
 (111)  134.city2 = 0
 (112)  136.city2 = 0
 (113)  137.city2 = 0
 (114)  138.city2 = 0
 (115)  139.city2 = 0
 (116)  140.city2 = 0
 (117)  141.city2 = 0
 (118)  142.city2 = 0
 (119)  143.city2 = 0
 (120)  145.city2 = 0
 (121)  146.city2 = 0
 (122)  147.city2 = 0
 (123)  148.city2 = 0
 (124)  149.city2 = 0
 (125)  150.city2 = 0
 (126)  151.city2 = 0
 (127)  152.city2 = 0
 (128)  153.city2 = 0
 (129)  155.city2 = 0
 (130)  156.city2 = 0
 (131)  157.city2 = 0
 (132)  158.city2 = 0
 (133)  159.city2 = 0
 (134)  160.city2 = 0
 (135)  161.city2 = 0
 (136)  162.city2 = 0
 (137)  163.city2 = 0
 (138)  164.city2 = 0
 (139)  165.city2 = 0
 (140)  166.city2 = 0
 (141)  167.city2 = 0
 (142)  168.city2 = 0
 (143)  169.city2 = 0
 (144)  170.city2 = 0
 (145)  171.city2 = 0
 (146)  172.city2 = 0
 (147)  173.city2 = 0
 (148)  174.city2 = 0
 (149)  175.city2 = 0
 (150)  176.city2 = 0
 (151)  177.city2 = 0
 (152)  179.city2 = 0
 (153)  180.city2 = 0
 (154)  181.city2 = 0
 (155)  182.city2 = 0
 (156)  184.city2 = 0
 (157)  185.city2 = 0
 (158)  186.city2 = 0
 (159)  187.city2 = 0
 (160)  189.city2 = 0
 (161)  190.city2 = 0
 (162)  192.city2 = 0
 (163)  194.city2 = 0
 (164)  195.city2 = 0
 (165)  196.city2 = 0
       Constraint 1 dropped
       Constraint 2 dropped
       Constraint 3 dropped
       Constraint 4 dropped
       Constraint 5 dropped
       Constraint 6 dropped
       Constraint 9 dropped
       Constraint 10 dropped
       Constraint 11 dropped
       Constraint 12 dropped
       Constraint 13 dropped
       Constraint 14 dropped
       Constraint 15 dropped
       Constraint 16 dropped
       Constraint 17 dropped
       Constraint 18 dropped
       Constraint 19 dropped
       Constraint 20 dropped
       Constraint 21 dropped
       Constraint 22 dropped
       Constraint 23 dropped
       Constraint 24 dropped
       Constraint 25 dropped
       Constraint 26 dropped
       Constraint 28 dropped
       Constraint 29 dropped
       Constraint 30 dropped
       Constraint 31 dropped
       Constraint 32 dropped
       Constraint 33 dropped
       Constraint 34 dropped
       Constraint 35 dropped
       Constraint 36 dropped
       Constraint 37 dropped
       Constraint 38 dropped
       Constraint 39 dropped
       Constraint 40 dropped
       Constraint 41 dropped
       Constraint 42 dropped
       Constraint 44 dropped
       Constraint 45 dropped
       Constraint 46 dropped
       Constraint 47 dropped
       Constraint 48 dropped
       Constraint 49 dropped
       Constraint 50 dropped
       Constraint 51 dropped
       Constraint 52 dropped
       Constraint 53 dropped
       Constraint 54 dropped
       Constraint 55 dropped
       Constraint 56 dropped
       Constraint 58 dropped
       Constraint 59 dropped
       Constraint 60 dropped
       Constraint 61 dropped
       Constraint 62 dropped
       Constraint 63 dropped
       Constraint 64 dropped
       Constraint 65 dropped
       Constraint 66 dropped
       Constraint 67 dropped
       Constraint 69 dropped
       Constraint 70 dropped
       Constraint 71 dropped
       Constraint 72 dropped
       Constraint 73 dropped
       Constraint 74 dropped
       Constraint 75 dropped
       Constraint 77 dropped
       Constraint 78 dropped
       Constraint 79 dropped
       Constraint 80 dropped
       Constraint 81 dropped
       Constraint 82 dropped
       Constraint 83 dropped
       Constraint 84 dropped
       Constraint 85 dropped
       Constraint 86 dropped
       Constraint 87 dropped
       Constraint 88 dropped
       Constraint 89 dropped
       Constraint 90 dropped
       Constraint 91 dropped
       Constraint 92 dropped
       Constraint 93 dropped
       Constraint 94 dropped
       Constraint 95 dropped
       Constraint 96 dropped
       Constraint 97 dropped
       Constraint 98 dropped
       Constraint 99 dropped
       Constraint 100 dropped
       Constraint 101 dropped
       Constraint 102 dropped
       Constraint 104 dropped
       Constraint 105 dropped
       Constraint 106 dropped
       Constraint 107 dropped
       Constraint 108 dropped
       Constraint 109 dropped
       Constraint 110 dropped
       Constraint 111 dropped
       Constraint 112 dropped
       Constraint 113 dropped
       Constraint 114 dropped
       Constraint 115 dropped
       Constraint 116 dropped
       Constraint 117 dropped
       Constraint 118 dropped
       Constraint 120 dropped
       Constraint 121 dropped
       Constraint 122 dropped
       Constraint 123 dropped
       Constraint 124 dropped
       Constraint 125 dropped
       Constraint 126 dropped
       Constraint 128 dropped
       Constraint 129 dropped
       Constraint 130 dropped
       Constraint 131 dropped
       Constraint 133 dropped
       Constraint 134 dropped
       Constraint 135 dropped
       Constraint 136 dropped
       Constraint 137 dropped
       Constraint 138 dropped
       Constraint 139 dropped
       Constraint 140 dropped
       Constraint 141 dropped
       Constraint 142 dropped
       Constraint 143 dropped
       Constraint 144 dropped
       Constraint 145 dropped
       Constraint 146 dropped
       Constraint 147 dropped
       Constraint 148 dropped
       Constraint 149 dropped
       Constraint 150 dropped
       Constraint 151 dropped
       Constraint 152 dropped
       Constraint 153 dropped
       Constraint 154 dropped
       Constraint 155 dropped
       Constraint 156 dropped
       Constraint 157 dropped
       Constraint 158 dropped
       Constraint 159 dropped
       Constraint 160 dropped
       Constraint 161 dropped
       Constraint 163 dropped
       Constraint 164 dropped
       Constraint 165 dropped

       F( 12,   165) = 1350.11
            Prob > F =    0.0000

. scalar f_p_value = r(F);

. estadd scalar f_p_value = r(F);

added scalar:
          e(f_p_value) =  1350.11

. scalar clust = e(N_clust);

. estadd local city_controls "Yes": reg_base_c_d reg_base_cube reg_all*;

.  estadd local cluster_se "City": reg_base_c_d reg_base_cube reg_all*;

. estadd scalar clust: reg_base_c_d reg_base_cube reg_all*;

. #delimit cr
delimiter now cr
. 
. * Export regressions
. 
. #delimit ;
delimiter now ;
. esttab reg_* using "$OUTPUT_PATH/main_regressions.tex", 
>         se star(* 0.10 **       0.05 *** 0.01) ar2 replace booktabs label
>         drop(*.city2)
>         stats(city_controls cluster_se clust f_p_value N r2_a, label("City fixed effects"
>         "Clustered SE" "Clusters" "F-stat on city fixed effects" "Observations" 
>         "Adjusted R$^2$"));
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/main_regressions.tex)

. #delimit cr
delimiter now cr
. 
. * Create plots of marginal effects
. global indep_vars c.perc_tract_d c.perc_tract_d#c.perc_tract_d c.perc_tract_d#c.perc_tract_d#c.perc_tract_d ///
> c.perc_tract_c c.perc_tract_c#c.perc_tract_c c.perc_tract_c#c.perc_tract_c#c.perc_tract_c

. 
. regress tract_dvoteshare $indep_vars $controls ///
> i.city2 if incl == 1, cluster(city2)

Linear regression                               Number of obs     =      6,026
                                                F(14, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7500
                                                Root MSE          =      .0756

                                                                (Std. err. adjusted for 166 clusters in city2)
--------------------------------------------------------------------------------------------------------------
                                             |               Robust
                            tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------------------------+----------------------------------------------------------------
                                perc_tract_d |    .114366   .0384276     2.98   0.003     .0384929    .1902392
                                             |
               c.perc_tract_d#c.perc_tract_d |  -.2511542   .1073339    -2.34   0.020    -.4630792   -.0392292
                                             |
c.perc_tract_d#c.perc_tract_d#c.perc_tract_d |   .1721504   .0716972     2.40   0.017     .0305881    .3137127
                                             |
                                perc_tract_c |   .1232328   .0370191     3.33   0.001     .0501406     .196325
                                             |
               c.perc_tract_c#c.perc_tract_c |  -.2906397   .0684118    -4.25   0.000    -.4257151   -.1555642
                                             |
c.perc_tract_c#c.perc_tract_c#c.perc_tract_c |   .1874544   .0438335     4.28   0.000     .1009074    .2740013
                                             |
                                  _yr_median |  -.0000156   .0002639    -0.06   0.953    -.0005367    .0005054
                                  median_age |  -.0018103   .0005499    -3.29   0.001     -.002896   -.0007245
                           male_female_ratio |    .012338   .0125741     0.98   0.328    -.0124889    .0371648
                               perc_hs_total |  -.1166325   .0370462    -3.15   0.002    -.1897781   -.0434869
                          perc_somecol_total |   .0856474   .0823745     1.04   0.300    -.0769965    .2482913
                             perc_bach_total |   .4611262   .1147257     4.02   0.000     .2346065    .6876459
                              perc_pop_white |  -.5272898   .1493491    -3.53   0.001    -.8221715   -.2324081
                              perc_pop_black |   .0561635   .0675038     0.83   0.407    -.0771191    .1894461
                              perc_pop_asian |  -.3260139   .0626383    -5.20   0.000    -.4496898    -.202338
                                             |
                                       city2 |
                                     Albany  |  -.0184932   .0372868    -0.50   0.621     -.092114    .0551276
                                    Altoona  |  -.1425691    .021192    -6.73   0.000    -.1844116   -.1007266
                                   Amarillo  |  -.2834451   .0093402   -30.35   0.000    -.3018867   -.2650034
                                  Arlington  |   .0536647   .0491938     1.09   0.277    -.0434658    .1507952
                                    Atlanta  |  -.1025189   .0550275    -1.86   0.064    -.2111677    .0061299
                              Atlantic City  |  -.0974717   .0549179    -1.77   0.078     -.205904    .0109607
                                    Augusta  |   .0700417   .0468893     1.49   0.137    -.0225386    .1626221
                                     Aurora  |  -.0410095   .0550904    -0.74   0.458    -.1497824    .0677635
                                     Austin  |    .013043    .043479     0.30   0.765    -.0728038    .0988899
                                  Baltimore  |  -.0454202   .0462849    -0.98   0.328    -.1368072    .0459668
                                   Bay City  |   .0294304   .0135525     2.17   0.031     .0026717    .0561892
                                   Beaumont  |    .008427   .0336913     0.25   0.803    -.0580947    .0749487
                                    Belmont  |   .0232661    .050747     0.46   0.647    -.0769311    .1234634
                                 Bergen Co.  |  -.1517876   .0626318    -2.42   0.016    -.2754506   -.0281246
                                 Birmingham  |  -.0575269   .0448023    -1.28   0.201    -.1459867    .0309328
                                     Boston  |  -.0337943   .0590845    -0.57   0.568    -.1504534    .0828647
                                   Brockton  |   -.039392   .0493524    -0.80   0.426    -.1368356    .0580516
                                      Bronx  |  -.1074939   .0672111    -1.60   0.112    -.2401986    .0252109
                                  Brookline  |   .0089991   .0609347     0.15   0.883    -.1113131    .1293114
                                   Brooklyn  |  -.1296817   .0515114    -2.52   0.013    -.2313881   -.0279752
                                    Buffalo  |   .0000737   .0286378     0.00   0.998      -.05647    .0566175
                                  Cambridge  |   .0200396   .0603145     0.33   0.740     -.099048    .1391272
                                     Camden  |  -.0275622   .0287476    -0.96   0.339    -.0843228    .0291985
                                     Canton  |  -.0128275   .0027899    -4.60   0.000     -.018336    -.007319
                                  Charlotte  |  -.1352435   .0467098    -2.90   0.004    -.2274695   -.0430176
                                Chattanooga  |   -.056695   .0160875    -3.52   0.001    -.0884589    -.024931
                                    Chelsea  |  -.1044132   .0743283    -1.40   0.162    -.2511703     .042344
                                    Chicago  |   -.052866   .0578945    -0.91   0.362    -.1671757    .0614436
                                  Cleveland  |  -.0347066   .0321323    -1.08   0.282      -.09815    .0287368
                                   Columbia  |  -.1133638   .0307553    -3.69   0.000    -.1740886   -.0526391
                                   Columbus  |   .0220856   .0180655     1.22   0.223    -.0135838     .057755
                             Council Bluffs  |   -.026097   .0155553    -1.68   0.095    -.0568101    .0046162
                                     Dallas  |  -.1515166   .0505549    -3.00   0.003    -.2513344   -.0516988
                                  Davenport  |   -.000404   .0035975    -0.11   0.911    -.0075069     .006699
                                     Dayton  |  -.0749762     .01779    -4.21   0.000    -.1101017   -.0398508
                                    Decatur  |  -.0702897   .0068507   -10.26   0.000    -.0838161   -.0567633
                                     Denver  |   .0273402    .045024     0.61   0.545    -.0615572    .1162375
                                 Des Moines  |   .0150157   .0116063     1.29   0.198    -.0079002    .0379316
                                    Detroit  |  -.0258147    .030687    -0.84   0.401    -.0864046    .0347751
                                    Dubuque  |   .0025681   .0152805     0.17   0.867    -.0276024    .0327387
                                     Duluth  |   .0913789   .0051641    17.70   0.000     .0811827     .101575
                                     Durham  |  -.0519399   .0536998    -0.97   0.335    -.1579673    .0540875
                             East St. Louis  |  -.0447289   .0409727    -1.09   0.277    -.1256273    .0361695
                                    El Paso  |  -.0560925    .050949    -1.10   0.273    -.1566885    .0445035
                                     Elmira  |  -.0509869    .008454    -6.03   0.000    -.0676788   -.0342949
                                       Erie  |   .0404484   .0075635     5.35   0.000     .0255146    .0553822
                                  Essex Co.  |  -.0913316   .0621122    -1.47   0.143    -.2139687    .0313055
                                 Evansville  |  -.0259117   .0032248    -8.04   0.000    -.0322789   -.0195446
                                    Everett  |  -.0870585   .0512268    -1.70   0.091     -.188203    .0140861
                                      Flint  |  -.0135074   .0429683    -0.31   0.754    -.0983459    .0713311
                                 Fort Wayne  |   -.034628   .0180467    -1.92   0.057    -.0702601    .0010041
                                 Fort Worth  |  -.0982939   .0424244    -2.32   0.022    -.1820586   -.0145292
                                     Fresno  |  -.0797869   .0504097    -1.58   0.115     -.179318    .0197443
                                  Galveston  |  -.0844594   .0295128    -2.86   0.005    -.1427309   -.0261879
                               Grand Rapids  |  -.0492527   .0276622    -1.78   0.077    -.1038702    .0053648
                        Greater Kansas City  |  -.0127681    .037544    -0.34   0.734    -.0868967    .0613604
                                 Greensboro  |  -.0762352   .0415515    -1.83   0.068    -.1582764    .0058059
                                 Harrisburg  |   .0050555   .0302855     0.17   0.868    -.0547417    .0648527
                                   Hartford  |  -.0303486   .0483586    -0.63   0.531    -.1258301    .0651329
                           Holyoke Chicopee  |  -.0220508   .0127129    -1.73   0.085    -.0471517    .0030501
                                    Houston  |  -.1096087   .0539823    -2.03   0.044    -.2161938   -.0030236
                                 Hudson Co.  |  -.1524886    .073952    -2.06   0.041    -.2985028   -.0064744
                               Indianapolis  |  -.0540468   .0231212    -2.34   0.021    -.0996984   -.0083953
                                    Jackson  |   -.037593   .0023504   -15.99   0.000    -.0422336   -.0329523
                               Jacksonville  |  -.0494718   .0216482    -2.29   0.024     -.092215   -.0067285
                                  Johnstown  |  -.0493659    .022894    -2.16   0.033    -.0945688   -.0041629
                                     Joliet  |  -.0674745   .0269337    -2.51   0.013    -.1206535   -.0142954
                                    Kenosha  |  -.0622588   .0088219    -7.06   0.000    -.0796773   -.0448404
                                  Knoxville  |   .0474129   .0037856    12.52   0.000     .0399383    .0548874
                              Lake Co. Gary  |  -.0112464   .0628307    -0.18   0.858    -.1353021    .1128094
                                    Lansing  |    .037851   .0143588     2.64   0.009     .0095004    .0662015
                                       Lima  |  -.1180399   .0190586    -6.19   0.000    -.1556701   -.0804097
                                    Lincoln  |   -.011991   .0086019    -1.39   0.165     -.028975     .004993
                                Little Rock  |  -.0311465   .0347186    -0.90   0.371    -.0996965    .0374035
                                Los Angeles  |  -.0778715   .0683534    -1.14   0.256    -.2128317    .0570886
                      Lower Westchester Co.  |  -.1462881   .0610484    -2.40   0.018    -.2668248   -.0257513
                                      Macon  |  -.1632908   .0333162    -4.90   0.000    -.2290717   -.0975099
                                    Madison  |   .1206164   .0217276     5.55   0.000     .0777164    .1635163
                                     Malden  |  -.0674487   .0525813    -1.28   0.201    -.1712677    .0363703
                                 Manchester  |  -.0448691    .005839    -7.68   0.000    -.0563979   -.0333403
                                  Manhattan  |  -.0319423    .071696    -0.45   0.657    -.1735022    .1096175
                                    Medford  |  -.0410887   .0443912    -0.93   0.356    -.1287368    .0465593
                                    Melrose  |  -.0035235   .0408503    -0.09   0.931    -.0841802    .0771332
                                    Memphis  |    -.07774   .0368156    -2.11   0.036    -.1504304   -.0050496
                                      Miami  |  -.3123072    .080377    -3.89   0.000    -.4710072   -.1536072
                              Milwaukee Co.  |  -.0244017   .0336539    -0.73   0.469    -.0908495     .042046
                                Minneapolis  |   .0486293   .0343429     1.42   0.159     -.019179    .1164375
                                     Mobile  |  -.2054094   .0387052    -5.31   0.000    -.2818308    -.128988
                                 Montgomery  |  -.1189408   .0240926    -4.94   0.000    -.1665104   -.0713712
                                   Muskegon  |  -.0149174    .038019    -0.39   0.695    -.0899837     .060149
                                  Nashville  |   -.104649   .0356608    -2.93   0.004    -.1750593   -.0342387
                                New Britain  |  -.0480752   .0245789    -1.96   0.052    -.0966048    .0004545
                                 New Castle  |  -.0160445   .0286973    -0.56   0.577    -.0727057    .0406168
                                  New Haven  |  -.0530777   .0269087    -1.97   0.050    -.1062075    .0000522
                                New Orleans  |  -.0450199    .046087    -0.98   0.330    -.1360163    .0459765
                                     Newton  |   .0112743    .063936     0.18   0.860    -.1149639    .1375125
                              Niagara Falls  |  -.0008625   .0050406    -0.17   0.864     -.010815    .0090899
                                    Norfolk  |   -.061753   .0415796    -1.49   0.139    -.1438496    .0203437
                                    Oakland  |   .0179046    .074138     0.24   0.809    -.1284768     .164286
                                      Ogden  |  -.1124764   .0159657    -7.04   0.000    -.1439998   -.0809531
                              Oklahoma City  |  -.0878973   .0337783    -2.60   0.010    -.1545908   -.0212038
                                      Omaha  |    -.02562   .0168907    -1.52   0.131    -.0589698    .0077299
                                    Oshkosh  |   .0020426   .0108497     0.19   0.851    -.0193796    .0234647
                  Pawtucket & Central Falls  |  -.0130826   .0219907    -0.59   0.553    -.0565021    .0303368
                                     Peoria  |  -.0064576   .0228188    -0.28   0.778     -.051512    .0385968
                               Philadelphia  |  -.0153355   .0430309    -0.36   0.722    -.1002976    .0696266
                                    Phoenix  |  -.0141396   .0370649    -0.38   0.703    -.0873223    .0590431
                                 Pittsburgh  |    .015118   .0242535     0.62   0.534    -.0327693    .0630053
                                    Pontiac  |   -.006411   .0286083    -0.22   0.823    -.0628966    .0500746
                                Port Arthur  |  -.0866747   .0371983    -2.33   0.021    -.1601207   -.0132288
                                   Portland  |    .110104   .0401891     2.74   0.007     .0307529    .1894551
                               Poughkeepsie  |  -.0735105   .0434836    -1.69   0.093    -.1593664    .0123454
                                 Providence  |  -.0397772     .04804    -0.83   0.409    -.1346296    .0550752
                                     Pueblo  |  -.0410356   .0191313    -2.14   0.033    -.0788095   -.0032618
                                     Queens  |  -.1009918   .0715757    -1.41   0.160    -.2423142    .0403306
                                     Quincy  |  -.0183355   .0389109    -0.47   0.638    -.0951629     .058492
                                     Racine  |  -.0321439   .0055534    -5.79   0.000    -.0431088   -.0211791
                                     Revere  |  -.0327224   .0377122    -0.87   0.387     -.107183    .0417383
                                   Richmond  |  -.0790478   .0395833    -2.00   0.047    -.1572028   -.0008928
                                  Rochester  |  -.0257811   .0337929    -0.76   0.447    -.0925033    .0409411
                                   Rockford  |  -.0528278   .0152626    -3.46   0.001    -.0829631   -.0226926
                                 Sacramento  |  -.0029704   .0513841    -0.06   0.954    -.1044254    .0984847
                                    Saginaw  |  -.0242564    .019009    -1.28   0.204    -.0617885    .0132758
                             Salt Lake City  |    .036318    .027468     1.32   0.188     -.017916     .090552
                                San Antonio  |  -.0032718   .0406807    -0.08   0.936    -.0835935      .07705
                                  San Diego  |  -.0698182   .0599784    -1.16   0.246    -.1882424    .0486059
                              San Francisco  |  -.0031562   .0842129    -0.04   0.970      -.16943    .1631176
                                   San Jose  |   -.041726   .0666436    -0.63   0.532    -.1733103    .0898582
                                   Savannah  |   .0070291   .0281616     0.25   0.803    -.0485743    .0626326
                                Schenectady  |  -.0833454   .0133945    -6.22   0.000    -.1097922   -.0568986
                                    Seattle  |    .065043   .0558176     1.17   0.246    -.0451658    .1752518
                                 Shreveport  |    -.19168   .0568089    -3.37   0.001     -.303846    -.079514
                                 Sioux City  |  -.1429341   .0127483   -11.21   0.000    -.1681049   -.1177633
                                 Somerville  |   .0648445   .0503532     1.29   0.200    -.0345752    .1642642
                                 South Bend  |   .0016896   .0132775     0.13   0.899     -.024526    .0279053
                                    Spokane  |  -.0439456   .0099137    -4.43   0.000    -.0635196   -.0243716
                                Springfield  |  -.0335772   .0080459    -4.17   0.000    -.0494635   -.0176909
                                 St. Joseph  |  -.0415299   .0132809    -3.13   0.002    -.0677523   -.0153074
                                  St. Louis  |  -.0232082    .037606    -0.62   0.538    -.0974593    .0510429
                                   St. Paul  |     .05458    .030135     1.81   0.072    -.0049199    .1140798
                             St. Petersburg  |   -.053215   .0327676    -1.62   0.106    -.1179128    .0114828
           Stamford, Darien, and New Canaan  |  -.1621783   .0655502    -2.47   0.014    -.2916037    -.032753
                              Staten Island  |  -.2051465   .0448518    -4.57   0.000    -.2937039    -.116589
                                   Stockton  |  -.0844576   .0513493    -1.64   0.102     -.185844    .0169288
                                   Syracuse  |  -.0057338   .0115829    -0.50   0.621    -.0286037     .017136
                                     Tacoma  |  -.0072309   .0298762    -0.24   0.809    -.0662199     .051758
                                      Tampa  |  -.1266078    .044834    -2.82   0.005    -.2151302   -.0380855
                                Terre Haute  |  -.0754439   .0051528   -14.64   0.000    -.0856179     -.06527
                                     Toledo  |  -.0102174   .0152072    -0.67   0.503    -.0402433    .0198084
                                     Topeka  |  -.0355891   .0103852    -3.43   0.001    -.0560941   -.0150842
                                    Trenton  |  -.0801996   .0551766    -1.45   0.148    -.1891427    .0287435
                                      Tulsa  |  -.0852532   .0344447    -2.48   0.014    -.1532624    -.017244
                                  Union Co.  |  -.1352336   .0647839    -2.09   0.038    -.2631458   -.0073214
                                      Utica  |  -.0552574   .0110324    -5.01   0.000    -.0770404   -.0334745
                                       Waco  |   -.120619   .0310175    -3.89   0.000    -.1818614   -.0593767
                                     Warren  |   .0430768    .024652     1.75   0.082    -.0055972    .0917508
                                  Waterbury  |  -.1229064   .0401269    -3.06   0.003    -.2021347   -.0436781
                                   Waterloo  |   .0010972   .0068543     0.16   0.873    -.0124361    .0146306
                                  Watertown  |   -.030888   .0463505    -0.67   0.506    -.1224046    .0606285
                                    Wichita  |  -.1028402   .0279188    -3.68   0.000    -.1579643    -.047716
                               Wilkes-Barre  |  -.0610845   .0051096   -11.95   0.000    -.0711731   -.0509958
                              Winston-Salem  |  -.0384934   .0334438    -1.15   0.251    -.1045262    .0275395
                                 Woonsocket  |  -.0885153   .0046635   -18.98   0.000    -.0977231   -.0793075
                                       York  |    -.05618   .0342377    -1.64   0.103    -.1237804    .0114204
                                 Youngstown  |  -.0134195   .0166526    -0.81   0.421    -.0462992    .0194602
                                             |
                                       _cons |   .9664073   .0454542    21.26   0.000     .8766604    1.056154
--------------------------------------------------------------------------------------------------------------

. margins, at(perc_tract_d=(0(0.01)1))

Predictive margins                                       Number of obs = 6,026
Model VCE: Robust

Expression: Linear prediction, predict()
1._at:   perc_tract_d =   0
2._at:   perc_tract_d = .01
3._at:   perc_tract_d = .02
4._at:   perc_tract_d = .03
5._at:   perc_tract_d = .04
6._at:   perc_tract_d = .05
7._at:   perc_tract_d = .06
8._at:   perc_tract_d = .07
9._at:   perc_tract_d = .08
10._at:  perc_tract_d = .09
11._at:  perc_tract_d =  .1
12._at:  perc_tract_d = .11
13._at:  perc_tract_d = .12
14._at:  perc_tract_d = .13
15._at:  perc_tract_d = .14
16._at:  perc_tract_d = .15
17._at:  perc_tract_d = .16
18._at:  perc_tract_d = .17
19._at:  perc_tract_d = .18
20._at:  perc_tract_d = .19
21._at:  perc_tract_d =  .2
22._at:  perc_tract_d = .21
23._at:  perc_tract_d = .22
24._at:  perc_tract_d = .23
25._at:  perc_tract_d = .24
26._at:  perc_tract_d = .25
27._at:  perc_tract_d = .26
28._at:  perc_tract_d = .27
29._at:  perc_tract_d = .28
30._at:  perc_tract_d = .29
31._at:  perc_tract_d =  .3
32._at:  perc_tract_d = .31
33._at:  perc_tract_d = .32
34._at:  perc_tract_d = .33
35._at:  perc_tract_d = .34
36._at:  perc_tract_d = .35
37._at:  perc_tract_d = .36
38._at:  perc_tract_d = .37
39._at:  perc_tract_d = .38
40._at:  perc_tract_d = .39
41._at:  perc_tract_d =  .4
42._at:  perc_tract_d = .41
43._at:  perc_tract_d = .42
44._at:  perc_tract_d = .43
45._at:  perc_tract_d = .44
46._at:  perc_tract_d = .45
47._at:  perc_tract_d = .46
48._at:  perc_tract_d = .47
49._at:  perc_tract_d = .48
50._at:  perc_tract_d = .49
51._at:  perc_tract_d =  .5
52._at:  perc_tract_d = .51
53._at:  perc_tract_d = .52
54._at:  perc_tract_d = .53
55._at:  perc_tract_d = .54
56._at:  perc_tract_d = .55
57._at:  perc_tract_d = .56
58._at:  perc_tract_d = .57
59._at:  perc_tract_d = .58
60._at:  perc_tract_d = .59
61._at:  perc_tract_d =  .6
62._at:  perc_tract_d = .61
63._at:  perc_tract_d = .62
64._at:  perc_tract_d = .63
65._at:  perc_tract_d = .64
66._at:  perc_tract_d = .65
67._at:  perc_tract_d = .66
68._at:  perc_tract_d = .67
69._at:  perc_tract_d = .68
70._at:  perc_tract_d = .69
71._at:  perc_tract_d =  .7
72._at:  perc_tract_d = .71
73._at:  perc_tract_d = .72
74._at:  perc_tract_d = .73
75._at:  perc_tract_d = .74
76._at:  perc_tract_d = .75
77._at:  perc_tract_d = .76
78._at:  perc_tract_d = .77
79._at:  perc_tract_d = .78
80._at:  perc_tract_d = .79
81._at:  perc_tract_d =  .8
82._at:  perc_tract_d = .81
83._at:  perc_tract_d = .82
84._at:  perc_tract_d = .83
85._at:  perc_tract_d = .84
86._at:  perc_tract_d = .85
87._at:  perc_tract_d = .86
88._at:  perc_tract_d = .87
89._at:  perc_tract_d = .88
90._at:  perc_tract_d = .89
91._at:  perc_tract_d =  .9
92._at:  perc_tract_d = .91
93._at:  perc_tract_d = .92
94._at:  perc_tract_d = .93
95._at:  perc_tract_d = .94
96._at:  perc_tract_d = .95
97._at:  perc_tract_d = .96
98._at:  perc_tract_d = .97
99._at:  perc_tract_d = .98
100._at: perc_tract_d = .99
101._at: perc_tract_d =   1

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .7811841   .0048227   161.98   0.000      .771662    .7907061
          2  |   .7823028   .0047481   164.76   0.000     .7729279    .7916777
          3  |   .7833723   .0046962   166.81   0.000     .7740999    .7926447
          4  |   .7843936   .0046636   168.20   0.000     .7751856    .7936017
          5  |   .7853679    .004647   169.01   0.000     .7761926    .7945431
          6  |    .786296   .0046433   169.34   0.000     .7771281    .7954639
          7  |    .787179   .0046494   169.31   0.000      .777999    .7963591
          8  |   .7880181   .0046627   169.00   0.000     .7788118    .7972243
          9  |   .7888141   .0046808   168.52   0.000     .7795722     .798056
         10  |   .7895681   .0047015   167.94   0.000     .7802854    .7988509
         11  |   .7902813    .004723   167.33   0.000      .780956    .7996065
         12  |   .7909545   .0047438   166.73   0.000     .7815881    .8003208
         13  |   .7915888   .0047626   166.21   0.000     .7821853    .8009924
         14  |   .7921853   .0047784   165.78   0.000     .7827506    .8016201
         15  |   .7927451   .0047904   165.49   0.000     .7832866    .8022035
         16  |    .793269   .0047979   165.34   0.000     .7837957    .8027423
         17  |   .7937582   .0048005   165.35   0.000     .7842798    .8032366
         18  |   .7942137   .0047979   165.53   0.000     .7847404     .803687
         19  |   .7946365   .0047899   165.90   0.000     .7851791     .804094
         20  |   .7950277   .0047765   166.45   0.000     .7855968    .8044586
         21  |   .7953883   .0047576   167.18   0.000     .7859946     .804782
         22  |   .7957193   .0047335   168.10   0.000     .7863732    .8050654
         23  |   .7960218   .0047044   169.21   0.000     .7867331    .8053104
         24  |   .7962967   .0046707   170.49   0.000     .7870747    .8055188
         25  |   .7965452   .0046327   171.94   0.000     .7873983    .8056922
         26  |   .7967683   .0045909   173.55   0.000     .7877038    .8058327
         27  |   .7969669   .0045459   175.32   0.000     .7879913    .8059425
         28  |   .7971422   .0044983   177.21   0.000     .7882606    .8060237
         29  |   .7972951   .0044487   179.22   0.000     .7885113    .8060789
         30  |   .7974267   .0043981   181.31   0.000     .7887429    .8061105
         31  |    .797538   .0043471   183.46   0.000     .7889549    .8061212
         32  |   .7976301   .0042967   185.64   0.000     .7891464    .8061138
         33  |    .797704   .0042479   187.79   0.000     .7893168    .8060912
         34  |   .7977607   .0042015   189.88   0.000     .7894651    .8060563
         35  |   .7978013   .0041586   191.84   0.000     .7895904    .8060122
         36  |   .7978267   .0041203   193.63   0.000     .7896915     .805962
         37  |   .7978381   .0040876   195.19   0.000     .7897674    .8059088
         38  |   .7978364   .0040615   196.44   0.000     .7898171    .8058557
         39  |   .7978227   .0040432   197.33   0.000     .7898397    .8058058
         40  |    .797798   .0040335   197.79   0.000     .7898342    .8057619
         41  |   .7977634   .0040332   197.80   0.000        .7898    .8057268
         42  |   .7977199   .0040433   197.29   0.000     .7897366    .8057031
         43  |   .7976685   .0040642   196.27   0.000     .7896439    .8056931
         44  |   .7976102   .0040965   194.70   0.000     .7895218    .8056986
         45  |   .7975461   .0041406   192.62   0.000     .7893708    .8057214
         46  |   .7974772   .0041964   190.04   0.000     .7891916    .8057628
         47  |   .7974046   .0042641   187.00   0.000     .7889854    .8058239
         48  |   .7973293   .0043435   183.57   0.000     .7887533    .8059052
         49  |   .7972523   .0044342   179.80   0.000     .7884972    .8060073
         50  |   .7971746   .0045358   175.75   0.000     .7882189    .8061303
         51  |   .7970973   .0046478   171.50   0.000     .7879205    .8062742
         52  |   .7970214   .0047696   167.10   0.000     .7876041    .8064387
         53  |    .796948   .0049005   162.63   0.000     .7872723    .8066238
         54  |   .7968781   .0050398   158.12   0.000     .7869273    .8068288
         55  |   .7968126   .0051867   153.62   0.000     .7865717    .8070536
         56  |   .7967527   .0053407   149.19   0.000     .7862079    .8072976
         57  |   .7966994   .0055008   144.83   0.000     .7858383    .8075605
         58  |   .7966537   .0056665   140.59   0.000     .7854655     .807842
         59  |   .7966167   .0058371   136.48   0.000     .7850917    .8081416
         60  |   .7965893   .0060118   132.50   0.000     .7847194    .8084593
         61  |   .7965726   .0061901   128.68   0.000     .7843506    .8087947
         62  |   .7965677   .0063714   125.02   0.000     .7839877    .8091477
         63  |   .7965756   .0065552   121.52   0.000     .7836327    .8095184
         64  |   .7965972   .0067409   118.17   0.000     .7832877    .8099067
         65  |   .7966337    .006928   114.99   0.000     .7829547    .8103128
         66  |   .7966861   .0071162   111.95   0.000     .7826356    .8107367
         67  |   .7967554    .007305   109.07   0.000     .7823321    .8111787
         68  |   .7968426    .007494   106.33   0.000     .7820461    .8116391
         69  |   .7969488   .0076829   103.73   0.000     .7817793    .8121184
         70  |    .797075   .0078715   101.26   0.000     .7815332    .8126169
         71  |   .7972223   .0080594    98.92   0.000     .7813094    .8131351
         72  |   .7973916   .0082464    96.70   0.000     .7811095    .8136737
         73  |    .797584   .0084324    94.59   0.000     .7809347    .8142334
         74  |   .7978006   .0086172    92.58   0.000     .7807865    .8148147
         75  |   .7980423   .0088006    90.68   0.000      .780666    .8154186
         76  |   .7983103   .0089826    88.87   0.000     .7805746     .816046
         77  |   .7986054   .0091632    87.15   0.000     .7805132    .8166977
         78  |   .7989289   .0093423    85.52   0.000      .780483    .8173748
         79  |   .7992816   .0095201    83.96   0.000     .7804848    .8180785
         80  |   .7996647   .0096965    82.47   0.000     .7805196    .8188099
         81  |   .8000792   .0098717    81.05   0.000      .780588    .8195704
         82  |    .800526    .010046    79.69   0.000     .7806908    .8203612
         83  |   .8010063   .0102194    78.38   0.000     .7808286    .8211841
         84  |   .8015211   .0103924    77.13   0.000     .7810018    .8220403
         85  |   .8020713   .0105652    75.92   0.000     .7812108    .8229318
         86  |   .8026581   .0107383    74.75   0.000      .781456    .8238603
         87  |   .8032825    .010912    73.61   0.000     .7817374    .8248275
         88  |   .8039454   .0110868    72.51   0.000     .7820551    .8258357
         89  |    .804648   .0112633    71.44   0.000     .7824091    .8268869
         90  |   .8053912   .0114422    70.39   0.000     .7827992    .8279833
         91  |   .8061762    .011624    69.35   0.000     .7832251    .8291272
         92  |   .8070039   .0118096    68.33   0.000     .7836865    .8303213
         93  |   .8078753   .0119997    67.32   0.000     .7841826     .831568
         94  |   .8087915   .0121951    66.32   0.000      .784713    .8328701
         95  |   .8097536   .0123968    65.32   0.000     .7852769    .8342303
         96  |   .8107625   .0126056    64.32   0.000     .7858734    .8356517
         97  |   .8118194   .0128228    63.31   0.000     .7865015    .8371372
         98  |   .8129251   .0130492    62.30   0.000     .7871602      .83869
         99  |   .8140808    .013286    61.27   0.000     .7878484    .8403133
        100  |   .8152875   .0135343    60.24   0.000     .7885648    .8420103
        101  |   .8165462   .0137954    59.19   0.000     .7893081    .8437844
------------------------------------------------------------------------------

. marginsplot, recast(line) recastci(rarea) ytitle(Predicted Dem share, size(medlarge)) xtitle(, size(medlarge))

Variables that uniquely identify margins: perc_tract_d

. graph export "$OUTPUT_PATH\dshare_marginplot.png", as(png) replace
file C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output\dshare_marginplot.png saved as PNG format

. 
. margins, at(perc_tract_c=(0(0.01)1))

Predictive margins                                       Number of obs = 6,026
Model VCE: Robust

Expression: Linear prediction, predict()
1._at:   perc_tract_c =   0
2._at:   perc_tract_c = .01
3._at:   perc_tract_c = .02
4._at:   perc_tract_c = .03
5._at:   perc_tract_c = .04
6._at:   perc_tract_c = .05
7._at:   perc_tract_c = .06
8._at:   perc_tract_c = .07
9._at:   perc_tract_c = .08
10._at:  perc_tract_c = .09
11._at:  perc_tract_c =  .1
12._at:  perc_tract_c = .11
13._at:  perc_tract_c = .12
14._at:  perc_tract_c = .13
15._at:  perc_tract_c = .14
16._at:  perc_tract_c = .15
17._at:  perc_tract_c = .16
18._at:  perc_tract_c = .17
19._at:  perc_tract_c = .18
20._at:  perc_tract_c = .19
21._at:  perc_tract_c =  .2
22._at:  perc_tract_c = .21
23._at:  perc_tract_c = .22
24._at:  perc_tract_c = .23
25._at:  perc_tract_c = .24
26._at:  perc_tract_c = .25
27._at:  perc_tract_c = .26
28._at:  perc_tract_c = .27
29._at:  perc_tract_c = .28
30._at:  perc_tract_c = .29
31._at:  perc_tract_c =  .3
32._at:  perc_tract_c = .31
33._at:  perc_tract_c = .32
34._at:  perc_tract_c = .33
35._at:  perc_tract_c = .34
36._at:  perc_tract_c = .35
37._at:  perc_tract_c = .36
38._at:  perc_tract_c = .37
39._at:  perc_tract_c = .38
40._at:  perc_tract_c = .39
41._at:  perc_tract_c =  .4
42._at:  perc_tract_c = .41
43._at:  perc_tract_c = .42
44._at:  perc_tract_c = .43
45._at:  perc_tract_c = .44
46._at:  perc_tract_c = .45
47._at:  perc_tract_c = .46
48._at:  perc_tract_c = .47
49._at:  perc_tract_c = .48
50._at:  perc_tract_c = .49
51._at:  perc_tract_c =  .5
52._at:  perc_tract_c = .51
53._at:  perc_tract_c = .52
54._at:  perc_tract_c = .53
55._at:  perc_tract_c = .54
56._at:  perc_tract_c = .55
57._at:  perc_tract_c = .56
58._at:  perc_tract_c = .57
59._at:  perc_tract_c = .58
60._at:  perc_tract_c = .59
61._at:  perc_tract_c =  .6
62._at:  perc_tract_c = .61
63._at:  perc_tract_c = .62
64._at:  perc_tract_c = .63
65._at:  perc_tract_c = .64
66._at:  perc_tract_c = .65
67._at:  perc_tract_c = .66
68._at:  perc_tract_c = .67
69._at:  perc_tract_c = .68
70._at:  perc_tract_c = .69
71._at:  perc_tract_c =  .7
72._at:  perc_tract_c = .71
73._at:  perc_tract_c = .72
74._at:  perc_tract_c = .73
75._at:  perc_tract_c = .74
76._at:  perc_tract_c = .75
77._at:  perc_tract_c = .76
78._at:  perc_tract_c = .77
79._at:  perc_tract_c = .78
80._at:  perc_tract_c = .79
81._at:  perc_tract_c =  .8
82._at:  perc_tract_c = .81
83._at:  perc_tract_c = .82
84._at:  perc_tract_c = .83
85._at:  perc_tract_c = .84
86._at:  perc_tract_c = .85
87._at:  perc_tract_c = .86
88._at:  perc_tract_c = .87
89._at:  perc_tract_c = .88
90._at:  perc_tract_c = .89
91._at:  perc_tract_c =  .9
92._at:  perc_tract_c = .91
93._at:  perc_tract_c = .92
94._at:  perc_tract_c = .93
95._at:  perc_tract_c = .94
96._at:  perc_tract_c = .95
97._at:  perc_tract_c = .96
98._at:  perc_tract_c = .97
99._at:  perc_tract_c = .98
100._at: perc_tract_c = .99
101._at: perc_tract_c =   1

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         _at |
          1  |    .781157   .0052656   148.35   0.000     .7707605    .7915536
          2  |   .7823605   .0050011   156.44   0.000      .772486    .7922349
          3  |   .7835069   .0047532   164.84   0.000     .7741221    .7928917
          4  |   .7845975   .0045219   173.51   0.000     .7756693    .7935257
          5  |   .7856333   .0043074   182.39   0.000     .7771285    .7941381
          6  |   .7866155   .0041101   191.39   0.000     .7785004    .7947306
          7  |   .7875452   .0039299   200.40   0.000     .7797858    .7953045
          8  |   .7884235    .003767   209.30   0.000     .7809856    .7958613
          9  |   .7892515   .0036216   217.93   0.000     .7821008    .7964022
         10  |   .7900304   .0034936   226.14   0.000     .7831326    .7969283
         11  |   .7907613   .0033828   233.76   0.000     .7840822    .7974405
         12  |   .7914454    .003289   240.63   0.000     .7849513    .7979394
         13  |   .7920836   .0032119   246.61   0.000      .785742    .7984253
         14  |   .7926773   .0031507   251.59   0.000     .7864564    .7988982
         15  |   .7932274   .0031048   255.48   0.000     .7870971    .7993578
         16  |   .7937352   .0030734   258.26   0.000      .787667    .7998034
         17  |   .7942017   .0030553   259.94   0.000     .7881692    .8002342
         18  |   .7946281   .0030495   260.58   0.000      .788607    .8006491
         19  |   .7950154   .0030549   260.25   0.000     .7889837    .8010471
         20  |   .7953649   .0030702   259.06   0.000     .7893029    .8014268
         21  |   .7956776   .0030944   257.14   0.000      .789568    .8017872
         22  |   .7959547   .0031262   254.61   0.000     .7897822    .8021272
         23  |   .7961973   .0031647   251.59   0.000     .7899487    .8024458
         24  |   .7964065   .0032089   248.19   0.000     .7900707    .8027422
         25  |   .7965834   .0032578   244.51   0.000      .790151    .8030158
         26  |   .7967292   .0033108   240.65   0.000     .7901922    .8032662
         27  |    .796845    .003367   236.66   0.000      .790197     .803493
         28  |   .7969319   .0034259   232.62   0.000     .7901676    .8036961
         29  |    .796991   .0034869   228.57   0.000     .7901064    .8038757
         30  |   .7970235   .0035495   224.55   0.000     .7900153    .8040318
         31  |   .7970305   .0036133   220.58   0.000     .7898963    .8041648
         32  |   .7970131    .003678   216.70   0.000     .7897512    .8042751
         33  |   .7969725   .0037432   212.91   0.000     .7895818    .8043632
         34  |   .7969097   .0038087   209.24   0.000     .7893897    .8044297
         35  |   .7968259   .0038742   205.67   0.000     .7891765    .8044753
         36  |   .7967222   .0039396   202.23   0.000     .7889437    .8045007
         37  |   .7965998   .0040047   198.92   0.000     .7886928    .8045068
         38  |   .7964597   .0040693   195.73   0.000     .7884252    .8044942
         39  |   .7963031   .0041332   192.66   0.000     .7881423    .8044639
         40  |   .7961311   .0041965   189.71   0.000     .7878454    .8044168
         41  |   .7959449   .0042588   186.89   0.000      .787536    .8043537
         42  |   .7957455   .0043203   184.19   0.000     .7872153    .8042756
         43  |   .7955341   .0043807   181.60   0.000     .7868847    .8041834
         44  |   .7953118   .0044399   179.13   0.000     .7865454    .8040781
         45  |   .7950797   .0044979   176.77   0.000     .7861989    .8039605
         46  |    .794839   .0045546   174.51   0.000     .7858463    .8038317
         47  |   .7945908   .0046098   172.37   0.000      .785489    .8036926
         48  |   .7943362   .0046636   170.33   0.000     .7851283    .8035441
         49  |   .7940763   .0047157   168.39   0.000     .7847654    .8033872
         50  |   .7938123   .0047661   166.55   0.000     .7844018    .8032228
         51  |   .7935453   .0048148   164.81   0.000     .7840387    .8030518
         52  |   .7932764   .0048616   163.17   0.000     .7836775    .8028752
         53  |   .7930067   .0049063   161.63   0.000     .7833194     .802694
         54  |   .7927373    .004949   160.18   0.000     .7829658    .8025089
         55  |   .7924695   .0049895   158.83   0.000      .782618     .802321
         56  |   .7922043   .0050277   157.57   0.000     .7822773    .8021312
         57  |   .7919428   .0050635   156.40   0.000     .7819452    .8019404
         58  |   .7916861   .0050968   155.33   0.000     .7816228    .8017494
         59  |   .7914354   .0051274   154.35   0.000     .7813117    .8015592
         60  |   .7911919   .0051553   153.47   0.000      .781013    .8013707
         61  |   .7909565   .0051804   152.68   0.000     .7807282    .8011849
         62  |   .7907306   .0052025   151.99   0.000     .7804586    .8010025
         63  |   .7905151   .0052215   151.40   0.000     .7802055    .8008246
         64  |   .7903112   .0052374   150.90   0.000     .7799703    .8006521
         65  |     .79012     .00525   150.50   0.000     .7797542    .8004859
         66  |   .7899427   .0052593   150.20   0.000     .7795586    .8003269
         67  |   .7897804   .0052651   150.00   0.000     .7793847     .800176
         68  |   .7896342   .0052674   149.91   0.000     .7792339    .8000344
         69  |   .7895052   .0052662   149.92   0.000     .7791074    .7999029
         70  |   .7893945   .0052613   150.04   0.000     .7790064    .7997826
         71  |   .7893034   .0052527   150.27   0.000     .7789322    .7996746
         72  |   .7892328   .0052404   150.60   0.000     .7788858    .7995798
         73  |    .789184   .0052245   151.06   0.000     .7788685    .7994994
         74  |    .789158   .0052048   151.62   0.000     .7788813    .7994347
         75  |    .789156   .0051815   152.30   0.000     .7789253    .7993867
         76  |   .7891791   .0051547   153.10   0.000     .7790014    .7993568
         77  |   .7892284   .0051244   154.01   0.000     .7791106    .7993463
         78  |   .7893051   .0050908   155.04   0.000     .7792536    .7993567
         79  |   .7894103   .0050541   156.19   0.000     .7794312    .7993894
         80  |    .789545   .0050146   157.45   0.000      .779644     .799446
         81  |   .7897105   .0049725   158.82   0.000     .7798926    .7995284
         82  |   .7899078   .0049283   160.28   0.000     .7801772    .7996384
         83  |   .7901381   .0048823   161.84   0.000     .7804983     .799778
         84  |   .7904025   .0048352   163.47   0.000     .7808557    .7999494
         85  |   .7907022   .0047876   165.16   0.000     .7812493     .800155
         86  |   .7910381   .0047402   166.88   0.000     .7816788    .8003974
         87  |   .7914116    .004694   168.60   0.000     .7821436    .8006796
         88  |   .7918236   .0046498   170.29   0.000     .7826428    .8010045
         89  |   .7922754    .004609   171.90   0.000     .7831752    .8013756
         90  |    .792768   .0045727   173.37   0.000     .7837395    .8017965
         91  |   .7933026   .0045424   174.65   0.000      .784334    .8022713
         92  |   .7938803   .0045196   175.65   0.000     .7849566     .802804
         93  |   .7945022   .0045061   176.32   0.000     .7856051    .8033994
         94  |   .7951695   .0045038   176.56   0.000     .7862771    .8040619
         95  |   .7958832   .0045143   176.30   0.000     .7869699    .8047965
         96  |   .7966446   .0045398   175.48   0.000      .787681    .8056081
         97  |   .7974546    .004582   174.04   0.000     .7884076    .8065016
         98  |   .7983145   .0046428   171.95   0.000     .7891475    .8074815
         99  |   .7992254   .0047239   169.19   0.000     .7898983    .8085525
        100  |   .8001883   .0048267   165.78   0.000     .7906582    .8097185
        101  |   .8012045   .0049526   161.78   0.000     .7914259    .8109831
------------------------------------------------------------------------------

. marginsplot, recast(line) recastci(rarea) ytitle(Predicted value of Dem share, size(medlarge)) xtitle(, size(medlarge))

Variables that uniquely identify margins: perc_tract_c

. graph export "$OUTPUT_PATH\cshare_marginplot.png", as(png) replace
file C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output\cshare_marginplot.png saved as PNG format

. 
. log close
      name:  <unnamed>
       log:  C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/regression_analysis_log.log
  log type:  text
 closed on:   1 Apr 2023, 23:57:38
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
