------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/regression_analysis_log.log
  log type:  text
 opened on:   4 Apr 2023, 11:17:25

. 
. cd "$INPUT_PATH/Merge"
C:\Users\lijia\OneDrive - University of Toronto\Documents\School\1-5 ECO375\ECO375 Project\1 - Data\Merge

. 
. * Load collapsed data for regression
. use "HOLC_Voting_Covariates.dta", clear

. drop _merge

. replace _yr_median = _yr_median / 1000
variable _yr_median was long now double
(81,058 real changes made)

. replace male_female_ratio = male_female_ratio / 100
(81,630 real changes made)

. 
. 
. * label dataset
. foreach var of varlist perc_tract_a-perc_tract_d{
  2.         local name = "Grade " + strupper(substr("`var'", 12, 1)) + " share"
  3.         label variable `var' "`name'" 
  4. }

. label variable city "City"

. label variable state "State"

. label variable tract_dvoteshare "Dem share"

. label variable _yr_median "Median income ('000s)"

. label variable median_age "Median age"

. label variable male_female_ratio "M-F ratio"

. label variable perc_less_hs_total "Less HS share"

. label variable perc_hs_total "HS share"

. label variable perc_somecol_total "Some college share"

. label variable perc_bach_total "Bachelor's share"

. label variable perc_pop_white "White share"

. label variable perc_pop_black "Black share"

. label variable perc_pop_asian "Asian share"

. 
. * Generate variable that indicates if a tract has sufficient data for analysis
. gen incl = 0

. replace incl = 1 if tract_dem_total != . & pop_white != . & _yr_median != . & median_age != . & male_female_ratio != . & perc_less_hs_total != . & tract_holc_share > 0.9 & tract_holc_share < 1.05
(6,026 real changes made)

. 
. * Scatter plot
. twoway(scatter tract_dvoteshare perc_tract_d if incl == 1, msize(0.8) xtitle(, size(medlarge)) ytitle(, size(medlarge)))

. graph export "$OUTPUT_PATH\dshare_scatter.png", as(png) replace
file C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output\dshare_scatter.png saved as PNG format

. twoway(scatter tract_dvoteshare perc_tract_c if incl == 1, msize(0.8) xtitle(, size(medlarge)) ytitle(, size(medlarge)))

. graph export "$OUTPUT_PATH\cshare_scatter.png", as(png) replace
file C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output\cshare_scatter.png saved as PNG format

. 
. * Generate summary statistics
. eststo sum_stat: estpost sum perc_tract_a-perc_tract_d tract_dvoteshare _yr_median median_age male_female_ratio perc_less_hs_total-perc_pop_asian if incl == 1

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)     e(min)     e(max)     e(sum) 
-------------+----------------------------------------------------------------------------------------
perc_tract_a |      6026       6026   .0513216   .0326679   .1807426          0          1   309.2637 
perc_tract_b |      6026       6026   .2015847   .1121025    .334817          0          1    1214.75 
perc_tract_c |      6026       6026    .454133   .1774894   .4212949          0          1   2736.605 
perc_tract_d |      6026       6026   .2776713    .161035   .4012917          0          1   1673.247 
tract_dvot~e |      6026       6026   .7908419   .0221765   .1489178   .0415478   .9785084   4765.613 
  _yr_median |      6026       6026    63.3033   1310.938   36.20688      6.322    250.001   381465.7 
  median_age |      6026       6026   36.12061   42.13784   6.491367       10.9       72.4   217662.8 
male_femal~o |      6026       6026   .9592639   .0412585   .2031218       .347      4.103   5780.524 
perc_less_~l |      6026       6026   .1619919   .0138246   .1175782          0   .6462625   976.1634 
perc_hs_to~l |      6026       6026   .2508055   .0139715   .1182012          0   .7152256   1511.354 
perc_somec~l |      6026       6026   .2594869   .0089729   .0947256   .0181473   .8688588   1563.668 
perc_bach_~l |      6026       6026   .3277157   .0536631   .2316529    .007326   .9444444   1974.815 
perc_pop_w~e |      6026       6026   .3986796   .0837374   .2893742    .001224   .9546859   2402.443 
perc_pop_b~k |      6026       6026   .2688388   .0907404   .3012314          0   .9755827   1620.023 
perc_pop_a~n |      6026       6026   .0888438   .0173498   .1317188          0   .9106402    535.373 

. eststo sum_stat_not: estpost sum tract_dvoteshare _yr_median median_age male_female_ratio perc_less_hs_total-perc_pop_asian if incl == 0

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)     e(min)     e(max)     e(sum) 
-------------+----------------------------------------------------------------------------------------
tract_dvot~e |     76150      76150   .5141322   .0426592   .2065411          0          1   39151.17 
  _yr_median |     75032      75032   71.26697   1222.534   34.96475        2.5    250.001    5347303 
  median_age |     75604      75604   40.10454   70.88898   8.419559         10       89.2    3032064 
male_femal~o |     75604      75604   1.274347   275.7291   16.60509       .002     2429.5   96345.75 
perc_less_~l |     75712      75712   .1159134   .0087147   .0933526          0          1   8776.034 
perc_hs_to~l |     75712      75712   .2798682   .0125793   .1121575          0          1   21189.38 
perc_somec~l |     75712      75712   .3096169   .0081872    .090483          0          1   23441.71 
perc_bach_~l |     75712      75712   .2946016    .033827   .1839211          0          1   22304.87 
perc_pop_w~e |     75941      75941   .6533937   .0665953   .2580607          0          1   49619.37 
perc_pop_b~k |     75941      75941   .1212174   .0358684   .1893895          0          1   9205.368 
perc_pop_a~n |     75941      75941   .0532856   .0088424   .0940338          0          1   4046.559 

. 
. esttab sum_stat sum_stat_not using "$OUTPUT_PATH\sum_stat.tex", ///
> cells("count(pattern(1 1) fmt(%8.0f)) mean(fmt(%8.2g) pattern(1 1)) sd(fmt(%8.2g) pattern(1 1)) min(fmt(%8.2g) pattern(1 1)) max(fmt(%8.2g) pattern(1 1))") /// 
> label mtitles("Census tracts in study" "Census tracts not in study") nodepvar nonumbers booktabs replace
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output\sum_stat.tex)

. 
. * Regression
. eststo reg_baseline: regress tract_dvoteshare perc_tract_d if incl == 1, robust

Linear regression                               Number of obs     =      6,026
                                                F(1, 6024)        =     318.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0397
                                                Root MSE          =     .14595

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0739029   .0041403    17.85   0.000     .0657864    .0820194
       _cons |   .7703212   .0024052   320.28   0.000     .7656062    .7750362
------------------------------------------------------------------------------

. esttab reg_baseline using "$OUTPUT_PATH/base_regression.tex", ///
> se star(* 0.10 **       0.05 *** 0.01) replace booktabs label
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/base_regression.tex)

. estadd local city_controls "No"

added macro:
      e(city_controls) : "No"

. estadd local cluster_se "No"

added macro:
         e(cluster_se) : "No"

. 
. 
. * Robustness check -- does changing the tract_holc_share cutoff affect results?
. quietly

. foreach min_perc of numlist 0 5:100 {
  2.         eststo robustness_`min_perc': reg tract_dvoteshare perc_tract_d if tract_holc_share*100 >= `min_perc', robust
  3. }

Linear regression                               Number of obs     =     16,363
                                                F(1, 16361)       =    1483.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0608
                                                Root MSE          =     .15839

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1302126   .0033806    38.52   0.000     .1235862    .1368391
       _cons |   .7172509   .0014744   486.47   0.000      .714361    .7201409
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     14,593
                                                F(1, 14591)       =    1086.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0525
                                                Root MSE          =     .15415

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1130163   .0034288    32.96   0.000     .1062954    .1197371
       _cons |    .729631    .001545   472.25   0.000     .7266026    .7326595
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     14,081
                                                F(1, 14079)       =     985.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0502
                                                Root MSE          =     .15298

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1081631   .0034456    31.39   0.000     .1014093     .114917
       _cons |   .7332124   .0015692   467.27   0.000     .7301367    .7362882
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     13,638
                                                F(1, 13636)       =     914.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0486
                                                Root MSE          =     .15222

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1046589   .0034615    30.24   0.000     .0978739    .1114438
       _cons |   .7360549   .0015935   461.90   0.000     .7329313    .7391785
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     13,228
                                                F(1, 13226)       =     852.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0472
                                                Root MSE          =     .15145

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1014156   .0034739    29.19   0.000     .0946063     .108225
       _cons |   .7388256   .0016153   457.40   0.000     .7356594    .7419917
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     12,825
                                                F(1, 12823)       =     795.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0459
                                                Root MSE          =     .15052

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0982716   .0034851    28.20   0.000     .0914402     .105103
       _cons |    .741394   .0016352   453.40   0.000     .7381888    .7445992
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     12,413
                                                F(1, 12411)       =     739.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0445
                                                Root MSE          =     .14988

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0951203   .0034987    27.19   0.000     .0882623    .1019782
       _cons |   .7440399   .0016599   448.26   0.000     .7407864    .7472935
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     12,010
                                                F(1, 12008)       =     700.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0441
                                                Root MSE          =     .14892

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0930007   .0035126    26.48   0.000     .0861154     .099886
       _cons |   .7462973   .0016843   443.09   0.000     .7429958    .7495988
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     11,582
                                                F(1, 11580)       =     664.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0435
                                                Root MSE          =     .14865

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0910715   .0035324    25.78   0.000     .0841475    .0979955
       _cons |   .7481665   .0017165   435.86   0.000     .7448018    .7515312
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     11,176
                                                F(1, 11174)       =     632.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0430
                                                Root MSE          =     .14845

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0893263   .0035518    25.15   0.000     .0823641    .0962885
       _cons |   .7497548   .0017467   429.23   0.000     .7463309    .7531787
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     10,661
                                                F(1, 10659)       =     597.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0429
                                                Root MSE          =     .14768

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0873752   .0035757    24.44   0.000     .0803662    .0943842
       _cons |   .7523972   .0017829   422.01   0.000     .7489024     .755892
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     10,135
                                                F(1, 10133)       =     555.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0422
                                                Root MSE          =     .14696

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0849367   .0036045    23.56   0.000     .0778713    .0920022
       _cons |   .7553551   .0018276   413.31   0.000     .7517727    .7589374
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      9,666
                                                F(1, 9664)        =     518.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0414
                                                Root MSE          =     .14637

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0827288   .0036342    22.76   0.000      .075605    .0898526
       _cons |   .7572714    .001867   405.61   0.000     .7536117    .7609311
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      9,175
                                                F(1, 9173)        =     491.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0412
                                                Root MSE          =     .14635

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |    .081482   .0036761    22.17   0.000      .074276    .0886881
       _cons |   .7586105   .0019165   395.82   0.000     .7548537    .7623673
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      8,628
                                                F(1, 8626)        =     452.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0404
                                                Root MSE          =     .14653

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0795624   .0037384    21.28   0.000     .0722343    .0868905
       _cons |   .7606502   .0019854   383.13   0.000     .7567584     .764542
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      8,069
                                                F(1, 8067)        =     415.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0396
                                                Root MSE          =     .14666

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0776134   .0038086    20.38   0.000     .0701475    .0850793
       _cons |   .7628806   .0020577   370.75   0.000      .758847    .7669142
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      7,445
                                                F(1, 7443)        =     388.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0398
                                                Root MSE          =     .14624

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0764053   .0038784    19.70   0.000     .0688026     .084008
       _cons |   .7654309   .0021451   356.84   0.000      .761226    .7696358
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      6,755
                                                F(1, 6753)        =     366.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0410
                                                Root MSE          =      .1458

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0759771   .0039661    19.16   0.000     .0682022     .083752
       _cons |   .7674711   .0022587   339.79   0.000     .7630434    .7718989
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      6,084
                                                F(1, 6082)        =     321.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0401
                                                Root MSE          =     .14608

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0741973   .0041352    17.94   0.000     .0660907    .0823038
       _cons |   .7706248   .0023961   321.61   0.000     .7659275     .775322
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,207
                                                F(1, 5205)        =     288.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0409
                                                Root MSE          =     .14601

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0741168    .004364    16.98   0.000     .0655615    .0826721
       _cons |   .7752414   .0025946   298.79   0.000     .7701549    .7803279
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,011
                                                F(1, 3009)        =     174.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0425
                                                Root MSE          =      .1437

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0714881   .0054135    13.21   0.000     .0608735    .0821027
       _cons |   .7857163   .0034408   228.35   0.000     .7789697    .7924629
------------------------------------------------------------------------------

. esttab robustness_* using "$OUTPUT_PATH/min_tract_holc_share_robustness.csv", se star(* 0.10 ** 0.05 *** 0.01) replace
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/min_tract_holc_share_robustness.csv)

. 
. drop _est_robustness*

. 
. * Robustness check -- does changing the way we measure redlining affect results?
. eststo robustness2_d: regress tract_dvoteshare perc_tract_d if incl == 1

      Source |       SS           df       MS      Number of obs   =     6,026
-------------+----------------------------------   F(1, 6024)      =    248.78
       Model |  5.29907482         1  5.29907482   Prob > F        =    0.0000
    Residual |   128.31445     6,024   .02130054   R-squared       =    0.0397
-------------+----------------------------------   Adj R-squared   =    0.0395
       Total |  133.613525     6,025  .022176519   Root MSE        =    .14595

------------------------------------------------------------------------------
tract_dvot~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0739029   .0046855    15.77   0.000     .0647176    .0830882
       _cons |   .7703212   .0022864   336.92   0.000     .7658391    .7748033
------------------------------------------------------------------------------

. gen perc_tract_c_plus_d = perc_tract_c + perc_tract_d
(65,957 missing values generated)

. eststo robustness2_c_plus_d: regress tract_dvoteshare perc_tract_c_plus_d if incl == 1

      Source |       SS           df       MS      Number of obs   =     6,026
-------------+----------------------------------   F(1, 6024)      =    116.09
       Model |   2.5262533         1   2.5262533   Prob > F        =    0.0000
    Residual |  131.087272     6,024  .021760835   R-squared       =    0.0189
-------------+----------------------------------   Adj R-squared   =    0.0187
       Total |  133.613525     6,025  .022176519   Root MSE        =    .14752

-------------------------------------------------------------------------------------
   tract_dvoteshare | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
perc_tract_c_plus_d |   .0534715   .0049627    10.77   0.000     .0437428    .0632003
              _cons |   .7517112   .0040989   183.39   0.000     .7436759    .7597465
-------------------------------------------------------------------------------------

. eststo robustness2_c_and_d: regress tract_dvoteshare perc_tract_c perc_tract_d if incl == 1

      Source |       SS           df       MS      Number of obs   =     6,026
-------------+----------------------------------   F(2, 6023)      =    135.65
       Model |  5.75895195         2  2.87947597   Prob > F        =    0.0000
    Residual |  127.854573     6,023  .021227723   R-squared       =    0.0431
-------------+----------------------------------   Adj R-squared   =    0.0428
       Total |  133.613525     6,025  .022176519   Root MSE        =     .1457

------------------------------------------------------------------------------
tract_dvot~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_c |   .0251855    .005411     4.65   0.000     .0145779     .035793
perc_tract_d |   .0889074   .0056808    15.65   0.000     .0777711    .1000437
       _cons |   .7547173   .0040557   186.09   0.000     .7467667    .7626679
------------------------------------------------------------------------------

. eststo robustness2_b_c_d: regress tract_dvoteshare perc_tract_a perc_tract_c perc_tract_d if incl == 1

      Source |       SS           df       MS      Number of obs   =     6,026
-------------+----------------------------------   F(3, 6022)      =     90.84
       Model |  5.78446969         3  1.92815656   Prob > F        =    0.0000
    Residual |  127.829055     6,022   .02122701   R-squared       =    0.0433
-------------+----------------------------------   Adj R-squared   =    0.0428
       Total |  133.613525     6,025  .022176519   Root MSE        =    .14569

------------------------------------------------------------------------------
tract_dvot~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_a |  -.0129803   .0118388    -1.10   0.273    -.0361885     .010228
perc_tract_c |   .0221873   .0060627     3.66   0.000     .0103023    .0340723
perc_tract_d |   .0860432   .0062526    13.76   0.000     .0737859    .0983004
       _cons |   .7575403   .0048039   157.69   0.000      .748123    .7669577
------------------------------------------------------------------------------

. 
. esttab robustness2_* using "$OUTPUT_PATH/redlining_measure_robustness.csv", se star(* 0.10 ** 0.05 *** 0.01) replace
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/redlining_measure_robustness.csv)

. 
. noisily

. * Regression with selected covariates
. regress tract_dvoteshare perc_tract_d _yr_median perc_pop_white perc_pop_black ///
> perc_pop_asian if incl == 1, robust

Linear regression                               Number of obs     =      6,026
                                                F(5, 6020)        =    1451.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4373
                                                Root MSE          =     .11176

--------------------------------------------------------------------------------
               |               Robust
tract_dvotes~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
  perc_tract_d |   .0381437   .0031416    12.14   0.000     .0319851    .0443024
    _yr_median |   .0012724   .0000606    20.99   0.000     .0011535    .0013912
perc_pop_white |  -.2083987   .0083666   -24.91   0.000    -.2248003   -.1919972
perc_pop_black |   .1868163   .0043499    42.95   0.000     .1782888    .1953437
perc_pop_asian |  -.1567524   .0115021   -13.63   0.000    -.1793007   -.1342041
         _cons |    .746491   .0042465   175.79   0.000     .7381664    .7548156
--------------------------------------------------------------------------------

. 
. * Regression with selected covariates and city fixed effects
. encode city, generate(city2)

. gen perc_tract_d_sq = perc_tract_d^2
(65,957 missing values generated)

. gen perc_tract_d_cu = perc_tract_d^3
(65,957 missing values generated)

. label variable perc_tract_d_sq "Grade D squared"

. label variable perc_tract_d_cu "Grade D cubed"

. 
. gen perc_tract_c_sq = perc_tract_c^2
(65,957 missing values generated)

. gen perc_tract_c_cu = perc_tract_c^3
(65,957 missing values generated)

. label variable perc_tract_c_sq "Grade C squared"

. label variable perc_tract_c_cu "Grade C cubed"

. 
. drop perc_tract_c_plus_d

. global indep_vars perc_tract_d* perc_tract_c*

. 
. global controls _yr_median-male_female_ratio perc_hs_total-perc_pop_asian

. 
. #delimit ;
delimiter now ;
. eststo reg_baseline_clust: regress tract_dvoteshare perc_tract_d i.city2
> if incl == 1, cluster(city2);

Linear regression                               Number of obs     =      6,026
                                                F(0, 165)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2810
                                                Root MSE          =     .12805

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |   .0670574    .022005     3.05   0.003     .0236098    .1105051
                                  |
                            city2 |
                          Albany  |   .1365996   .0033273    41.05   0.000       .13003    .1431691
                         Altoona  |  -.3130596   .0017527  -178.62   0.000    -.3165202   -.3095991
                        Amarillo  |  -.3129843   .0037785   -82.83   0.000    -.3204447   -.3055239
                       Arlington  |   .1691521   .0013939   121.35   0.000        .1664    .1719042
                         Atlanta  |    .164516    .007074    23.26   0.000     .1505487    .1784832
                   Atlantic City  |   .1212512   .0109523    11.07   0.000     .0996264     .142876
                         Augusta  |   .2198603   .0205021    10.72   0.000     .1793802    .2603405
                          Aurora  |   .1017224   .0090388    11.25   0.000     .0838758    .1195691
                          Austin  |   .1393881   .0065312    21.34   0.000     .1264926    .1522837
                       Baltimore  |   .2155073   .0076039    28.34   0.000     .2004939    .2305207
                        Bay City  |   -.122137   .0094168   -12.97   0.000    -.1407298   -.1035441
                        Beaumont  |   .2189684   .0013939   157.09   0.000     .2162162    .2217205
                         Belmont  |   .1286268   .0013939    92.28   0.000     .1258747    .1313789
                      Bergen Co.  |  -.0198289   .0010814   -18.34   0.000    -.0219641   -.0176936
                      Birmingham  |   .1682348   .0091762    18.33   0.000     .1501169    .1863526
                          Boston  |   .1712256   .0062785    27.27   0.000     .1588292    .1836221
                        Brockton  |   .1603008   .0013939   115.00   0.000     .1575487     .163053
                           Bronx  |   .1432747    .004578    31.30   0.000     .1342358    .1523137
                       Brookline  |   .2117357   .0013938   151.92   0.000     .2089838    .2144876
                        Brooklyn  |   .0353208   .0063427     5.57   0.000     .0227974    .0478442
                         Buffalo  |   .1385885   .0009507   145.78   0.000     .1367114    .1404656
                       Cambridge  |   .1992435    .007093    28.09   0.000     .1852387    .2132483
                          Camden  |   .0177245   .0013847    12.80   0.000     .0149904    .0204586
                          Canton  |   .0038845   .0002055    18.90   0.000     .0034787    .0042902
                       Charlotte  |   .0559785   .0061356     9.12   0.000      .043864    .0680929
                     Chattanooga  |   .0535535   .0002484   215.59   0.000     .0530631     .054044
                         Chelsea  |   .0951556   .0081111    11.73   0.000     .0791405    .1111706
                         Chicago  |   .1779808   .0053107    33.51   0.000     .1674951    .1884664
                       Cleveland  |   .1287484   .0020733    62.10   0.000     .1246548     .132842
                        Columbia  |   .0544498   .0065169     8.36   0.000     .0415826     .067317
                        Columbus  |   .1216005   .0019106    63.65   0.000     .1178282    .1253728
                  Council Bluffs  |  -.2058972   .0081366   -25.30   0.000    -.2219625   -.1898319
                          Dallas  |   .0445048   .0003067   145.10   0.000     .0438991    .0451104
                       Davenport  |  -.0650237   .0015945   -40.78   0.000     -.068172   -.0618754
                          Dayton  |   .0238557   .0007612    31.34   0.000     .0223528    .0253586
                         Decatur  |   .0114171   .0020308     5.62   0.000     .0074074    .0154267
                          Denver  |   .1664608   .0047045    35.38   0.000      .157172    .1757495
                      Des Moines  |   .0060832   .0049163     1.24   0.218    -.0036238    .0157902
                         Detroit  |   .1398047   .0044431    31.47   0.000     .1310321    .1485774
                         Dubuque  |  -.0829809    .000705  -117.71   0.000    -.0843728    -.081589
                          Duluth  |   .1007203   .0007391   136.28   0.000     .0992611    .1021796
                          Durham  |   .2153151   .0124095    17.35   0.000     .1908132    .2398171
                  East St. Louis  |    .265981   .0072335    36.77   0.000     .2516988    .2802631
                         El Paso  |   .0688942   .0035873    19.20   0.000     .0618112    .0759771
                          Elmira  |  -.1073727   .0000291 -3689.58   0.000    -.1074301   -.1073152
                            Erie  |  -.0046301   .0005273    -8.78   0.000    -.0056712    -.003589
                       Essex Co.  |   .1714023   .0043932    39.02   0.000     .1627281    .1800764
                      Evansville  |  -.0384633   .0019637   -19.59   0.000    -.0423405   -.0345861
                         Everett  |   .0191305   .0041293     4.63   0.000     .0109774    .0272836
                           Flint  |   .2857021   .0013879   205.86   0.000     .2829618    .2884423
                      Fort Wayne  |   .0063727   .0013939     4.57   0.000     .0036206    .0091248
                      Fort Worth  |   .0443946   .0052322     8.48   0.000     .0340638    .0547253
                          Fresno  |   .0675533   .0007451    90.67   0.000     .0660822    .0690244
                       Galveston  |  -.0109377   .0022327    -4.90   0.000     -.015346   -.0065294
                    Grand Rapids  |   .0515571   .0007269    70.93   0.000     .0501219    .0529923
             Greater Kansas City  |   .1258924   .0090108    13.97   0.000     .1081011    .1436837
                      Greensboro  |   .1748903    .000281   622.30   0.000     .1743354    .1754452
                      Harrisburg  |   .1806706    .004662    38.75   0.000     .1714658    .1898755
                        Hartford  |   .1948145   .0003645   534.48   0.000     .1940948    .1955342
                Holyoke Chicopee  |  -.0397246    .000821   -48.39   0.000    -.0413455   -.0381037
                         Houston  |   .1103394   .0036812    29.97   0.000      .103071    .1176077
                      Hudson Co.  |   .0451394   .0087363     5.17   0.000       .02789    .0623888
                    Indianapolis  |   .0536184   .0042363    12.66   0.000      .045254    .0619828
                         Jackson  |  -.0307241   .0044798    -6.86   0.000    -.0395692    -.021879
                    Jacksonville  |   .0671227   .0080882     8.30   0.000     .0511531    .0830923
                       Johnstown  |  -.2450274   .0036287   -67.52   0.000    -.2521921   -.2378627
                          Joliet  |   .0027545   .0002263    12.17   0.000     .0023078    .0032013
                         Kenosha  |  -.1373664   .0049635   -27.68   0.000    -.1471665   -.1275663
                       Knoxville  |  -.0026578   .0082788    -0.32   0.749    -.0190038    .0136882
                   Lake Co. Gary  |   .2194955   .0013939   157.47   0.000     .2167434    .2222476
                         Lansing  |   .0688018   .0002137   321.89   0.000     .0683798    .0692239
                            Lima  |  -.1310263    .001259  -104.07   0.000    -.1335121   -.1285405
                         Lincoln  |  -.0085987    .000244   -35.24   0.000    -.0090805   -.0081169
                     Little Rock  |    .212421    .001882   112.87   0.000     .2087051    .2161369
                     Los Angeles  |   .1151634    .004354    26.45   0.000     .1065667    .1237601
           Lower Westchester Co.  |   .0141691   .0000718   197.48   0.000     .0140274    .0143108
                           Macon  |   .0870899   .0190032     4.58   0.000      .049569    .1246107
                         Madison  |   .1744979   .0023093    75.56   0.000     .1699382    .1790575
                          Malden  |   .0165828    .011236     1.48   0.142    -.0056022    .0387677
                      Manchester  |  -.0908219   .0027753   -32.72   0.000    -.0963017   -.0853421
                       Manhattan  |   .1610406   .0118334    13.61   0.000     .1376763     .184405
                         Medford  |   .0429745   .0011857    36.24   0.000     .0406334    .0453156
                         Melrose  |   .0523288   .0013939    37.54   0.000     .0495767     .055081
                         Memphis  |   .1577915   .0077613    20.33   0.000     .1424673    .1731158
                           Miami  |  -.0572947   .0035485   -16.15   0.000     -.064301   -.0502884
                   Milwaukee Co.  |   .1389651   .0059716    23.27   0.000     .1271745    .1507558
                     Minneapolis  |   .2050877   .0013523   151.66   0.000     .2024176    .2077578
                          Mobile  |  -.0322734   .0065626    -4.92   0.000    -.0452309   -.0193158
                      Montgomery  |   .0560941    .009792     5.73   0.000     .0367603    .0754279
                        Muskegon  |   .2265199   .0134746    16.81   0.000     .1999151    .2531248
                       Nashville  |   .0268161   .0096919     2.77   0.006     .0076799    .0459523
                     New Britain  |   .0192139   .0005293    36.30   0.000     .0181687     .020259
                      New Castle  |  -.1625832   .0012174  -133.55   0.000    -.1649868   -.1601795
                       New Haven  |   .0193817   .0011898    16.29   0.000     .0170325    .0217308
                     New Orleans  |   .1667347   .0097379    17.12   0.000     .1475078    .1859616
                          Newton  |   .1563474   .0013939   112.17   0.000     .1535953    .1590995
                   Niagara Falls  |   .0292991   .0012441    23.55   0.000     .0268428    .0317555
                         Norfolk  |   .1324356   .0090088    14.70   0.000     .1146482    .1502229
                         Oakland  |    .226322   .0040251    56.23   0.000     .2183747    .2342692
                           Ogden  |  -.1324123   .0039113   -33.85   0.000     -.140135   -.1246896
                   Oklahoma City  |   .0186295   .0017192    10.84   0.000      .015235     .022024
                           Omaha  |   .0434162   .0002661   163.14   0.000     .0428907    .0439417
                         Oshkosh  |  -.1190533   .0159364    -7.47   0.000    -.1505187   -.0875878
       Pawtucket & Central Falls  |   .0200181   .0013939    14.36   0.000      .017266    .0227702
                          Peoria  |   .1169591   .0077851    15.02   0.000     .1015877    .1323304
                    Philadelphia  |   .1663839   .0073309    22.70   0.000     .1519096    .1808583
                         Phoenix  |   .1070521   .0031096    34.43   0.000     .1009124    .1131919
                      Pittsburgh  |   .1143397   .0041192    27.76   0.000     .1062066    .1224727
                         Pontiac  |    .170202   .0025648    66.36   0.000     .1651379    .1752661
                     Port Arthur  |   .1095667   .0013939    78.61   0.000     .1068146    .1123188
                        Portland  |   .2112536   .0033395    63.26   0.000     .2046599    .2178473
                    Poughkeepsie  |    .092141   .0009617    95.81   0.000     .0902421    .0940399
                      Providence  |   .1155183   .0005579   207.07   0.000     .1144169    .1166198
                          Pueblo  |  -.0350503   .0001935  -181.11   0.000    -.0354324   -.0346682
                          Queens  |    .086526   .0019261    44.92   0.000     .0827231    .0903289
                          Quincy  |   .0026491   .0006363     4.16   0.000     .0013928    .0039053
                          Racine  |  -.0559434   .0001856  -301.47   0.000    -.0563098    -.055577
                          Revere  |  -.0066194   .0070364    -0.94   0.348    -.0205123    .0072735
                        Richmond  |   .0900636   .0013714    65.67   0.000     .0873557    .0927714
                       Rochester  |   .1664591   .0044722    37.22   0.000      .157629    .1752891
                        Rockford  |  -.0268339   .0062509    -4.29   0.000     -.039176   -.0144917
                      Sacramento  |   .1466704   .0002366   619.99   0.000     .1462033    .1471375
                         Saginaw  |   .0694375    .000168   413.22   0.000     .0691057    .0697692
                  Salt Lake City  |   .0955078   .0046852    20.39   0.000     .0862571    .1047584
                     San Antonio  |   .0780323   .0063498    12.29   0.000      .065495    .0905695
                       San Diego  |   .0884913   .0072436    12.22   0.000     .0741893    .1027934
                   San Francisco  |    .162362   .0059094    27.48   0.000     .1506942    .1740299
                        San Jose  |   .1216789   .0038568    31.55   0.000      .114064    .1292939
                        Savannah  |   .2208906   .0009841   224.46   0.000     .2189475    .2228336
                     Schenectady  |  -.1146449   .0004542  -252.39   0.000    -.1155417    -.113748
                         Seattle  |   .2175398   .0027185    80.02   0.000     .2121724    .2229073
                      Shreveport  |   .1001452   .0025666    39.02   0.000     .0950776    .1052128
                      Sioux City  |  -.1707616   .0053386   -31.99   0.000    -.1813024   -.1602209
                      Somerville  |   .2179717   .0013939   156.38   0.000     .2152196    .2207238
                      South Bend  |   .0410363   .0012953    31.68   0.000     .0384787    .0435939
                         Spokane  |  -.0803737   .0019788   -40.62   0.000    -.0842808   -.0764667
                     Springfield  |  -.0068735   .0082868    -0.83   0.408    -.0232354    .0094884
                      St. Joseph  |  -.1777677   .0196686    -9.04   0.000    -.2166022   -.1389332
                       St. Louis  |   .1923121   .0019566    98.29   0.000     .1884488    .1961754
                        St. Paul  |   .1449208   .0030339    47.77   0.000     .1389306     .150911
                  St. Petersburg  |   .0872213   .0054267    16.07   0.000     .0765066    .0979361
Stamford, Darien, and New Canaan  |   .0516461   .0028802    17.93   0.000     .0459594    .0573329
                   Staten Island  |  -.1325643   .0067013   -19.78   0.000    -.1457957   -.1193329
                        Stockton  |   .0537215   .0013939    38.54   0.000     .0509694    .0564737
                        Syracuse  |   .0610076   .0005576   109.40   0.000     .0599066    .0621086
                          Tacoma  |   .0159563   .0054403     2.93   0.004     .0052148    .0266978
                           Tampa  |   .0289349   .0120651     2.40   0.018     .0051131    .0527568
                     Terre Haute  |  -.0761144    .005608   -13.57   0.000    -.0871872   -.0650416
                          Toledo  |   .0721705   .0006144   117.47   0.000     .0709574    .0733836
                          Topeka  |  -.0291302   .0021445   -13.58   0.000    -.0333645    -.024896
                         Trenton  |   .1504654   .0009942   151.35   0.000     .1485025    .1524284
                           Tulsa  |   .0114532   .0042032     2.72   0.007     .0031542    .0197522
                       Union Co.  |   .0624547   .0014501    43.07   0.000     .0595915    .0653179
                           Utica  |  -.0633344   .0020196   -31.36   0.000    -.0673221   -.0593467
                            Waco  |   .0339059   .0001925   176.12   0.000     .0335258     .034286
                          Warren  |  -.0600098   .0013939   -43.05   0.000    -.0627619   -.0572577
                       Waterbury  |   .0396855   .0031486    12.60   0.000     .0334688    .0459022
                        Waterloo  |  -.0024373   .0062659    -0.39   0.698     -.014809    .0099344
                       Watertown  |   .0943083   .0013939    67.66   0.000     .0915562    .0970604
                         Wichita  |  -.0609943    .012624    -4.83   0.000    -.0859197   -.0360688
                    Wilkes-Barre  |  -.0803401   .0013939   -57.64   0.000    -.0830922    -.077588
                   Winston-Salem  |   .1913494   .0081125    23.59   0.000     .1753317    .2073672
                      Woonsocket  |  -.1209936   .0017194   -70.37   0.000    -.1243885   -.1175987
                            York  |    .056177    .005458    10.29   0.000     .0454004    .0669536
                      Youngstown  |   .0598827   .0043986    13.61   0.000     .0511979    .0685676
                                  |
                            _cons |   .6632977   .0013939   475.87   0.000     .6605456    .6660498
---------------------------------------------------------------------------------------------------

.  eststo reg_base_c_d: regress tract_dvoteshare perc_tract_d perc_tract_c
> i.city2 if incl == 1, cluster(city2);

Linear regression                               Number of obs     =      6,026
                                                F(1, 165)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2831
                                                Root MSE          =     .12787

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |   .0803516   .0178641     4.50   0.000       .04508    .1156233
                     perc_tract_c |   .0222173   .0114498     1.94   0.054    -.0003896    .0448243
                                  |
                            city2 |
                          Albany  |   .1397589   .0045283    30.86   0.000      .130818    .1486998
                         Altoona  |  -.3177146   .0017943  -177.07   0.000    -.3212573   -.3141718
                        Amarillo  |  -.3046322   .0073298   -41.56   0.000    -.3191045   -.2901599
                       Arlington  |   .1761391    .002875    61.27   0.000     .1704626    .1818156
                         Atlanta  |   .1614598   .0060361    26.75   0.000     .1495419    .1733778
                   Atlantic City  |   .1173564   .0095717    12.26   0.000     .0984576    .1362551
                         Augusta  |   .2190935    .019938    10.99   0.000     .1797269      .25846
                          Aurora  |   .1020932   .0090336    11.30   0.000     .0842569    .1199296
                          Austin  |   .1462617   .0091821    15.93   0.000     .1281321    .1643914
                       Baltimore  |   .2151978   .0073862    29.13   0.000     .2006141    .2297816
                        Bay City  |  -.1231953   .0089236   -13.81   0.000    -.1408146   -.1055761
                        Beaumont  |   .2283257   .0040399    56.52   0.000     .2203491    .2363022
                         Belmont  |   .1307263   .0010381   125.93   0.000     .1286767     .132776
                      Bergen Co.  |  -.0218142   .0008545   -25.53   0.000    -.0235014   -.0201271
                      Birmingham  |   .1666932   .0085321    19.54   0.000     .1498471    .1835394
                          Boston  |     .16643      .0049    33.97   0.000     .1567553    .1761047
                        Brockton  |   .1550932   .0037413    41.45   0.000     .1477063    .1624801
                           Bronx  |    .140103   .0036326    38.57   0.000     .1329307    .1472753
                       Brookline  |   .2077469   .0031418    66.12   0.000     .2015435    .2139502
                        Brooklyn  |   .0348491   .0060898     5.72   0.000     .0228251     .046873
                         Buffalo  |   .1424335    .001527    93.28   0.000     .1394185    .1454485
                       Cambridge  |   .1954652    .005874    33.28   0.000     .1838674    .2070631
                          Camden  |   .0203978   .0011207    18.20   0.000     .0181851    .0226106
                          Canton  |   .0076507   .0020813     3.68   0.000     .0035414      .01176
                       Charlotte  |    .055573   .0059078     9.41   0.000     .0439083    .0672377
                     Chattanooga  |   .0537668   .0001901   282.78   0.000     .0533914    .0541422
                         Chelsea  |   .0894399   .0064177    13.94   0.000     .0767686    .1021112
                         Chicago  |   .1733806    .004059    42.71   0.000     .1653663    .1813949
                       Cleveland  |   .1301241   .0025698    50.64   0.000     .1250502    .1351981
                        Columbia  |   .0563019    .007092     7.94   0.000     .0422992    .0703046
                        Columbus  |   .1221186   .0020697    59.00   0.000      .118032    .1262052
                  Council Bluffs  |  -.2016495   .0096138   -20.97   0.000    -.2206315   -.1826675
                          Dallas  |   .0428791   .0010632    40.33   0.000     .0407799    .0449783
                       Davenport  |  -.0685464   .0014019   -48.90   0.000    -.0713143   -.0657784
                          Dayton  |   .0303442    .002899    10.47   0.000     .0246204    .0360681
                         Decatur  |   .0096372   .0015492     6.22   0.000     .0065783     .012696
                          Denver  |   .1619336   .0035389    45.76   0.000     .1549463    .1689209
                      Des Moines  |   .0064304   .0049646     1.30   0.197     -.003372    .0162328
                         Detroit  |   .1374038   .0036714    37.43   0.000     .1301548    .1446527
                         Dubuque  |  -.0734434   .0054026   -13.59   0.000    -.0841105   -.0627762
                          Duluth  |   .1041384   .0023112    45.06   0.000     .0995751    .1087017
                          Durham  |   .2117966   .0111013    19.08   0.000     .1898777    .2337155
                  East St. Louis  |   .2656567   .0070164    37.86   0.000     .2518032    .2795102
                         El Paso  |   .0728735   .0051332    14.20   0.000     .0627382    .0830088
                          Elmira  |   -.104126   .0016542   -62.95   0.000    -.1073922   -.1008599
                            Erie  |  -.0005126   .0018178    -0.28   0.778    -.0041018    .0030766
                       Essex Co.  |   .1712233   .0042674    40.12   0.000     .1627975    .1796491
                      Evansville  |  -.0401757   .0014993   -26.80   0.000    -.0431359   -.0372155
                         Everett  |   .0118892   .0032027     3.71   0.000     .0055658    .0182127
                           Flint  |   .2861592   .0012231   233.95   0.000     .2837442    .2885743
                      Fort Wayne  |    .006604   .0012969     5.09   0.000     .0040433    .0091647
                      Fort Worth  |    .048587   .0067879     7.16   0.000     .0351848    .0619893
                          Fresno  |   .0626042   .0021332    29.35   0.000     .0583923    .0668161
                       Galveston  |  -.0016824   .0064469    -0.26   0.794    -.0144115    .0110468
                    Grand Rapids  |     .04863   .0011618    41.86   0.000     .0463362    .0509238
             Greater Kansas City  |   .1227589   .0078947    15.55   0.000     .1071713    .1383466
                      Greensboro  |   .1771778   .0010157   174.44   0.000     .1751724    .1791833
                      Harrisburg  |   .1879655   .0076307    24.63   0.000     .1728991     .203032
                        Hartford  |   .1950689   .0002889   675.32   0.000     .1944986    .1956393
                Holyoke Chicopee  |  -.0429498   .0012753   -33.68   0.000    -.0454678   -.0404318
                         Houston  |   .1167611   .0063318    18.44   0.000     .1042592    .1292629
                      Hudson Co.  |   .0409966   .0073598     5.57   0.000      .026465    .0555282
                    Indianapolis  |   .0506998   .0033647    15.07   0.000     .0440564    .0573431
                         Jackson  |  -.0299842   .0046762    -6.41   0.000    -.0392171   -.0207514
                    Jacksonville  |   .0687821   .0085619     8.03   0.000     .0518771    .0856871
                       Johnstown  |  -.2520514   .0029408   -85.71   0.000    -.2578579   -.2462449
                          Joliet  |   .0078822    .002796     2.82   0.005     .0023617    .0134026
                         Kenosha  |  -.1440122    .003652   -39.43   0.000    -.1512228   -.1368016
                       Knoxville  |  -.0069279   .0068894    -1.01   0.316    -.0205307    .0066748
                   Lake Co. Gary  |   .2117593   .0050073    42.29   0.000     .2018726     .221646
                         Lansing  |   .0645308   .0020668    31.22   0.000       .06045    .0686117
                            Lima  |  -.1287248   .0009929  -129.64   0.000    -.1306853   -.1267643
                         Lincoln  |  -.0056949   .0013484    -4.22   0.000    -.0083572   -.0030326
                     Little Rock  |   .2116575    .001619   130.73   0.000     .2084609    .2148541
                     Los Angeles  |   .1116918   .0033735    33.11   0.000      .105031    .1183525
           Lower Westchester Co.  |   .0211073    .003529     5.98   0.000     .0141396    .0280751
                           Macon  |   .0864375   .0185002     4.67   0.000       .04991    .1229651
                         Madison  |   .1708974   .0017311    98.72   0.000     .1674794    .1743154
                          Malden  |   .0120698   .0096779     1.25   0.214    -.0070388    .0311783
                      Manchester  |  -.0954221   .0021127   -45.17   0.000    -.0995935   -.0912508
                       Manhattan  |   .1634393   .0125157    13.06   0.000     .1387278    .1881509
                         Medford  |   .0362475   .0028265    12.82   0.000     .0306666    .0418284
                         Melrose  |   .0555192   .0012578    44.14   0.000     .0530358    .0580026
                         Memphis  |   .1575357   .0075594    20.84   0.000       .14261    .1724613
                           Miami  |  -.0568646   .0036474   -15.59   0.000    -.0640662    -.049663
                   Milwaukee Co.  |   .1367105   .0051826    26.38   0.000     .1264777    .1469432
                     Minneapolis  |   .2085114   .0028318    73.63   0.000     .2029201    .2141027
                          Mobile  |  -.0359382   .0053951    -6.66   0.000    -.0465906   -.0252857
                      Montgomery  |   .0545219   .0091278     5.97   0.000     .0364997    .0725442
                        Muskegon  |   .2267153   .0133427    16.99   0.000     .2003709    .2530598
                       Nashville  |   .0289465   .0103124     2.81   0.006     .0085852    .0493077
                     New Britain  |   .0200947   .0008907    22.56   0.000     .0183361    .0218533
                      New Castle  |  -.1703353   .0048766   -34.93   0.000    -.1799638   -.1607068
                       New Haven  |   .0198526   .0010267    19.34   0.000     .0178255    .0218797
                     New Orleans  |   .1641381   .0087599    18.74   0.000     .1468422    .1814341
                          Newton  |   .1571593   .0011382   138.07   0.000     .1549119    .1594068
                   Niagara Falls  |   .0349096   .0022677    15.39   0.000     .0304322     .039387
                         Norfolk  |   .1305735   .0082677    15.79   0.000     .1142495    .1468976
                         Oakland  |   .2277356   .0044838    50.79   0.000     .2188827    .2365886
                           Ogden  |  -.1302102   .0046863   -27.79   0.000    -.1394631   -.1209574
                   Oklahoma City  |   .0199577   .0022094     9.03   0.000     .0155953    .0243201
                           Omaha  |   .0521888   .0043508    12.00   0.000     .0435984    .0607792
                         Oshkosh  |  -.1200674   .0153577    -7.82   0.000    -.1503904   -.0897444
       Pawtucket & Central Falls  |   .0274089   .0030703     8.93   0.000     .0213467    .0334711
                          Peoria  |   .1126448   .0064078    17.58   0.000     .0999928    .1252967
                    Philadelphia  |   .1691256   .0082312    20.55   0.000     .1528736    .1853776
                         Phoenix  |   .1151802    .006635    17.36   0.000     .1020797    .1282808
                      Pittsburgh  |   .1157053   .0045573    25.39   0.000     .1067072    .1247033
                         Pontiac  |   .1745124   .0043354    40.25   0.000     .1659523    .1830724
                     Port Arthur  |   .1220282    .005602    21.78   0.000     .1109673     .133089
                        Portland  |   .2113334   .0033177    63.70   0.000     .2047828     .217884
                    Poughkeepsie  |   .1002238   .0036045    27.81   0.000     .0931069    .1073407
                      Providence  |   .1138032   .0013155    86.51   0.000     .1112059    .1164005
                          Pueblo  |  -.0266273   .0042162    -6.32   0.000     -.034952   -.0183026
                          Queens  |    .079604   .0027038    29.44   0.000     .0742655    .0849426
                          Quincy  |  -.0028278   .0024501    -1.15   0.250    -.0076655    .0020098
                          Racine  |  -.0565103   .0002182  -258.93   0.000    -.0569412   -.0560794
                          Revere  |  -.0128728   .0053562    -2.40   0.017    -.0234482   -.0022973
                        Richmond  |   .0919597    .001011    90.96   0.000     .0899636    .0939558
                       Rochester  |   .1621251   .0033608    48.24   0.000     .1554893    .1687608
                        Rockford  |   -.031092   .0049743    -6.25   0.000    -.0409135   -.0212706
                      Sacramento  |   .1405604   .0033086    42.48   0.000     .1340277     .147093
                         Saginaw  |   .0650281   .0023858    27.26   0.000     .0603174    .0697388
                  Salt Lake City  |   .0987066   .0058446    16.89   0.000     .0871668    .1102464
                     San Antonio  |    .078631   .0064655    12.16   0.000     .0658652    .0913967
                       San Diego  |    .086021     .00636    13.53   0.000     .0734635    .0985786
                   San Francisco  |   .1633553   .0061748    26.46   0.000     .1511635     .175547
                        San Jose  |   .1207163   .0034891    34.60   0.000     .1138273    .1276053
                        Savannah  |   .2216112   .0007736   286.48   0.000     .2200839    .2231386
                     Schenectady  |  -.1229428   .0045866   -26.80   0.000    -.1319988   -.1138869
                         Seattle  |    .220179   .0037249    59.11   0.000     .2128244    .2275336
                      Shreveport  |   .0977223    .001936    50.48   0.000     .0938998    .1015448
                      Sioux City  |  -.1688011   .0059802   -28.23   0.000    -.1806087   -.1569935
                      Somerville  |   .2134427   .0034063    62.66   0.000     .2067172    .2201681
                      South Bend  |   .0418898   .0010366    40.41   0.000     .0398431    .0439365
                         Spokane  |   -.083167   .0014613   -56.91   0.000    -.0860522   -.0802818
                     Springfield  |   -.006648   .0082422    -0.81   0.421    -.0229218    .0096257
                      St. Joseph  |   -.178031   .0192877    -9.23   0.000    -.2161136   -.1399484
                       St. Louis  |    .196387   .0036767    53.41   0.000     .1891276    .2036464
                        St. Paul  |   .1474864   .0039933    36.93   0.000     .1396019    .1553709
                  St. Petersburg  |   .0861872   .0050074    17.21   0.000     .0763003    .0960741
Stamford, Darien, and New Canaan  |   .0554071   .0043742    12.67   0.000     .0467704    .0640437
                   Staten Island  |  -.1355775   .0056874   -23.84   0.000     -.146807    -.124348
                        Stockton  |   .0598006   .0024435    24.47   0.000      .054976    .0646251
                        Syracuse  |   .0625485   .0005928   105.52   0.000     .0613781    .0637189
                          Tacoma  |   .0118129   .0042479     2.78   0.006     .0034257    .0202002
                           Tampa  |   .0293785   .0120402     2.44   0.016     .0056058    .0531512
                     Terre Haute  |  -.0821028   .0041643   -19.72   0.000     -.090325   -.0738806
                          Toledo  |   .0754829     .00138    54.70   0.000     .0727583    .0782076
                          Topeka  |  -.0252782   .0037404    -6.76   0.000    -.0326635   -.0178929
                         Trenton  |   .1486592   .0017436    85.26   0.000     .1452166    .1521019
                           Tulsa  |   .0155051   .0057468     2.70   0.008     .0041583    .0268518
                       Union Co.  |   .0627961   .0015514    40.48   0.000     .0597329    .0658592
                           Utica  |  -.0654027   .0015069   -43.40   0.000    -.0683779   -.0624275
                            Waco  |   .0375644   .0020167    18.63   0.000     .0335826    .0415462
                          Warren  |  -.0517784   .0034817   -14.87   0.000    -.0586528    -.044904
                       Waterbury  |   .0370982   .0024273    15.28   0.000     .0323057    .0418908
                        Waterloo  |   .0003229   .0071992     0.04   0.964    -.0138916    .0145374
                       Watertown  |   .0849855   .0058101    14.63   0.000     .0735139    .0964572
                         Wichita  |  -.0596591   .0129059    -4.62   0.000     -.085141   -.0341772
                    Wilkes-Barre  |  -.0678786    .005602   -12.12   0.000    -.0789395   -.0568178
                   Winston-Salem  |   .1887663   .0071752    26.31   0.000     .1745993    .2029333
                      Woonsocket  |   -.117624    .003131   -37.57   0.000     -.123806    -.111442
                            York  |    .051306    .004152    12.36   0.000      .043108    .0595039
                      Youngstown  |   .0589885   .0040414    14.60   0.000     .0510091     .066968
                                  |
                            _cons |   .6508363    .005602   116.18   0.000     .6397754    .6618972
---------------------------------------------------------------------------------------------------

. eststo reg_all_cov_lin: regress tract_dvoteshare perc_tract_d perc_tract_c 
> $controls i.city2 
> if incl == 1, cluster(city2);

Linear regression                               Number of obs     =      6,026
                                                F(10, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7494
                                                Root MSE          =     .07565

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |   .0312474   .0181959     1.72   0.088    -.0046794    .0671743
                     perc_tract_c |   .0154344   .0095318     1.62   0.107    -.0033855    .0342544
                       _yr_median |  -.0000227   .0002617    -0.09   0.931    -.0005393     .000494
                       median_age |  -.0018218   .0005512    -3.31   0.001    -.0029102   -.0007334
                male_female_ratio |   .0124751    .012639     0.99   0.325      -.01248    .0374302
                    perc_hs_total |  -.1157813   .0369861    -3.13   0.002    -.1888082   -.0427543
               perc_somecol_total |   .0849478   .0828969     1.02   0.307    -.0787276    .2486233
                  perc_bach_total |   .4629688   .1149631     4.03   0.000     .2359805    .6899572
                   perc_pop_white |  -.5288009   .1489596    -3.55   0.001    -.8229136   -.2346882
                   perc_pop_black |   .0556247   .0673823     0.83   0.410    -.0774179    .1886674
                   perc_pop_asian |  -.3273401   .0625682    -5.23   0.000    -.4508776   -.2038026
                                  |
                            city2 |
                          Albany  |   -.020343   .0373055    -0.55   0.586    -.0940006    .0533147
                         Altoona  |  -.1453086   .0217827    -6.67   0.000    -.1883174   -.1022997
                        Amarillo  |  -.2855496   .0102042   -27.98   0.000    -.3056974   -.2654019
                       Arlington  |    .058635   .0483454     1.21   0.227    -.0368203    .1540902
                         Atlanta  |  -.1043787   .0553246    -1.89   0.061    -.2136142    .0048567
                   Atlantic City  |  -.0994465   .0553844    -1.80   0.074       -.2088     .009907
                         Augusta  |   .0684848   .0479349     1.43   0.155    -.0261601    .1631297
                          Aurora  |  -.0414289   .0550759    -0.75   0.453    -.1501733    .0673155
                          Austin  |   .0101748   .0444331     0.23   0.819     -.077556    .0979056
                       Baltimore  |  -.0471543   .0472728    -1.00   0.320    -.1404919    .0461833
                        Bay City  |   .0251964   .0117265     2.15   0.033     .0020431    .0483497
                        Beaumont  |   .0106104   .0335045     0.32   0.752    -.0555424    .0767633
                         Belmont  |   .0212082   .0509858     0.42   0.678    -.0794605    .1218768
                      Bergen Co.  |  -.1535393   .0630001    -2.44   0.016    -.2779296    -.029149
                      Birmingham  |  -.0577702   .0450511    -1.28   0.202    -.1467211    .0311807
                          Boston  |  -.0350249   .0598105    -0.59   0.559    -.1531174    .0830676
                        Brockton  |  -.0414211   .0498476    -0.83   0.407    -.1398424    .0570002
                           Bronx  |   -.109618   .0680877    -1.61   0.109    -.2440535    .0248176
                       Brookline  |    .007264   .0613911     0.12   0.906    -.1139494    .1284774
                        Brooklyn  |  -.1316725   .0522993    -2.52   0.013    -.2349346   -.0284104
                         Buffalo  |  -.0042315   .0291586    -0.15   0.885    -.0618035    .0533406
                       Cambridge  |   .0180137   .0609899     0.30   0.768    -.1024075     .138435
                          Camden  |  -.0302447   .0285718    -1.06   0.291    -.0866581    .0261688
                          Canton  |  -.0118284   .0029654    -3.99   0.000    -.0176834   -.0059734
                       Charlotte  |  -.1352429    .046968    -2.88   0.005    -.2279786   -.0425072
                     Chattanooga  |  -.0603103   .0163162    -3.70   0.000    -.0925258   -.0280948
                         Chelsea  |  -.1055696   .0749038    -1.41   0.161    -.2534631    .0423238
                         Chicago  |  -.0543599   .0588128    -0.92   0.357    -.1704825    .0617627
                       Cleveland  |  -.0361317   .0325183    -1.11   0.268    -.1003372    .0280739
                        Columbia  |  -.1062645   .0306405    -3.47   0.001    -.1667625   -.0457665
                        Columbus  |   .0221749   .0177464     1.25   0.213    -.0128645    .0572143
                  Council Bluffs  |  -.0242347   .0134809    -1.80   0.074     -.050852    .0023825
                          Dallas  |  -.1548083   .0507857    -3.05   0.003    -.2550819   -.0545347
                       Davenport  |  -.0007749   .0034684    -0.22   0.823     -.007623    .0060732
                          Dayton  |  -.0766709   .0178681    -4.29   0.000    -.1119505   -.0413913
                         Decatur  |  -.0683975   .0052775   -12.96   0.000    -.0788176   -.0579775
                          Denver  |    .025644    .045491     0.56   0.574    -.0641754    .1154635
                      Des Moines  |   .0143351   .0121243     1.18   0.239    -.0096036    .0382738
                         Detroit  |  -.0276574   .0315788    -0.88   0.382    -.0900081    .0346933
                         Dubuque  |   .0059974    .013621     0.44   0.660    -.0208966    .0328914
                          Duluth  |   .0945966   .0051719    18.29   0.000     .0843849    .1048083
                          Durham  |  -.0515011   .0534284    -0.96   0.336    -.1569926    .0539904
                  East St. Louis  |  -.0424716     .04087    -1.04   0.300    -.1231671    .0382239
                         El Paso  |  -.0544431   .0509291    -1.07   0.287    -.1549998    .0461135
                          Elmira  |  -.0503021   .0087483    -5.75   0.000    -.0675752    -.033029
                            Erie  |   .0402309   .0073986     5.44   0.000     .0256227    .0548392
                       Essex Co.  |   -.092638    .062387    -1.48   0.139    -.2158177    .0305417
                      Evansville  |  -.0257072   .0030668    -8.38   0.000    -.0317624   -.0196521
                         Everett  |  -.0877924   .0516642    -1.70   0.091    -.1898005    .0142158
                           Flint  |  -.0162101   .0424519    -0.38   0.703     -.100029    .0676089
                      Fort Wayne  |  -.0370831   .0155144    -2.39   0.018    -.0677155   -.0064507
                      Fort Worth  |  -.0977954   .0427822    -2.29   0.024    -.1822664   -.0133244
                          Fresno  |  -.0827968   .0499774    -1.66   0.099    -.1814746    .0158809
                       Galveston  |  -.0882932   .0306558    -2.88   0.005    -.1488214   -.0277651
                    Grand Rapids  |  -.0489254   .0275999    -1.77   0.078      -.10342    .0055691
             Greater Kansas City  |  -.0137163   .0377668    -0.36   0.717    -.0882848    .0608521
                      Greensboro  |  -.0708105   .0397611    -1.78   0.077    -.1493166    .0076955
                      Harrisburg  |   .0048216   .0319729     0.15   0.880     -.058307    .0679503
                        Hartford  |  -.0336356   .0488124    -0.69   0.492     -.130013    .0627418
                Holyoke Chicopee  |  -.0205168   .0126338    -1.62   0.106    -.0454616     .004428
                         Houston  |  -.1144888   .0548041    -2.09   0.038    -.2226964   -.0062812
                      Hudson Co.  |  -.1541256    .074544    -2.07   0.040    -.3013086   -.0069425
                    Indianapolis  |    -.05434   .0237297    -2.29   0.023    -.1011931   -.0074869
                         Jackson  |  -.0383317    .002487   -15.41   0.000     -.043242   -.0334213
                    Jacksonville  |  -.0456757   .0215776    -2.12   0.036    -.0882794   -.0030719
                       Johnstown  |    -.04947   .0228081    -2.17   0.032    -.0945033   -.0044367
                          Joliet  |  -.0671218   .0266003    -2.52   0.013    -.1196427    -.014601
                         Kenosha  |  -.0620762   .0088945    -6.98   0.000    -.0796379   -.0445145
                       Knoxville  |   .0462813   .0036287    12.75   0.000     .0391166     .053446
                   Lake Co. Gary  |  -.0181679   .0628932    -0.29   0.773     -.142347    .1060113
                         Lansing  |   .0371286   .0149201     2.49   0.014     .0076697    .0665875
                            Lima  |  -.1227914   .0183842    -6.68   0.000    -.1590901   -.0864927
                         Lincoln  |    -.01146   .0079711    -1.44   0.152    -.0271984    .0042784
                     Little Rock  |  -.0267595   .0347027    -0.77   0.442    -.0952782    .0417592
                     Los Angeles  |  -.0796067   .0690501    -1.15   0.251    -.2159424    .0567289
           Lower Westchester Co.  |  -.1484206   .0617054    -2.41   0.017    -.2702546   -.0265867
                           Macon  |  -.1665316   .0345865    -4.81   0.000    -.2348207   -.0982426
                         Madison  |   .1198281   .0226044     5.30   0.000     .0751968    .1644593
                          Malden  |  -.0680623   .0531281    -1.28   0.202    -.1729609    .0368362
                      Manchester  |  -.0432863   .0062586    -6.92   0.000    -.0556436   -.0309289
                       Manhattan  |  -.0353017   .0727167    -0.49   0.628    -.1788769    .1082735
                         Medford  |  -.0444776   .0446047    -1.00   0.320    -.1325472     .043592
                         Melrose  |  -.0035068   .0400869    -0.09   0.930    -.0826562    .0756425
                         Memphis  |  -.0788019   .0371421    -2.12   0.035    -.1521369   -.0054669
                           Miami  |  -.3146718   .0805262    -3.91   0.000    -.4736665   -.1556771
                   Milwaukee Co.  |  -.0258606   .0343042    -0.75   0.452    -.0935923    .0418711
                     Minneapolis  |   .0489226   .0348467     1.40   0.162    -.0198804    .1177256
                          Mobile  |  -.2087364   .0382984    -5.45   0.000    -.2843545   -.1331183
                      Montgomery  |  -.1202063    .024835    -4.84   0.000    -.1692416    -.071171
                        Muskegon  |  -.0144794   .0392987    -0.37   0.713    -.0920725    .0631138
                       Nashville  |  -.1059783   .0364036    -2.91   0.004    -.1778551   -.0341014
                     New Britain  |  -.0487896   .0246872    -1.98   0.050    -.0975331   -.0000462
                      New Castle  |  -.0205098   .0280965    -0.73   0.466    -.0759849    .0349653
                       New Haven  |  -.0530737   .0258638    -2.05   0.042    -.1041403    -.002007
                     New Orleans  |  -.0459862   .0463993    -0.99   0.323    -.1375991    .0456268
                          Newton  |   .0079399   .0637068     0.12   0.901    -.1178457    .1337254
                   Niagara Falls  |   -.005621   .0059236    -0.95   0.344    -.0173168    .0060749
                         Norfolk  |  -.0639338   .0420441    -1.52   0.130    -.1469476    .0190801
                         Oakland  |   .0156611   .0742505     0.21   0.833    -.1309425    .1622647
                           Ogden  |  -.1143957   .0165011    -6.93   0.000    -.1469761   -.0818152
                   Oklahoma City  |  -.0902084   .0343222    -2.63   0.009    -.1579757   -.0224411
                           Omaha  |  -.0292699   .0176886    -1.65   0.100     -.064195    .0056553
                         Oshkosh  |   .0009684    .008903     0.11   0.914    -.0166101    .0185468
       Pawtucket & Central Falls  |  -.0173143   .0226764    -0.76   0.446    -.0620875     .027459
                          Peoria  |  -.0103817   .0228639    -0.45   0.650    -.0555252    .0347617
                    Philadelphia  |  -.0178186     .04383    -0.41   0.685    -.1043586    .0687215
                         Phoenix  |  -.0171769   .0376631    -0.46   0.649    -.0915408    .0571869
                      Pittsburgh  |   .0138739   .0247218     0.56   0.575     -.034938    .0626858
                         Pontiac  |  -.0057773   .0284733    -0.20   0.839    -.0619962    .0504416
                     Port Arthur  |  -.0920066   .0385184    -2.39   0.018    -.1680591    -.015954
                        Portland  |   .1105181   .0405522     2.73   0.007       .03045    .1905861
                    Poughkeepsie  |   -.067204   .0432821    -1.55   0.122    -.1526622    .0182542
                      Providence  |  -.0412438   .0482418    -0.85   0.394    -.1364947    .0540071
                          Pueblo  |  -.0422554   .0198909    -2.12   0.035     -.081529   -.0029819
                          Queens  |  -.1025141   .0726803    -1.41   0.160    -.2460174    .0409892
                          Quincy  |  -.0198645   .0392062    -0.51   0.613    -.0972751     .057546
                          Racine  |   -.028334   .0052172    -5.43   0.000    -.0386352   -.0180329
                          Revere  |  -.0332498   .0382272    -0.87   0.386    -.1087273    .0422277
                        Richmond  |  -.0794151   .0398628    -1.99   0.048    -.1581221    -.000708
                       Rochester  |  -.0278627   .0344606    -0.81   0.420    -.0959034     .040178
                        Rockford  |   -.053168   .0146278    -3.63   0.000    -.0820497   -.0242862
                      Sacramento  |   -.008384   .0508144    -0.16   0.869    -.1087144    .0919463
                         Saginaw  |  -.0267818    .018644    -1.44   0.153    -.0635934    .0100298
                  Salt Lake City  |   .0331652   .0280509     1.18   0.239    -.0222198    .0885502
                     San Antonio  |  -.0041781   .0412839    -0.10   0.920    -.0856909    .0773347
                       San Diego  |  -.0715591   .0605517    -1.18   0.239    -.1911151    .0479969
                   San Francisco  |  -.0051982   .0845978    -0.06   0.951    -.1722319    .1618355
                        San Jose  |   -.037271    .066641    -0.56   0.577    -.1688501     .094308
                        Savannah  |   .0046801   .0275967     0.17   0.866    -.0498081    .0591683
                     Schenectady  |   -.086195   .0139691    -6.17   0.000    -.1137762   -.0586138
                         Seattle  |   .0643928   .0562031     1.15   0.254    -.0465771    .1753628
                      Shreveport  |  -.1893695   .0563246    -3.36   0.001    -.3005793   -.0781597
                      Sioux City  |  -.1419845   .0125243   -11.34   0.000    -.1667131   -.1172559
                      Somerville  |   .0628708    .050777     1.24   0.217    -.0373855    .1631272
                      South Bend  |  -.0031125   .0134861    -0.23   0.818      -.02974     .023515
                         Spokane  |  -.0432984   .0099437    -4.35   0.000    -.0629316   -.0236651
                     Springfield  |  -.0307981   .0081501    -3.78   0.000    -.0468901   -.0147062
                      St. Joseph  |   -.045941   .0120285    -3.82   0.000    -.0696905   -.0221915
                       St. Louis  |  -.0245665   .0381672    -0.64   0.521    -.0999256    .0507926
                        St. Paul  |   .0544317   .0307875     1.77   0.079    -.0063565    .1152199
                  St. Petersburg  |   -.056177   .0324384    -1.73   0.085    -.1202249     .007871
Stamford, Darien, and New Canaan  |  -.1639364   .0655278    -2.50   0.013    -.2933175   -.0345552
                   Staten Island  |  -.2059079     .04515    -4.56   0.000    -.2950541   -.1167617
                        Stockton  |  -.0783056   .0499473    -1.57   0.119    -.1769239    .0203127
                        Syracuse  |  -.0084458   .0119113    -0.71   0.479    -.0319641    .0150724
                          Tacoma  |  -.0043252   .0298284    -0.15   0.885    -.0632197    .0545693
                           Tampa  |  -.1277549    .045342    -2.82   0.005    -.2172801   -.0382296
                     Terre Haute  |  -.0749385   .0049334   -15.19   0.000    -.0846792   -.0651979
                          Toledo  |  -.0123203   .0158014    -0.78   0.437    -.0435193    .0188788
                          Topeka  |  -.0273862   .0104704    -2.62   0.010    -.0480594    -.006713
                         Trenton  |  -.0807292   .0553046    -1.46   0.146    -.1899251    .0284667
                           Tulsa  |  -.0873958   .0349212    -2.50   0.013    -.1563458   -.0184458
                       Union Co.  |  -.1358504   .0648404    -2.10   0.038    -.2638743   -.0078265
                           Utica  |  -.0570716   .0110614    -5.16   0.000    -.0789117   -.0352314
                            Waco  |  -.1195029   .0306038    -3.90   0.000    -.1799285   -.0590773
                          Warren  |   .0495583   .0250083     1.98   0.049     .0001808    .0989358
                       Waterbury  |  -.1222111   .0396536    -3.08   0.002     -.200505   -.0439172
                        Waterloo  |  -.0001528   .0072313    -0.02   0.983    -.0144305     .014125
                       Watertown  |  -.0330388   .0475127    -0.70   0.488      -.12685    .0607724
                         Wichita  |  -.1055524    .028595    -3.69   0.000    -.1620118   -.0490931
                    Wilkes-Barre  |  -.0660716    .004883   -13.53   0.000    -.0757127   -.0564305
                   Winston-Salem  |  -.0360372   .0332316    -1.08   0.280    -.1016511    .0295768
                      Woonsocket  |   -.088012   .0048253   -18.24   0.000    -.0975393   -.0784847
                            York  |  -.0548906   .0337582    -1.63   0.106    -.1215444    .0117632
                      Youngstown  |  -.0130591   .0167851    -0.78   0.438    -.0462003    .0200822
                                  |
                            _cons |     .97262   .0462161    21.05   0.000      .881369    1.063871
---------------------------------------------------------------------------------------------------

. eststo reg_all_cov: regress tract_dvoteshare $indep_vars 
> $controls i.city2 
> if incl == 1, cluster(city2);

Linear regression                               Number of obs     =      6,026
                                                F(14, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7500
                                                Root MSE          =      .0756

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |    .114366   .0384276     2.98   0.003     .0384929    .1902392
                  perc_tract_d_sq |  -.2511542   .1073339    -2.34   0.020    -.4630792   -.0392292
                  perc_tract_d_cu |   .1721504   .0716972     2.40   0.017     .0305881    .3137126
                     perc_tract_c |   .1232328   .0370191     3.33   0.001     .0501406     .196325
                  perc_tract_c_sq |  -.2906397   .0684118    -4.25   0.000    -.4257151   -.1555643
                  perc_tract_c_cu |   .1874544   .0438335     4.28   0.000     .1009075    .2740013
                       _yr_median |  -.0000156   .0002639    -0.06   0.953    -.0005367    .0005054
                       median_age |  -.0018103   .0005499    -3.29   0.001     -.002896   -.0007245
                male_female_ratio |    .012338   .0125741     0.98   0.328    -.0124889    .0371648
                    perc_hs_total |  -.1166325   .0370462    -3.15   0.002    -.1897781   -.0434869
               perc_somecol_total |   .0856474   .0823745     1.04   0.300    -.0769965    .2482913
                  perc_bach_total |   .4611262   .1147257     4.02   0.000     .2346065    .6876459
                   perc_pop_white |  -.5272898   .1493491    -3.53   0.001    -.8221715   -.2324081
                   perc_pop_black |   .0561635   .0675038     0.83   0.407    -.0771191    .1894461
                   perc_pop_asian |  -.3260139   .0626383    -5.20   0.000    -.4496898    -.202338
                                  |
                            city2 |
                          Albany  |  -.0184932   .0372868    -0.50   0.621     -.092114    .0551276
                         Altoona  |  -.1425691    .021192    -6.73   0.000    -.1844116   -.1007266
                        Amarillo  |  -.2834451   .0093402   -30.35   0.000    -.3018867   -.2650034
                       Arlington  |   .0536647   .0491938     1.09   0.277    -.0434658    .1507952
                         Atlanta  |  -.1025189   .0550275    -1.86   0.064    -.2111677    .0061299
                   Atlantic City  |  -.0974717   .0549179    -1.77   0.078     -.205904    .0109607
                         Augusta  |   .0700417   .0468893     1.49   0.137    -.0225386    .1626221
                          Aurora  |  -.0410095   .0550904    -0.74   0.458    -.1497824    .0677635
                          Austin  |    .013043    .043479     0.30   0.765    -.0728038    .0988899
                       Baltimore  |  -.0454202   .0462849    -0.98   0.328    -.1368072    .0459668
                        Bay City  |   .0294304   .0135525     2.17   0.031     .0026717    .0561892
                        Beaumont  |    .008427   .0336913     0.25   0.803    -.0580947    .0749487
                         Belmont  |   .0232661    .050747     0.46   0.647    -.0769311    .1234634
                      Bergen Co.  |  -.1517876   .0626318    -2.42   0.016    -.2754506   -.0281246
                      Birmingham  |  -.0575269   .0448023    -1.28   0.201    -.1459867    .0309328
                          Boston  |  -.0337943   .0590845    -0.57   0.568    -.1504534    .0828647
                        Brockton  |   -.039392   .0493524    -0.80   0.426    -.1368356    .0580516
                           Bronx  |  -.1074939   .0672111    -1.60   0.112    -.2401986    .0252109
                       Brookline  |   .0089991   .0609347     0.15   0.883    -.1113131    .1293114
                        Brooklyn  |  -.1296817   .0515114    -2.52   0.013    -.2313881   -.0279752
                         Buffalo  |   .0000737   .0286378     0.00   0.998      -.05647    .0566175
                       Cambridge  |   .0200396   .0603145     0.33   0.740     -.099048    .1391272
                          Camden  |  -.0275622   .0287476    -0.96   0.339    -.0843228    .0291985
                          Canton  |  -.0128275   .0027899    -4.60   0.000     -.018336    -.007319
                       Charlotte  |  -.1352435   .0467098    -2.90   0.004    -.2274695   -.0430176
                     Chattanooga  |   -.056695   .0160875    -3.52   0.001    -.0884589    -.024931
                         Chelsea  |  -.1044132   .0743283    -1.40   0.162    -.2511703     .042344
                         Chicago  |   -.052866   .0578945    -0.91   0.362    -.1671757    .0614436
                       Cleveland  |  -.0347066   .0321323    -1.08   0.282      -.09815    .0287368
                        Columbia  |  -.1133638   .0307553    -3.69   0.000    -.1740886   -.0526391
                        Columbus  |   .0220856   .0180655     1.22   0.223    -.0135838     .057755
                  Council Bluffs  |   -.026097   .0155553    -1.68   0.095    -.0568101    .0046162
                          Dallas  |  -.1515166   .0505549    -3.00   0.003    -.2513344   -.0516988
                       Davenport  |   -.000404   .0035975    -0.11   0.911    -.0075069     .006699
                          Dayton  |  -.0749762     .01779    -4.21   0.000    -.1101017   -.0398508
                         Decatur  |  -.0702897   .0068507   -10.26   0.000    -.0838161   -.0567633
                          Denver  |   .0273402    .045024     0.61   0.545    -.0615572    .1162375
                      Des Moines  |   .0150157   .0116063     1.29   0.198    -.0079002    .0379316
                         Detroit  |  -.0258147    .030687    -0.84   0.401    -.0864046    .0347751
                         Dubuque  |   .0025681   .0152805     0.17   0.867    -.0276024    .0327387
                          Duluth  |   .0913789   .0051641    17.70   0.000     .0811827     .101575
                          Durham  |  -.0519399   .0536998    -0.97   0.335    -.1579673    .0540875
                  East St. Louis  |  -.0447289   .0409727    -1.09   0.277    -.1256273    .0361695
                         El Paso  |  -.0560925    .050949    -1.10   0.273    -.1566885    .0445035
                          Elmira  |  -.0509869    .008454    -6.03   0.000    -.0676788   -.0342949
                            Erie  |   .0404484   .0075635     5.35   0.000     .0255146    .0553822
                       Essex Co.  |  -.0913316   .0621122    -1.47   0.143    -.2139687    .0313055
                      Evansville  |  -.0259117   .0032248    -8.04   0.000    -.0322789   -.0195446
                         Everett  |  -.0870585   .0512268    -1.70   0.091     -.188203    .0140861
                           Flint  |  -.0135074   .0429683    -0.31   0.754    -.0983459    .0713311
                      Fort Wayne  |   -.034628   .0180467    -1.92   0.057    -.0702601    .0010041
                      Fort Worth  |  -.0982939   .0424244    -2.32   0.022    -.1820586   -.0145292
                          Fresno  |  -.0797869   .0504097    -1.58   0.115     -.179318    .0197443
                       Galveston  |  -.0844594   .0295128    -2.86   0.005    -.1427309   -.0261879
                    Grand Rapids  |  -.0492527   .0276622    -1.78   0.077    -.1038702    .0053648
             Greater Kansas City  |  -.0127681    .037544    -0.34   0.734    -.0868967    .0613604
                      Greensboro  |  -.0762352   .0415515    -1.83   0.068    -.1582764    .0058059
                      Harrisburg  |   .0050555   .0302855     0.17   0.868    -.0547417    .0648527
                        Hartford  |  -.0303486   .0483586    -0.63   0.531    -.1258301    .0651329
                Holyoke Chicopee  |  -.0220508   .0127129    -1.73   0.085    -.0471517    .0030501
                         Houston  |  -.1096087   .0539823    -2.03   0.044    -.2161938   -.0030236
                      Hudson Co.  |  -.1524886    .073952    -2.06   0.041    -.2985028   -.0064744
                    Indianapolis  |  -.0540468   .0231212    -2.34   0.021    -.0996984   -.0083953
                         Jackson  |   -.037593   .0023504   -15.99   0.000    -.0422336   -.0329523
                    Jacksonville  |  -.0494718   .0216482    -2.29   0.024     -.092215   -.0067285
                       Johnstown  |  -.0493659    .022894    -2.16   0.033    -.0945688   -.0041629
                          Joliet  |  -.0674745   .0269337    -2.51   0.013    -.1206535   -.0142954
                         Kenosha  |  -.0622588   .0088219    -7.06   0.000    -.0796773   -.0448404
                       Knoxville  |   .0474129   .0037856    12.52   0.000     .0399383    .0548874
                   Lake Co. Gary  |  -.0112464   .0628307    -0.18   0.858    -.1353021    .1128093
                         Lansing  |    .037851   .0143588     2.64   0.009     .0095004    .0662015
                            Lima  |  -.1180399   .0190586    -6.19   0.000    -.1556701   -.0804097
                         Lincoln  |   -.011991   .0086019    -1.39   0.165     -.028975     .004993
                     Little Rock  |  -.0311465   .0347186    -0.90   0.371    -.0996965    .0374035
                     Los Angeles  |  -.0778715   .0683534    -1.14   0.256    -.2128317    .0570886
           Lower Westchester Co.  |  -.1462881   .0610484    -2.40   0.018    -.2668248   -.0257513
                           Macon  |  -.1632908   .0333162    -4.90   0.000    -.2290717   -.0975099
                         Madison  |   .1206164   .0217276     5.55   0.000     .0777164    .1635163
                          Malden  |  -.0674487   .0525813    -1.28   0.201    -.1712677    .0363703
                      Manchester  |  -.0448691    .005839    -7.68   0.000    -.0563979   -.0333403
                       Manhattan  |  -.0319423    .071696    -0.45   0.657    -.1735022    .1096175
                         Medford  |  -.0410887   .0443912    -0.93   0.356    -.1287368    .0465593
                         Melrose  |  -.0035235   .0408503    -0.09   0.931    -.0841802    .0771332
                         Memphis  |    -.07774   .0368156    -2.11   0.036    -.1504304   -.0050496
                           Miami  |  -.3123072    .080377    -3.89   0.000    -.4710072   -.1536072
                   Milwaukee Co.  |  -.0244017   .0336539    -0.73   0.469    -.0908495     .042046
                     Minneapolis  |   .0486293   .0343429     1.42   0.159     -.019179    .1164375
                          Mobile  |  -.2054094   .0387052    -5.31   0.000    -.2818308    -.128988
                      Montgomery  |  -.1189408   .0240926    -4.94   0.000    -.1665104   -.0713712
                        Muskegon  |  -.0149174    .038019    -0.39   0.695    -.0899837     .060149
                       Nashville  |   -.104649   .0356608    -2.93   0.004    -.1750593   -.0342387
                     New Britain  |  -.0480752   .0245789    -1.96   0.052    -.0966048    .0004545
                      New Castle  |  -.0160445   .0286973    -0.56   0.577    -.0727057    .0406168
                       New Haven  |  -.0530777   .0269087    -1.97   0.050    -.1062075    .0000522
                     New Orleans  |  -.0450199    .046087    -0.98   0.330    -.1360163    .0459765
                          Newton  |   .0112743    .063936     0.18   0.860    -.1149639    .1375125
                   Niagara Falls  |  -.0008625   .0050406    -0.17   0.864     -.010815    .0090899
                         Norfolk  |   -.061753   .0415796    -1.49   0.139    -.1438496    .0203437
                         Oakland  |   .0179046    .074138     0.24   0.809    -.1284768     .164286
                           Ogden  |  -.1124764   .0159657    -7.04   0.000    -.1439998   -.0809531
                   Oklahoma City  |  -.0878973   .0337783    -2.60   0.010    -.1545908   -.0212038
                           Omaha  |    -.02562   .0168907    -1.52   0.131    -.0589698    .0077299
                         Oshkosh  |   .0020426   .0108497     0.19   0.851    -.0193796    .0234647
       Pawtucket & Central Falls  |  -.0130826   .0219907    -0.59   0.553    -.0565021    .0303368
                          Peoria  |  -.0064576   .0228188    -0.28   0.778     -.051512    .0385968
                    Philadelphia  |  -.0153355   .0430309    -0.36   0.722    -.1002976    .0696266
                         Phoenix  |  -.0141396   .0370649    -0.38   0.703    -.0873223    .0590431
                      Pittsburgh  |    .015118   .0242535     0.62   0.534    -.0327693    .0630053
                         Pontiac  |   -.006411   .0286083    -0.22   0.823    -.0628966    .0500746
                     Port Arthur  |  -.0866747   .0371983    -2.33   0.021    -.1601207   -.0132288
                        Portland  |    .110104   .0401891     2.74   0.007     .0307529    .1894551
                    Poughkeepsie  |  -.0735105   .0434836    -1.69   0.093    -.1593664    .0123454
                      Providence  |  -.0397772     .04804    -0.83   0.409    -.1346296    .0550752
                          Pueblo  |  -.0410356   .0191313    -2.14   0.033    -.0788095   -.0032618
                          Queens  |  -.1009918   .0715757    -1.41   0.160    -.2423142    .0403306
                          Quincy  |  -.0183355   .0389109    -0.47   0.638    -.0951629     .058492
                          Racine  |  -.0321439   .0055534    -5.79   0.000    -.0431088   -.0211791
                          Revere  |  -.0327224   .0377122    -0.87   0.387     -.107183    .0417383
                        Richmond  |  -.0790478   .0395833    -2.00   0.047    -.1572028   -.0008928
                       Rochester  |  -.0257811   .0337929    -0.76   0.447    -.0925033    .0409411
                        Rockford  |  -.0528278   .0152626    -3.46   0.001    -.0829631   -.0226926
                      Sacramento  |  -.0029704   .0513841    -0.06   0.954    -.1044254    .0984847
                         Saginaw  |  -.0242564    .019009    -1.28   0.204    -.0617885    .0132758
                  Salt Lake City  |    .036318    .027468     1.32   0.188     -.017916     .090552
                     San Antonio  |  -.0032718   .0406807    -0.08   0.936    -.0835935      .07705
                       San Diego  |  -.0698182   .0599784    -1.16   0.246    -.1882424    .0486059
                   San Francisco  |  -.0031562   .0842129    -0.04   0.970      -.16943    .1631176
                        San Jose  |   -.041726   .0666436    -0.63   0.532    -.1733103    .0898582
                        Savannah  |   .0070292   .0281616     0.25   0.803    -.0485743    .0626326
                     Schenectady  |  -.0833454   .0133945    -6.22   0.000    -.1097922   -.0568986
                         Seattle  |    .065043   .0558176     1.17   0.246    -.0451658    .1752518
                      Shreveport  |    -.19168   .0568089    -3.37   0.001     -.303846    -.079514
                      Sioux City  |  -.1429341   .0127483   -11.21   0.000    -.1681049   -.1177633
                      Somerville  |   .0648445   .0503532     1.29   0.200    -.0345752    .1642642
                      South Bend  |   .0016896   .0132775     0.13   0.899     -.024526    .0279053
                         Spokane  |  -.0439456   .0099137    -4.43   0.000    -.0635196   -.0243716
                     Springfield  |  -.0335772   .0080459    -4.17   0.000    -.0494635   -.0176909
                      St. Joseph  |  -.0415299   .0132809    -3.13   0.002    -.0677523   -.0153074
                       St. Louis  |  -.0232082    .037606    -0.62   0.538    -.0974593    .0510429
                        St. Paul  |     .05458    .030135     1.81   0.072    -.0049199    .1140798
                  St. Petersburg  |   -.053215   .0327676    -1.62   0.106    -.1179128    .0114828
Stamford, Darien, and New Canaan  |  -.1621783   .0655502    -2.47   0.014    -.2916037    -.032753
                   Staten Island  |  -.2051465   .0448518    -4.57   0.000    -.2937039    -.116589
                        Stockton  |  -.0844576   .0513493    -1.64   0.102     -.185844    .0169288
                        Syracuse  |  -.0057338   .0115829    -0.50   0.621    -.0286037     .017136
                          Tacoma  |  -.0072309   .0298762    -0.24   0.809    -.0662199     .051758
                           Tampa  |  -.1266078    .044834    -2.82   0.005    -.2151302   -.0380855
                     Terre Haute  |  -.0754439   .0051528   -14.64   0.000    -.0856178     -.06527
                          Toledo  |  -.0102174   .0152072    -0.67   0.503    -.0402433    .0198084
                          Topeka  |  -.0355891   .0103852    -3.43   0.001    -.0560941   -.0150842
                         Trenton  |  -.0801996   .0551766    -1.45   0.148    -.1891427    .0287435
                           Tulsa  |  -.0852532   .0344447    -2.48   0.014    -.1532624    -.017244
                       Union Co.  |  -.1352336   .0647839    -2.09   0.038    -.2631458   -.0073214
                           Utica  |  -.0552574   .0110324    -5.01   0.000    -.0770404   -.0334745
                            Waco  |   -.120619   .0310175    -3.89   0.000    -.1818614   -.0593767
                          Warren  |   .0430768    .024652     1.75   0.082    -.0055972    .0917508
                       Waterbury  |  -.1229064   .0401269    -3.06   0.003    -.2021347   -.0436781
                        Waterloo  |   .0010972   .0068543     0.16   0.873    -.0124361    .0146306
                       Watertown  |   -.030888   .0463505    -0.67   0.506    -.1224046    .0606285
                         Wichita  |  -.1028402   .0279188    -3.68   0.000    -.1579643    -.047716
                    Wilkes-Barre  |  -.0610845   .0051096   -11.95   0.000    -.0711731   -.0509958
                   Winston-Salem  |  -.0384934   .0334438    -1.15   0.251    -.1045262    .0275395
                      Woonsocket  |  -.0885153   .0046635   -18.98   0.000    -.0977231   -.0793075
                            York  |    -.05618   .0342377    -1.64   0.103    -.1237804    .0114204
                      Youngstown  |  -.0134195   .0166526    -0.81   0.421    -.0462992    .0194602
                                  |
                            _cons |   .9664073   .0454542    21.26   0.000     .8766604    1.056154
---------------------------------------------------------------------------------------------------

. eststo reg_all_cov_no_c: regress tract_dvoteshare perc_tract_d perc_tract_d_sq 
> perc_tract_d_cu $controls i.city2 
> if incl == 1, cluster(city2);

Linear regression                               Number of obs     =      6,026
                                                F(11, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7487
                                                Root MSE          =     .07577

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |   .0786223    .044531     1.77   0.079    -.0093018    .1665464
                  perc_tract_d_sq |   -.131984   .0966436    -1.37   0.174    -.3228014    .0588335
                  perc_tract_d_cu |   .0746606   .0645031     1.16   0.249    -.0526972    .2020184
                       _yr_median |  -.0000539   .0002488    -0.22   0.829    -.0005451    .0004373
                       median_age |  -.0019028   .0005241    -3.63   0.000    -.0029375    -.000868
                male_female_ratio |   .0132654   .0125723     1.06   0.293    -.0115579    .0380886
                    perc_hs_total |  -.1151978   .0369596    -3.12   0.002    -.1881725   -.0422231
               perc_somecol_total |   .0786855     .08021     0.98   0.328    -.0796848    .2370559
                  perc_bach_total |    .458895   .1136345     4.04   0.000     .2345299      .68326
                   perc_pop_white |  -.5276054    .149491    -3.53   0.001    -.8227672   -.2324436
                   perc_pop_black |   .0556772   .0681356     0.82   0.415    -.0788528    .1902072
                   perc_pop_asian |  -.3258871   .0618439    -5.27   0.000    -.4479946   -.2037796
                                  |
                            city2 |
                          Albany  |  -.0192424   .0375315    -0.51   0.609    -.0933464    .0548615
                         Altoona  |  -.1430107   .0228129    -6.27   0.000    -.1880535    -.097968
                        Amarillo  |  -.2901673   .0130282   -22.27   0.000    -.3158908   -.2644437
                       Arlington  |   .0591738   .0490194     1.21   0.229    -.0376123    .1559599
                         Atlanta  |  -.0990899   .0535621    -1.85   0.066    -.2048453    .0066654
                   Atlantic City  |   -.096175   .0545385    -1.76   0.080    -.2038584    .0115084
                         Augusta  |   .0723836   .0470449     1.54   0.126    -.0205039    .1652711
                          Aurora  |  -.0416544   .0559608    -0.74   0.458     -.152146    .0688371
                          Austin  |   .0093088    .045652     0.20   0.839    -.0808286    .0994463
                       Baltimore  |  -.0448609   .0467652    -0.96   0.339    -.1371962    .0474745
                        Bay City  |    .023345   .0114078     2.05   0.042      .000821     .045869
                        Beaumont  |   .0048631   .0366735     0.13   0.895    -.0675466    .0772729
                         Belmont  |   .0255052   .0498242     0.51   0.609      -.07287    .1238804
                      Bergen Co.  |  -.1484824   .0613219    -2.42   0.017    -.2695591   -.0274056
                      Birmingham  |  -.0555394   .0444845    -1.25   0.214    -.1433716    .0322927
                          Boston  |  -.0287572   .0576439    -0.50   0.619    -.1425718    .0850575
                        Brockton  |  -.0358084   .0479147    -0.75   0.456    -.1304135    .0587967
                           Bronx  |  -.1051463   .0668742    -1.57   0.118    -.2371858    .0268932
                       Brookline  |   .0147399   .0588267     0.25   0.802    -.1014101      .13089
                        Brooklyn  |  -.1288008   .0517122    -2.49   0.014    -.2309037   -.0266979
                         Buffalo  |  -.0044573   .0297516    -0.15   0.881    -.0632002    .0542856
                       Cambridge  |   .0242883   .0587862     0.41   0.680    -.0917818    .1403585
                          Camden  |  -.0285994   .0284535    -1.01   0.316    -.0847793    .0275804
                          Canton  |  -.0151979   .0026815    -5.67   0.000    -.0204925   -.0099034
                       Charlotte  |  -.1335134   .0465419    -2.87   0.005    -.2254078    -.041619
                     Chattanooga  |  -.0613913   .0168968    -3.63   0.000    -.0947531   -.0280295
                         Chelsea  |  -.1005067   .0736738    -1.36   0.174    -.2459715    .0449582
                         Chicago  |  -.0481508   .0566537    -0.85   0.397    -.1600104    .0637089
                       Cleveland  |  -.0350434   .0323916    -1.08   0.281    -.0989988    .0289121
                        Columbia  |  -.1082863   .0314984    -3.44   0.001    -.1704782   -.0460944
                        Columbus  |   .0224282   .0178603     1.26   0.211     -.012836    .0576925
                  Council Bluffs  |  -.0289365   .0119757    -2.42   0.017    -.0525819    -.005291
                          Dallas  |  -.1507618   .0496462    -3.04   0.003    -.2487857    -.052738
                       Davenport  |   .0021859   .0033504     0.65   0.515    -.0044294    .0088011
                          Dayton  |  -.0791592   .0191194    -4.14   0.000    -.1169094   -.0414089
                         Decatur  |  -.0702399   .0059018   -11.90   0.000    -.0818927   -.0585871
                          Denver  |   .0320396   .0431297     0.74   0.459    -.0531177    .1171969
                      Des Moines  |   .0141118    .012515     1.13   0.261    -.0105984     .038822
                         Detroit  |  -.0241707   .0304338    -0.79   0.428    -.0842606    .0359191
                         Dubuque  |  -.0016296   .0104338    -0.16   0.876    -.0222306    .0189713
                          Duluth  |   .0915613   .0055334    16.55   0.000      .080636    .1024867
                          Durham  |  -.0496793    .053522    -0.93   0.355    -.1553556     .055997
                  East St. Louis  |   -.043653    .041615    -1.05   0.296    -.1258196    .0385136
                         El Paso  |  -.0571776   .0528229    -1.08   0.281    -.1614735    .0471183
                          Elmira  |  -.0537822   .0075465    -7.13   0.000    -.0686824   -.0388821
                            Erie  |   .0371061   .0065306     5.68   0.000     .0242117    .0500005
                       Essex Co.  |  -.0902092   .0618503    -1.46   0.147    -.2123293    .0319109
                      Evansville  |  -.0242576    .002439    -9.95   0.000    -.0290733   -.0194419
                         Everett  |  -.0831484   .0496985    -1.67   0.096    -.1812754    .0149786
                           Flint  |  -.0137529   .0417527    -0.33   0.742    -.0961914    .0686855
                      Fort Wayne  |   -.035583   .0154607    -2.30   0.023    -.0661094   -.0050567
                      Fort Worth  |  -.1010587   .0448651    -2.25   0.026    -.1896424    -.012475
                          Fresno  |  -.0792131    .049019    -1.62   0.108    -.1759985    .0175724
                       Galveston  |  -.0915037    .032659    -2.80   0.006     -.155987   -.0270203
                    Grand Rapids  |  -.0453319   .0261973    -1.73   0.085    -.0970571    .0063933
             Greater Kansas City  |  -.0110561    .036982    -0.30   0.765    -.0840751    .0619629
                      Greensboro  |  -.0713013   .0401318    -1.78   0.077    -.1505393    .0079368
                      Harrisburg  |  -.0020566   .0351601    -0.06   0.953    -.0714782    .0673651
                        Hartford  |  -.0312417   .0484312    -0.65   0.520    -.1268665    .0643831
                Holyoke Chicopee  |  -.0204036   .0120221    -1.70   0.092    -.0441407    .0033334
                         Houston  |  -.1154647   .0560733    -2.06   0.041    -.2261783   -.0047511
                      Hudson Co.  |  -.1492842   .0730824    -2.04   0.043    -.2935813    -.004987
                    Indianapolis  |  -.0514307   .0227007    -2.27   0.025    -.0962519   -.0066095
                         Jackson  |  -.0392534   .0028428   -13.81   0.000    -.0448664   -.0336404
                    Jacksonville  |  -.0469438   .0222443    -2.11   0.036    -.0908639   -.0030237
                       Johnstown  |  -.0500513   .0235471    -2.13   0.035    -.0965438   -.0035589
                          Joliet  |  -.0696168   .0281945    -2.47   0.015    -.1252854   -.0139482
                         Kenosha  |  -.0621881   .0078631    -7.91   0.000    -.0777133    -.046663
                       Knoxville  |   .0491307   .0031609    15.54   0.000     .0428897    .0553716
                   Lake Co. Gary  |  -.0106546   .0600647    -0.18   0.859    -.1292491    .1079398
                         Lansing  |   .0406395   .0133089     3.05   0.003     .0143618    .0669172
                            Lima  |  -.1247422   .0174072    -7.17   0.000    -.1591117   -.0903727
                         Lincoln  |  -.0131003   .0089861    -1.46   0.147    -.0308429    .0046423
                     Little Rock  |  -.0262226   .0345989    -0.76   0.450    -.0945363    .0420911
                     Los Angeles  |  -.0749953   .0677578    -1.11   0.270    -.2087793    .0587888
           Lower Westchester Co.  |  -.1489076   .0625522    -2.38   0.018    -.2724134   -.0254017
                           Macon  |  -.1645315   .0342209    -4.81   0.000    -.2320988   -.0969641
                         Madison  |   .1227487   .0213686     5.74   0.000     .0805575    .1649398
                          Malden  |  -.0630001   .0514902    -1.22   0.223    -.1646646    .0386644
                      Manchester  |   -.043106   .0051566    -8.36   0.000    -.0532875   -.0329246
                       Manhattan  |  -.0320887   .0723154    -0.44   0.658    -.1748715    .1106942
                         Medford  |  -.0367867   .0415696    -0.88   0.377    -.1188635    .0452902
                         Melrose  |   .0002315   .0390643     0.01   0.995    -.0768989     .077362
                         Memphis  |  -.0776076   .0369997    -2.10   0.037    -.1506615   -.0045538
                           Miami  |  -.3120992   .0802548    -3.89   0.000     -.470558   -.1536405
                   Milwaukee Co.  |  -.0235346   .0336514    -0.70   0.485    -.0899774    .0429082
                     Minneapolis  |   .0479983   .0356658     1.35   0.180     -.022422    .1184185
                          Mobile  |   -.204526   .0367912    -5.56   0.000    -.2771682   -.1318839
                      Montgomery  |  -.1189587   .0246137    -4.83   0.000    -.1675571   -.0703602
                        Muskegon  |  -.0145847   .0399743    -0.36   0.716    -.0935118    .0643424
                       Nashville  |  -.1046231   .0364684    -2.87   0.005    -.1766279   -.0326182
                     New Britain  |  -.0494349   .0255091    -1.94   0.054    -.0998012    .0009315
                      New Castle  |  -.0151314   .0303277    -0.50   0.618    -.0750118    .0447489
                       New Haven  |  -.0514974   .0255555    -2.02   0.046    -.1019554   -.0010394
                     New Orleans  |  -.0428806    .045449    -0.94   0.347    -.1326173    .0468561
                          Newton  |   .0137862   .0619183     0.22   0.824    -.1084681    .1360405
                   Niagara Falls  |  -.0079441   .0066153    -1.20   0.232    -.0210056    .0051175
                         Norfolk  |  -.0600211    .040975    -1.46   0.145     -.140924    .0208819
                         Oakland  |   .0186335   .0737497     0.25   0.801    -.1269813    .1642483
                           Ogden  |   -.115159   .0174333    -6.61   0.000    -.1495801   -.0807378
                   Oklahoma City  |  -.0896677   .0348347    -2.57   0.011    -.1584469   -.0208885
                           Omaha  |  -.0336886   .0202857    -1.66   0.099    -.0737416    .0063643
                         Oshkosh  |   .0040626   .0104997     0.39   0.699    -.0166684    .0247936
       Pawtucket & Central Falls  |   -.020563   .0250104    -0.82   0.412    -.0699447    .0288186
                          Peoria  |  -.0063674   .0216097    -0.29   0.769    -.0490347    .0362998
                    Philadelphia  |  -.0177098   .0443585    -0.40   0.690    -.1052933    .0698737
                         Phoenix  |  -.0207789   .0403799    -0.51   0.608    -.1005069    .0589491
                      Pittsburgh  |   .0147303   .0247269     0.60   0.552    -.0340917    .0635522
                         Pontiac  |  -.0088697    .030027    -0.30   0.768    -.0681564    .0504169
                     Port Arthur  |  -.0990695   .0422395    -2.35   0.020    -.1824691   -.0156699
                        Portland  |   .1128127   .0398435     2.83   0.005     .0341439    .1914815
                    Poughkeepsie  |  -.0698122   .0448282    -1.56   0.121     -.158323    .0186986
                      Providence  |  -.0388722   .0478052    -0.81   0.417    -.1332609    .0555166
                          Pueblo  |   -.047743   .0225794    -2.11   0.036    -.0923249   -.0031611
                          Queens  |  -.0947558   .0699072    -1.36   0.177    -.2327836    .0432721
                          Quincy  |  -.0127095   .0366248    -0.35   0.729    -.0850232    .0596043
                          Racine  |  -.0281852   .0048425    -5.82   0.000    -.0377465   -.0186239
                          Revere  |  -.0273745   .0364677    -0.75   0.454     -.099378     .044629
                        Richmond  |  -.0763834    .039263    -1.95   0.053    -.1539059    .0011392
                       Rochester  |   -.024024   .0331601    -0.72   0.470    -.0894967    .0414488
                        Rockford  |  -.0531741   .0145323    -3.66   0.000    -.0818673    -.024481
                      Sacramento  |  -.0027183   .0484316    -0.06   0.955    -.0983438    .0929072
                         Saginaw  |  -.0223834   .0169501    -1.32   0.188    -.0558505    .0110837
                  Salt Lake City  |   .0332113   .0286721     1.16   0.248    -.0234001    .0898227
                     San Antonio  |   -.004486   .0420777    -0.11   0.915    -.0875661    .0785942
                       San Diego  |  -.0670513   .0592592    -1.13   0.259    -.1840554    .0499529
                   San Francisco  |    -.00036   .0834559    -0.00   0.997    -.1651391    .1644191
                        San Jose  |  -.0363262   .0663985    -0.55   0.585    -.1674265    .0947741
                        Savannah  |   .0052749   .0276038     0.19   0.849    -.0492273     .059777
                     Schenectady  |   -.079977   .0106923    -7.48   0.000    -.1010882   -.0588657
                         Seattle  |   .0667503   .0559363     1.19   0.234     -.043693    .1771936
                      Shreveport  |  -.1878384   .0558455    -3.36   0.001    -.2981023   -.0775746
                      Sioux City  |  -.1430727   .0134964   -10.60   0.000    -.1697206   -.1164248
                      Somerville  |   .0707607   .0478302     1.48   0.141    -.0236774    .1651989
                      South Bend  |  -.0017533   .0133323    -0.13   0.896    -.0280771    .0245705
                         Spokane  |  -.0415658   .0088588    -4.69   0.000     -.059057   -.0240746
                     Springfield  |  -.0319845   .0088515    -3.61   0.000    -.0494612   -.0145078
                      St. Joseph  |  -.0442874   .0123256    -3.59   0.000    -.0686235   -.0199512
                       St. Louis  |  -.0254116   .0389195    -0.65   0.515     -.102256    .0514327
                        St. Paul  |   .0543116   .0312785     1.74   0.084     -.007446    .1160692
                  St. Petersburg  |  -.0529696   .0314353    -1.69   0.094    -.1150368    .0090976
Stamford, Darien, and New Canaan  |  -.1632426   .0661437    -2.47   0.015    -.2938397   -.0326454
                   Staten Island  |   -.202285   .0439232    -4.61   0.000    -.2890091    -.115561
                        Stockton  |  -.0796548   .0514586    -1.55   0.124     -.181257    .0219474
                        Syracuse  |   -.009511   .0125939    -0.76   0.451     -.034377     .015355
                          Tacoma  |  -.0037876   .0292311    -0.13   0.897    -.0615028    .0539275
                           Tampa  |  -.1253656   .0449933    -2.79   0.006    -.2142023   -.0365288
                     Terre Haute  |   -.074775   .0054575   -13.70   0.000    -.0855505   -.0639995
                          Toledo  |  -.0125463   .0161397    -0.78   0.438    -.0444132    .0193206
                          Topeka  |  -.0328287     .01257    -2.61   0.010    -.0576474     -.00801
                         Trenton  |  -.0786761   .0549608    -1.43   0.154    -.1871931     .029841
                           Tulsa  |  -.0872603   .0355308    -2.46   0.015     -.157414   -.0171067
                       Union Co.  |   -.134039   .0646504    -2.07   0.040    -.2616876   -.0063903
                           Utica  |  -.0549801   .0105116    -5.23   0.000    -.0757347   -.0342254
                            Waco  |    -.12323   .0325613    -3.78   0.000    -.1875205   -.0589395
                          Warren  |   .0447058   .0228871     1.95   0.052    -.0004835    .0898951
                       Waterbury  |  -.1227729   .0400223    -3.07   0.003    -.2017947    -.043751
                        Waterloo  |  -.0019077    .008179    -0.23   0.816    -.0180567    .0142413
                       Watertown  |  -.0223407   .0430548    -0.52   0.605    -.1073501    .0626687
                         Wichita  |  -.1046963   .0289933    -3.61   0.000    -.1619419   -.0474506
                    Wilkes-Barre  |  -.0732661   .0086688    -8.45   0.000    -.0903821   -.0561501
                   Winston-Salem  |  -.0376729   .0340109    -1.11   0.270    -.1048256    .0294797
                      Woonsocket  |  -.0936919    .006835   -13.71   0.000    -.1071873   -.0801966
                            York  |  -.0569805   .0343034    -1.66   0.099    -.1247108    .0107498
                      Youngstown  |  -.0121583   .0165624    -0.73   0.464    -.0448599    .0205433
                                  |
                            _cons |   .9847629     .05289    18.62   0.000     .8803344    1.089191
---------------------------------------------------------------------------------------------------

. scalar clust = e(N_clust);

. estadd local city_controls "Yes": reg_baseline_clust reg_base_c_d reg_all*;

.  estadd local cluster_se "City": reg_baseline_clust reg_base_c_d reg_all*;

. estadd scalar clust: reg_baseline_clust reg_base_c_d reg_all*;

. #delimit cr
delimiter now cr
. 
. * Export regressions
. 
. #delimit ;
delimiter now ;
. esttab reg_* using "$OUTPUT_PATH/main_regressions.tex", 
>         se star(* 0.10 **       0.05 *** 0.01) ar2 replace booktabs label
>         drop(*.city2)
>         stats(city_controls cluster_se clust N r2_a, label("City fixed effects"
>         "Clustered SE" "Clusters" "Observations" "Adjusted R$^2$"));
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/main_regressions.tex)

. #delimit cr
delimiter now cr
. 
end of do-file

