------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/regression_analysis_log.log
  log type:  text
 opened on:  31 Mar 2023, 10:54:14

. 
. cd "$INPUT_PATH/Merge"
C:\Users\lijia\OneDrive - University of Toronto\Documents\School\1-5 ECO375\ECO375 Project\1 - Data\Merge

. 
. * Load collapsed data for regression
. use "HOLC_Voting_Covariates.dta", clear

. drop _merge

. replace _yr_median = _yr_median / 1000
variable _yr_median was long now double
(81,058 real changes made)

. replace male_female_ratio = male_female_ratio / 100
(81,630 real changes made)

. 
. 
. * label dataset
. foreach var of varlist perc_tract_a-perc_tract_d{
  2.         local name = "Grade " + strupper(substr("`var'", 12, 1)) + " share"
  3.         label variable `var' "`name'" 
  4. }

. label variable city "City"

. label variable state "State"

. label variable tract_dvoteshare "Dem share"

. label variable _yr_median "Median income ('000s)"

. label variable median_age "Median age"

. label variable male_female_ratio "M-F ratio"

. label variable perc_less_hs_total "Less HS share"

. label variable perc_hs_total "HS share"

. label variable perc_somecol_total "Some college share"

. label variable perc_bach_total "Bachelor's share"

. label variable perc_pop_white "White share"

. label variable perc_pop_black "Black share"

. label variable perc_pop_asian "Asian share"

. 
. * Generate variable that indicates if a tract has sufficient data for analysis
. gen incl = 0

. replace incl = 1 if tract_dem_total != . & pop_white != . & _yr_median != . & median_age != . & male_female_ratio != . & perc_less_hs_total != . & tract_holc_share > 0.9
(6,037 real changes made)

. 
. * Scatter plot
. twoway(scatter tract_dvoteshare perc_tract_d if incl == 1, msize(0.8))

. graph export "$OUTPUT_PATH\baseline_scatter.png", as(png) replace
file C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output\baseline_scatter.png saved as PNG format

. 
. * Generate summary statistics
. eststo sum_stat: estpost sum perc_tract_a-perc_tract_d tract_dvoteshare _yr_median median_age male_female_ratio perc_less_hs_total-perc_pop_asian if incl == 1

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)     e(min)     e(max)     e(sum) 
-------------+----------------------------------------------------------------------------------------
perc_tract_a |      6037       6037   .0516427   .0328612   .1812766          0          1    311.767 
perc_tract_b |      6037       6037   .2021535   .1124576    .335347          0          1   1220.401 
perc_tract_c |      6037       6037   .4538389   .1774458   .4212432          0          1   2739.826 
perc_tract_d |      6037       6037   .2776069   .1610121   .4012631          0          1   1675.913 
tract_dvot~e |      6037       6037   .7909097    .022159   .1488592   .0415478   .9785084   4774.722 
  _yr_median |      6037       6037   63.29363   1309.742   36.19036      6.322    250.001   382103.7 
  median_age |      6037       6037   36.12288   42.12672    6.49051       10.9       72.4   218073.8 
male_femal~o |      6037       6037   .9592339   .0412546   .2031124       .347      4.103   5790.895 
perc_less_~l |      6037       6037   .1619312    .013814   .1175331          0   .6462625   977.5785 
perc_hs_to~l |      6037       6037   .2507817   .0139681   .1181865          0   .7152256   1513.969 
perc_somec~l |      6037       6037   .2595165    .008979   .0947578   .0181473   .8688588   1566.701 
perc_bach_~l |      6037       6037   .3277707   .0536542   .2316338    .007326   .9444444   1978.752 
perc_pop_w~e |      6037       6037   .3987024   .0837689   .2894286    .001224   .9546859   2406.966 
perc_pop_b~k |      6037       6037   .2690759   .0908455   .3014059          0   .9755827   1624.411 
perc_pop_a~n |      6037       6037   .0887311   .0173264   .1316299          0   .9106402   535.6694 

. eststo sum_stat_not: estpost sum tract_dvoteshare _yr_median median_age male_female_ratio perc_less_hs_total-perc_pop_asian if incl == 0

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)     e(min)     e(max)     e(sum) 
-------------+----------------------------------------------------------------------------------------
tract_dvot~e |     76139      76139   .5140869   .0426495   .2065176          0          1   39142.06 
  _yr_median |     75021      75021   71.26891   1222.595   34.96563        2.5    250.001    5346665 
  median_age |     75593      75593   40.10494   70.89318   8.419809         10       89.2    3031653 
male_femal~o |     75593      75593   1.274395   275.7692    16.6063       .002     2429.5   96335.38 
perc_less_~l |     75701      75701   .1159115    .008715   .0933539          0          1   8774.619 
perc_hs_to~l |     75701      75701   .2798743   .0125791   .1121568          0          1   21186.76 
perc_somec~l |     75701      75701   .3096218   .0081865    .090479          0          1   23438.68 
perc_bach_~l |     75701      75701   .2945924   .0338244    .183914          0          1   22300.94 
perc_pop_w~e |     75930      75930   .6534288   .0665819   .2580346          0          1   49614.85 
perc_pop_b~k |     75930      75930   .1211771   .0358433   .1893234          0          1    9200.98 
perc_pop_a~n |     75930      75930   .0532894   .0088434   .0940395          0          1   4046.263 

. 
. esttab sum_stat sum_stat_not using "$OUTPUT_PATH\sum_stat.tex", ///
> cells("count(pattern(1 1) fmt(%8.0f)) mean(fmt(%8.3g) pattern(1 1)) sd(fmt(%8.3g) pattern(1 1)) min(fmt(%8.3g) pattern(1 1)) max(fmt(%8.3g) pattern(1 1))") /// 
> label mtitles("Census tracts in study" "Census tracts not in study") nodepvar nonumbers booktabs replace
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output\sum_stat.tex)

. * Regression
. eststo reg_baseline: regress tract_dvoteshare perc_tract_d if incl == 1, robust

Linear regression                               Number of obs     =      6,037
                                                F(1, 6035)        =     321.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0399
                                                Root MSE          =     .14587

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0741109   .0041355    17.92   0.000     .0660038     .082218
       _cons |    .770336   .0024012   320.82   0.000     .7656288    .7750431
------------------------------------------------------------------------------

. esttab reg_baseline using "$OUTPUT_PATH/base_regression.tex", ///
> se star(* 0.10 **       0.05 *** 0.01) replace booktabs label
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/base_regression.tex)

. estadd local city_controls "No"

added macro:
      e(city_controls) : "No"

. estadd local cluster_se "No"

added macro:
         e(cluster_se) : "No"

. 
. 
. * Robustness check -- does changing the tract_holc_share cutoff affect results?
. quietly

. foreach min_perc of numlist 0 5:100 {
  2.         eststo robustness_`min_perc': reg tract_dvoteshare perc_tract_d if tract_holc_share*100 >= `min_perc', robust
  3. }

Linear regression                               Number of obs     =     16,363
                                                F(1, 16361)       =    1483.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0608
                                                Root MSE          =     .15839

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1302126   .0033806    38.52   0.000     .1235862    .1368391
       _cons |   .7172509   .0014744   486.47   0.000      .714361    .7201409
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     14,593
                                                F(1, 14591)       =    1086.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0525
                                                Root MSE          =     .15415

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1130163   .0034288    32.96   0.000     .1062954    .1197371
       _cons |    .729631    .001545   472.25   0.000     .7266026    .7326595
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     14,081
                                                F(1, 14079)       =     985.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0502
                                                Root MSE          =     .15298

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1081631   .0034456    31.39   0.000     .1014093     .114917
       _cons |   .7332124   .0015692   467.27   0.000     .7301367    .7362882
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     13,638
                                                F(1, 13636)       =     914.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0486
                                                Root MSE          =     .15222

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1046589   .0034615    30.24   0.000     .0978739    .1114438
       _cons |   .7360549   .0015935   461.90   0.000     .7329313    .7391785
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     13,228
                                                F(1, 13226)       =     852.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0472
                                                Root MSE          =     .15145

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .1014156   .0034739    29.19   0.000     .0946063     .108225
       _cons |   .7388256   .0016153   457.40   0.000     .7356594    .7419917
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     12,825
                                                F(1, 12823)       =     795.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0459
                                                Root MSE          =     .15052

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0982716   .0034851    28.20   0.000     .0914402     .105103
       _cons |    .741394   .0016352   453.40   0.000     .7381888    .7445992
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     12,413
                                                F(1, 12411)       =     739.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0445
                                                Root MSE          =     .14988

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0951203   .0034987    27.19   0.000     .0882623    .1019782
       _cons |   .7440399   .0016599   448.26   0.000     .7407864    .7472935
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     12,010
                                                F(1, 12008)       =     700.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0441
                                                Root MSE          =     .14892

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0930007   .0035126    26.48   0.000     .0861154     .099886
       _cons |   .7462973   .0016843   443.09   0.000     .7429958    .7495988
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     11,582
                                                F(1, 11580)       =     664.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0435
                                                Root MSE          =     .14865

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0910715   .0035324    25.78   0.000     .0841475    .0979955
       _cons |   .7481665   .0017165   435.86   0.000     .7448018    .7515312
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     11,176
                                                F(1, 11174)       =     632.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0430
                                                Root MSE          =     .14845

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0893263   .0035518    25.15   0.000     .0823641    .0962885
       _cons |   .7497548   .0017467   429.23   0.000     .7463309    .7531787
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     10,661
                                                F(1, 10659)       =     597.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0429
                                                Root MSE          =     .14768

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0873752   .0035757    24.44   0.000     .0803662    .0943842
       _cons |   .7523972   .0017829   422.01   0.000     .7489024     .755892
------------------------------------------------------------------------------

Linear regression                               Number of obs     =     10,135
                                                F(1, 10133)       =     555.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0422
                                                Root MSE          =     .14696

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0849367   .0036045    23.56   0.000     .0778713    .0920022
       _cons |   .7553551   .0018276   413.31   0.000     .7517727    .7589374
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      9,666
                                                F(1, 9664)        =     518.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0414
                                                Root MSE          =     .14637

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0827288   .0036342    22.76   0.000      .075605    .0898526
       _cons |   .7572714    .001867   405.61   0.000     .7536117    .7609311
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      9,175
                                                F(1, 9173)        =     491.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0412
                                                Root MSE          =     .14635

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |    .081482   .0036761    22.17   0.000      .074276    .0886881
       _cons |   .7586105   .0019165   395.82   0.000     .7548537    .7623673
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      8,628
                                                F(1, 8626)        =     452.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0404
                                                Root MSE          =     .14653

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0795624   .0037384    21.28   0.000     .0722343    .0868905
       _cons |   .7606502   .0019854   383.13   0.000     .7567584     .764542
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      8,069
                                                F(1, 8067)        =     415.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0396
                                                Root MSE          =     .14666

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0776134   .0038086    20.38   0.000     .0701475    .0850793
       _cons |   .7628806   .0020577   370.75   0.000      .758847    .7669142
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      7,445
                                                F(1, 7443)        =     388.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0398
                                                Root MSE          =     .14624

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0764053   .0038784    19.70   0.000     .0688026     .084008
       _cons |   .7654309   .0021451   356.84   0.000      .761226    .7696358
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      6,755
                                                F(1, 6753)        =     366.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0410
                                                Root MSE          =      .1458

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0759771   .0039661    19.16   0.000     .0682022     .083752
       _cons |   .7674711   .0022587   339.79   0.000     .7630434    .7718989
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      6,084
                                                F(1, 6082)        =     321.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0401
                                                Root MSE          =     .14608

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0741973   .0041352    17.94   0.000     .0660907    .0823038
       _cons |   .7706248   .0023961   321.61   0.000     .7659275     .775322
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,207
                                                F(1, 5205)        =     288.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0409
                                                Root MSE          =     .14601

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0741168    .004364    16.98   0.000     .0655615    .0826721
       _cons |   .7752414   .0025946   298.79   0.000     .7701549    .7803279
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      3,011
                                                F(1, 3009)        =     174.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0425
                                                Root MSE          =      .1437

------------------------------------------------------------------------------
             |               Robust
tract_dvot~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0714881   .0054135    13.21   0.000     .0608735    .0821027
       _cons |   .7857163   .0034408   228.35   0.000     .7789697    .7924629
------------------------------------------------------------------------------

. esttab robustness_* using "$OUTPUT_PATH/min_tract_holc_share_robustness.csv", se star(* 0.10 ** 0.05 *** 0.01) replace
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/min_tract_holc_share_robustness.csv)

. 
. drop _est_robustness*

. 
. * Robustness check -- does changing the way we measure redlining affect results?
. eststo robustness2_d: regress tract_dvoteshare perc_tract_d if incl == 1

      Source |       SS           df       MS      Number of obs   =     6,037
-------------+----------------------------------   F(1, 6035)      =    250.86
       Model |  5.33792183         1  5.33792183   Prob > F        =    0.0000
    Residual |  128.414099     6,035  .021278227   R-squared       =    0.0399
-------------+----------------------------------   Adj R-squared   =    0.0398
       Total |  133.752021     6,036  .022159049   Root MSE        =    .14587

------------------------------------------------------------------------------
tract_dvot~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_d |   .0741109   .0046791    15.84   0.000     .0649382    .0832837
       _cons |    .770336    .002283   337.43   0.000     .7658605    .7748114
------------------------------------------------------------------------------

. gen perc_tract_c_plus_d = perc_tract_c + perc_tract_d
(65,957 missing values generated)

. eststo robustness2_c_plus_d: regress tract_dvoteshare perc_tract_c_plus_d if incl == 1

      Source |       SS           df       MS      Number of obs   =     6,037
-------------+----------------------------------   F(1, 6035)      =    117.81
       Model |   2.5609683         1   2.5609683   Prob > F        =    0.0000
    Residual |  131.191052     6,035  .021738368   R-squared       =    0.0191
-------------+----------------------------------   Adj R-squared   =    0.0190
       Total |  133.752021     6,036  .022159049   Root MSE        =    .14744

-------------------------------------------------------------------------------------
   tract_dvoteshare | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
perc_tract_c_plus_d |   .0536943    .004947    10.85   0.000     .0439965    .0633922
              _cons |   .7516352   .0040858   183.96   0.000     .7436255    .7596449
-------------------------------------------------------------------------------------

. eststo robustness2_c_and_d: regress tract_dvoteshare perc_tract_c perc_tract_d if incl == 1

      Source |       SS           df       MS      Number of obs   =     6,037
-------------+----------------------------------   F(2, 6034)      =    136.90
       Model |  5.80572106         2  2.90286053   Prob > F        =    0.0000
    Residual |  127.946299     6,034  .021204226   R-squared       =    0.0434
-------------+----------------------------------   Adj R-squared   =    0.0431
       Total |  133.752021     6,036  .022159049   Root MSE        =    .14562

------------------------------------------------------------------------------
tract_dvot~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_c |   .0253473   .0053965     4.70   0.000     .0147682    .0359264
perc_tract_d |   .0891682   .0056652    15.74   0.000     .0780624    .1002741
       _cons |   .7546523   .0040427   186.67   0.000     .7467272    .7625774
------------------------------------------------------------------------------

. eststo robustness2_b_c_d: regress tract_dvoteshare perc_tract_a perc_tract_c perc_tract_d if incl == 1

      Source |       SS           df       MS      Number of obs   =     6,037
-------------+----------------------------------   F(3, 6033)      =     91.62
       Model |   5.8280358         3   1.9426786   Prob > F        =    0.0000
    Residual |  127.923985     6,033  .021204042   R-squared       =    0.0436
-------------+----------------------------------   Adj R-squared   =    0.0431
       Total |  133.752021     6,036  .022159049   Root MSE        =    .14562

------------------------------------------------------------------------------
tract_dvot~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
perc_tract_a |  -.0120973   .0117924    -1.03   0.305    -.0352146      .01102
perc_tract_c |   .0225448   .0060486     3.73   0.000     .0106875    .0344022
perc_tract_d |    .086492    .006237    13.87   0.000     .0742652    .0987188
       _cons |   .7572919    .004792   158.03   0.000     .7478978     .766686
------------------------------------------------------------------------------

. 
. esttab robustness2_* using "$OUTPUT_PATH/redlining_measure_robustness.csv", se star(* 0.10 ** 0.05 *** 0.01) replace
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/redlining_measure_robustness.csv)

. 
. noisily

. * Regression with selected covariates
. regress tract_dvoteshare perc_tract_d _yr_median perc_pop_white perc_pop_black ///
> perc_pop_asian if incl == 1, robust

Linear regression                               Number of obs     =      6,037
                                                F(5, 6031)        =    1451.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4370
                                                Root MSE          =     .11174

--------------------------------------------------------------------------------
               |               Robust
tract_dvotes~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
  perc_tract_d |   .0381094   .0031384    12.14   0.000     .0319569    .0442618
    _yr_median |   .0012693   .0000606    20.95   0.000     .0011506    .0013881
perc_pop_white |  -.2078096   .0083556   -24.87   0.000    -.2241896   -.1914296
perc_pop_black |   .1868107   .0043496    42.95   0.000     .1782839    .1953375
perc_pop_asian |  -.1565854   .0115017   -13.61   0.000    -.1791329   -.1340379
         _cons |   .7464725   .0042465   175.79   0.000     .7381478    .7547971
--------------------------------------------------------------------------------

. 
. * Regression with selected covariates and city fixed effects
. drop perc_tract_c_plus_d

. 
. encode city, generate(city2)

. gen perc_tract_d_sq = perc_tract_d^2
(65,957 missing values generated)

. gen perc_tract_d_cu = perc_tract_d^3
(65,957 missing values generated)

. label variable perc_tract_d_sq "Grade D squared"

. label variable perc_tract_d_cu "Grade D cubed"

. 
. gen perc_tract_c_sq = perc_tract_c^2
(65,957 missing values generated)

. gen perc_tract_c_cu = perc_tract_c^3
(65,957 missing values generated)

. label variable perc_tract_c_sq "Grade C squared"

. label variable perc_tract_c_cu "Grade C cubed"

. 
. global indep_vars perc_tract_d* perc_tract_c*

. global controls _yr_median-male_female_ratio perc_hs_total-perc_pop_asian

. 
. #delimit ;
delimiter now ;
. eststo reg_base_c_d: regress tract_dvoteshare perc_tract_d perc_tract_c
> i.city2 if incl == 1, cluster(city2);

Linear regression                               Number of obs     =      6,037
                                                F(1, 165)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2835
                                                Root MSE          =     .12778

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |   .0807206   .0178061     4.53   0.000     .0455635    .1158778
                     perc_tract_c |   .0225349   .0114707     1.96   0.051    -.0001134    .0451832
                                  |
                            city2 |
                          Albany  |    .139777   .0045294    30.86   0.000      .130834    .1487201
                         Altoona  |  -.3177954    .001791  -177.45   0.000    -.3213315   -.3142592
                        Amarillo  |  -.3045436   .0073381   -41.50   0.000    -.3190323   -.2900548
                       Arlington  |   .1762503   .0028772    61.26   0.000     .1705694    .1819311
                         Atlanta  |   .1613586   .0060198    26.80   0.000     .1494729    .1732443
                   Atlantic City  |   .1172116   .0095481    12.28   0.000     .0983595    .1360638
                         Augusta  |   .2189158   .0199071    11.00   0.000     .1796102    .2582213
                          Aurora  |    .102025   .0090214    11.31   0.000     .0842127    .1198373
                          Austin  |   .1463069   .0091854    15.93   0.000     .1281707     .164443
                       Baltimore  |   .2151316   .0073747    29.17   0.000     .2005705    .2296926
                        Bay City  |  -.1232871    .008908   -13.84   0.000    -.1408754   -.1056987
                        Beaumont  |   .2284707   .0040449    56.48   0.000     .2204843    .2364571
                         Belmont  |   .1307677   .0010333   126.56   0.000     .1287276    .1328078
                      Bergen Co.  |  -.0218514    .000851   -25.68   0.000    -.0235317   -.0201711
                      Birmingham  |   .1665966   .0085158    19.56   0.000     .1497825    .1834106
                          Boston  |   .1663104   .0048817    34.07   0.000     .1566718     .175949
                        Brockton  |   .1550301   .0037469    41.38   0.000      .147632    .1624283
                           Bronx  |   .1400204   .0036198    38.68   0.000     .1328734    .1471675
                       Brookline  |   .2077012    .003146    66.02   0.000     .2014895    .2139129
                        Brooklyn  |   .0347908   .0060798     5.72   0.000     .0227866    .0467949
                         Buffalo  |   .1424962   .0015273    93.30   0.000     .1394806    .1455118
                       Cambridge  |   .1953535   .0058562    33.36   0.000     .1837907    .2069163
                          Camden  |   .0204473   .0011164    18.31   0.000      .018243    .0226517
                          Canton  |   .0077029   .0020851     3.69   0.000      .003586    .0118197
                       Charlotte  |   .0555173   .0058982     9.41   0.000     .0438715     .067163
                     Chattanooga  |   .0537718   .0001894   283.94   0.000     .0533979    .0541457
                         Chelsea  |   .0892923   .0063948    13.96   0.000      .076666    .1019185
                         Chicago  |   .1732717   .0040427    42.86   0.000     .1652895    .1812538
                       Cleveland  |   .1301269   .0025695    50.64   0.000     .1250536    .1352003
                        Columbia  |   .0562753   .0070863     7.94   0.000     .0422838    .0702669
                        Columbus  |   .1221105    .002068    59.05   0.000     .1180273    .1261937
                  Council Bluffs  |   -.201655   .0096104   -20.98   0.000    -.2206302   -.1826797
                          Dallas  |   .0428584    .001065    40.24   0.000     .0407557    .0449611
                       Davenport  |  -.0686097   .0013976   -49.09   0.000    -.0713692   -.0658502
                          Dayton  |   .0304432   .0029032    10.49   0.000      .024711    .0361754
                         Decatur  |   .0095952    .001543     6.22   0.000     .0065487    .0126417
                          Denver  |   .1618306   .0035238    45.92   0.000      .154873    .1687882
                      Des Moines  |   .0063954   .0049583     1.29   0.199    -.0033945    .0161853
                         Detroit  |   .1373333   .0036602    37.52   0.000     .1301065    .1445602
                         Dubuque  |  -.0733128   .0054125   -13.55   0.000    -.0839995    -.062626
                          Duluth  |   .1041812   .0023149    45.00   0.000     .0996106    .1087519
                          Durham  |   .2116453   .0110764    19.11   0.000     .1897756    .2335151
                  East St. Louis  |   .2655932   .0070054    37.91   0.000     .2517614     .279425
                         El Paso  |   .0729012   .0051354    14.20   0.000     .0627617    .0830407
                          Elmira  |  -.1040794   .0016572   -62.80   0.000    -.1073515   -.1008073
                            Erie  |  -.0004494   .0018204    -0.25   0.805    -.0040436    .0031447
                       Essex Co.  |   .1711294   .0042391    40.37   0.000     .1627596    .1794992
                      Evansville  |  -.0402161   .0014932   -26.93   0.000    -.0431644   -.0372679
                         Everett  |   .0117521   .0031891     3.69   0.000     .0054555    .0180488
                           Flint  |   .2861771   .0012202   234.53   0.000     .2837678    .2885863
                      Fort Wayne  |   .0066187   .0012945     5.11   0.000     .0040628    .0091745
                      Fort Worth  |   .0486044   .0067883     7.16   0.000     .0352013    .0620075
                          Fresno  |   .0625274   .0021358    29.28   0.000     .0583103    .0667445
                       Galveston  |  -.0015682   .0064571    -0.24   0.808    -.0143174     .011181
                    Grand Rapids  |   .0485822    .001162    41.81   0.000      .046288    .0508764
             Greater Kansas City  |   .1226409   .0078754    15.57   0.000     .1070913    .1381905
                      Greensboro  |   .1772128   .0010172   174.22   0.000     .1752045    .1792211
                      Harrisburg  |   .1880319   .0076368    24.62   0.000     .1729535    .2031103
                        Hartford  |   .1950755   .0002878   677.74   0.000     .1945072    .1956439
                Holyoke Chicopee  |  -.0430026   .0012754   -33.72   0.000    -.0455208   -.0404844
                         Houston  |   .1168229   .0063376    18.43   0.000     .1043097    .1293361
                      Hudson Co.  |   .0395989   .0072709     5.45   0.000     .0252429    .0539548
                    Indianapolis  |   .0506236   .0033529    15.10   0.000     .0440035    .0572437
                         Jackson  |  -.0300101   .0046712    -6.42   0.000    -.0392332    -.020787
                    Jacksonville  |     .06874   .0085536     8.04   0.000     .0518513    .0856287
                       Johnstown  |  -.2521813   .0029297   -86.08   0.000    -.2579658   -.2463968
                          Joliet  |   .0079536   .0028011     2.84   0.005      .002423    .0134842
                         Kenosha  |  -.1441475   .0036348   -39.66   0.000    -.1513242   -.1369709
                       Knoxville  |  -.0070563    .006869    -1.03   0.306    -.0206187    .0065061
                   Lake Co. Gary  |   .2116601   .0050158    42.20   0.000     .2017567    .2215635
                         Lansing  |    .064468   .0020704    31.14   0.000     .0603801     .068556
                            Lima  |  -.1286817   .0009889  -130.13   0.000    -.1306342   -.1267292
                         Lincoln  |  -.0056514   .0013506    -4.18   0.000     -.008318   -.0029848
                     Little Rock  |   .2116313   .0016147   131.06   0.000     .2084431    .2148195
                     Los Angeles  |   .1116067   .0033606    33.21   0.000     .1049715     .118242
           Lower Westchester Co.  |   .0212071   .0035354     6.00   0.000     .0142267    .0281875
                           Macon  |   .0862736   .0184717     4.67   0.000     .0498023    .1227449
                         Madison  |   .1708272   .0017232    99.13   0.000     .1674248    .1742296
                          Malden  |   .0119139   .0096527     1.23   0.219    -.0071449    .0309726
                      Manchester  |  -.0955105   .0021033   -45.41   0.000    -.0996634   -.0913576
                       Manhattan  |   .1633774   .0125035    13.07   0.000     .1386898    .1880649
                         Medford  |   .0361417   .0028294    12.77   0.000     .0305552    .0417282
                         Melrose  |   .0555761   .0012542    44.31   0.000     .0530998    .0580525
                         Memphis  |   .1561433   .0071651    21.79   0.000     .1419961    .1702904
                           Miami  |  -.0568873   .0036432   -15.61   0.000    -.0640806    -.049694
                   Milwaukee Co.  |   .1366297   .0051695    26.43   0.000     .1264228    .1468365
                     Minneapolis  |   .2085494   .0028354    73.55   0.000      .202951    .2141477
                          Mobile  |  -.0360439   .0053784    -6.70   0.000    -.0466633   -.0254245
                      Montgomery  |   .0544198   .0091106     5.97   0.000     .0364315    .0724081
                        Muskegon  |   .2266085   .0133238    17.01   0.000     .2003014    .2529157
                       Nashville  |   .0288981   .0103028     2.80   0.006     .0085558    .0492404
                     New Britain  |    .020103   .0008914    22.55   0.000     .0183429     .021863
                      New Castle  |  -.1704362    .004885   -34.89   0.000    -.1800814    -.160791
                       New Haven  |    .019869    .001024    19.40   0.000     .0178472    .0218909
                     New Orleans  |   .1640218   .0087407    18.77   0.000     .1467638    .1812798
                          Newton  |   .1571823   .0011346   138.53   0.000      .154942    .1594225
                   Niagara Falls  |   .0349999   .0022688    15.43   0.000     .0305202    .0394797
                         Norfolk  |   .1543787   .0096039    16.07   0.000     .1354164    .1733411
                         Oakland  |   .2277231   .0044808    50.82   0.000      .218876    .2365702
                           Ogden  |  -.1302106    .004685   -27.79   0.000    -.1394608   -.1209603
                   Oklahoma City  |   .0199627   .0022095     9.03   0.000     .0156002    .0243252
                           Omaha  |   .0523163   .0043585    12.00   0.000     .0437106    .0609221
                         Oshkosh  |  -.1202115   .0153329    -7.84   0.000    -.1504854   -.0899376
       Pawtucket & Central Falls  |   .0275259   .0030731     8.96   0.000     .0214583    .0335935
                          Peoria  |   .1125198   .0063881    17.61   0.000     .0999069    .1251326
                    Philadelphia  |   .1691052   .0082261    20.56   0.000     .1528632    .1853472
                         Phoenix  |   .1152711   .0066435    17.35   0.000     .1021538    .1283884
                      Pittsburgh  |   .1156913   .0045541    25.40   0.000     .1066995    .1246831
                         Pontiac  |   .1745531   .0043392    40.23   0.000     .1659856    .1831206
                     Port Arthur  |   .1222176   .0056103    21.78   0.000     .1111403    .1332949
                        Portland  |   .2113074   .0033131    63.78   0.000     .2047659    .2178489
                    Poughkeepsie  |   .1003471   .0036097    27.80   0.000       .09322    .1074743
                      Providence  |    .115085   .0011684    98.50   0.000      .112778     .117392
                          Pueblo  |  -.0265054   .0042238    -6.28   0.000     -.034845   -.0181657
                          Queens  |   .0797389   .0027083    29.44   0.000     .0743915    .0850863
                          Quincy  |  -.0029113   .0024537    -1.19   0.237    -.0077561    .0019335
                          Racine  |  -.0565199    .000218  -259.25   0.000    -.0569504   -.0560894
                          Revere  |  -.0130194   .0053343    -2.44   0.016    -.0235517    -.002487
                        Richmond  |   .0919979   .0010062    91.43   0.000     .0900113    .0939846
                       Rochester  |   .1620268   .0033465    48.42   0.000     .1554193    .1686342
                        Rockford  |  -.0312037   .0049569    -6.29   0.000     -.040991   -.0214165
                      Sacramento  |    .140475   .0033147    42.38   0.000     .1339303    .1470197
                         Saginaw  |   .0649665   .0023902    27.18   0.000     .0602471    .0696858
                  Salt Lake City  |   .0987142    .005844    16.89   0.000     .0871756    .1102528
                     San Antonio  |   .0785879   .0064576    12.17   0.000     .0658377    .0913381
                       San Diego  |   .0859268   .0063447    13.54   0.000     .0733996     .098454
                   San Francisco  |   .1633214   .0061683    26.48   0.000     .1511424    .1755004
                        San Jose  |   .1206712   .0034816    34.66   0.000      .113797    .1275454
                        Savannah  |   .2216295   .0007707   287.55   0.000     .2201077    .2231513
                     Schenectady  |  -.1230577    .004595   -26.78   0.000    -.1321304   -.1139851
                         Seattle  |   .2201946   .0037259    59.10   0.000     .2128381    .2275512
                      Shreveport  |   .0976668   .0019278    50.66   0.000     .0938604    .1014732
                      Sioux City  |  -.1688165   .0059764   -28.25   0.000    -.1806166   -.1570164
                      Somerville  |   .2133893   .0034112    62.56   0.000     .2066541    .2201244
                      South Bend  |   .0419125    .001033    40.57   0.000     .0398728    .0439522
                         Spokane  |   -.083223   .0014544   -57.22   0.000    -.0860946   -.0803514
                     Springfield  |  -.0067122   .0082308    -0.82   0.416    -.0229634     .009539
                      St. Joseph  |  -.1781947   .0192591    -9.25   0.000    -.2162207   -.1401687
                       St. Louis  |   .1964293   .0036807    53.37   0.000     .1891621    .2036966
                        St. Paul  |   .1474984   .0039937    36.93   0.000      .139613    .1553838
                  St. Petersburg  |   .0861283   .0049975    17.23   0.000     .0762609    .0959957
Stamford, Darien, and New Canaan  |   .0554374   .0043768    12.67   0.000     .0467956    .0640792
                   Staten Island  |   -.135675   .0056717   -23.92   0.000    -.1468736   -.1244765
                        Stockton  |   .0598988   .0024445    24.50   0.000     .0550722    .0647253
                        Syracuse  |   .0625751   .0005918   105.73   0.000     .0614066    .0637436
                          Tacoma  |   .0117095   .0042321     2.77   0.006     .0033535    .0200655
                           Tampa  |   .0292867   .0120238     2.44   0.016     .0055463     .053027
                     Terre Haute  |   -.082234   .0041457   -19.84   0.000    -.0904195   -.0740485
                          Toledo  |   .0755353   .0013812    54.69   0.000     .0728081    .0782624
                          Topeka  |  -.0252406   .0037439    -6.74   0.000    -.0326328   -.0178484
                         Trenton  |   .1486415   .0017453    85.17   0.000     .1451956    .1520874
                           Tulsa  |   .0155288   .0057483     2.70   0.008     .0041791    .0268785
                       Union Co.  |   .0627892     .00155    40.51   0.000     .0597287    .0658496
                           Utica  |  -.0654487   .0015003   -43.62   0.000    -.0684109   -.0624865
                            Waco  |   .0376151   .0020204    18.62   0.000      .033626    .0416043
                          Warren  |  -.0516494   .0034854   -14.82   0.000    -.0585312   -.0447676
                       Waterbury  |   .0370357   .0024178    15.32   0.000     .0322618    .0418095
                        Waterloo  |   .0003114   .0071957     0.04   0.966     -.013896    .0145189
                       Watertown  |   .0848636   .0058202    14.58   0.000      .073372    .0963553
                         Wichita  |  -.0597427   .0128905    -4.63   0.000    -.0851943   -.0342912
                    Wilkes-Barre  |  -.0676892   .0056103   -12.07   0.000    -.0787665   -.0566119
                   Winston-Salem  |   .1886634   .0071583    26.36   0.000     .1745297    .2027971
                      Woonsocket  |  -.1175898   .0031342   -37.52   0.000    -.1237781   -.1114015
                            York  |    .051192   .0041351    12.38   0.000     .0430275    .0593564
                      Youngstown  |     .05894   .0040333    14.61   0.000     .0509765    .0669034
                                  |
                            _cons |   .6506468   .0056103   115.97   0.000     .6395695    .6617242
---------------------------------------------------------------------------------------------------

. testparm i.city2;

 ( 1)  2.city2 = 0
 ( 2)  3.city2 = 0
 ( 3)  4.city2 = 0
 ( 4)  5.city2 = 0
 ( 5)  7.city2 = 0
 ( 6)  8.city2 = 0
 ( 7)  9.city2 = 0
 ( 8)  10.city2 = 0
 ( 9)  11.city2 = 0
 (10)  12.city2 = 0
 (11)  14.city2 = 0
 (12)  15.city2 = 0
 (13)  16.city2 = 0
 (14)  17.city2 = 0
 (15)  20.city2 = 0
 (16)  21.city2 = 0
 (17)  23.city2 = 0
 (18)  24.city2 = 0
 (19)  25.city2 = 0
 (20)  26.city2 = 0
 (21)  27.city2 = 0
 (22)  28.city2 = 0
 (23)  29.city2 = 0
 (24)  30.city2 = 0
 (25)  32.city2 = 0
 (26)  33.city2 = 0
 (27)  34.city2 = 0
 (28)  36.city2 = 0
 (29)  37.city2 = 0
 (30)  38.city2 = 0
 (31)  39.city2 = 0
 (32)  40.city2 = 0
 (33)  42.city2 = 0
 (34)  43.city2 = 0
 (35)  44.city2 = 0
 (36)  45.city2 = 0
 (37)  47.city2 = 0
 (38)  48.city2 = 0
 (39)  49.city2 = 0
 (40)  50.city2 = 0
 (41)  51.city2 = 0
 (42)  52.city2 = 0
 (43)  53.city2 = 0
 (44)  54.city2 = 0
 (45)  55.city2 = 0
 (46)  56.city2 = 0
 (47)  57.city2 = 0
 (48)  58.city2 = 0
 (49)  59.city2 = 0
 (50)  60.city2 = 0
 (51)  61.city2 = 0
 (52)  62.city2 = 0
 (53)  63.city2 = 0
 (54)  64.city2 = 0
 (55)  65.city2 = 0
 (56)  66.city2 = 0
 (57)  67.city2 = 0
 (58)  69.city2 = 0
 (59)  70.city2 = 0
 (60)  72.city2 = 0
 (61)  73.city2 = 0
 (62)  74.city2 = 0
 (63)  76.city2 = 0
 (64)  77.city2 = 0
 (65)  78.city2 = 0
 (66)  79.city2 = 0
 (67)  80.city2 = 0
 (68)  82.city2 = 0
 (69)  83.city2 = 0
 (70)  84.city2 = 0
 (71)  86.city2 = 0
 (72)  88.city2 = 0
 (73)  89.city2 = 0
 (74)  90.city2 = 0
 (75)  92.city2 = 0
 (76)  94.city2 = 0
 (77)  96.city2 = 0
 (78)  97.city2 = 0
 (79)  98.city2 = 0
 (80)  99.city2 = 0
 (81)  100.city2 = 0
 (82)  101.city2 = 0
 (83)  102.city2 = 0
 (84)  103.city2 = 0
 (85)  104.city2 = 0
 (86)  106.city2 = 0
 (87)  107.city2 = 0
 (88)  108.city2 = 0
 (89)  109.city2 = 0
 (90)  111.city2 = 0
 (91)  112.city2 = 0
 (92)  114.city2 = 0
 (93)  115.city2 = 0
 (94)  116.city2 = 0
 (95)  117.city2 = 0
 (96)  119.city2 = 0
 (97)  120.city2 = 0
 (98)  121.city2 = 0
 (99)  122.city2 = 0
 (100)  123.city2 = 0
 (101)  124.city2 = 0
 (102)  125.city2 = 0
 (103)  126.city2 = 0
 (104)  127.city2 = 0
 (105)  128.city2 = 0
 (106)  129.city2 = 0
 (107)  130.city2 = 0
 (108)  131.city2 = 0
 (109)  132.city2 = 0
 (110)  133.city2 = 0
 (111)  134.city2 = 0
 (112)  136.city2 = 0
 (113)  137.city2 = 0
 (114)  138.city2 = 0
 (115)  139.city2 = 0
 (116)  140.city2 = 0
 (117)  141.city2 = 0
 (118)  142.city2 = 0
 (119)  143.city2 = 0
 (120)  145.city2 = 0
 (121)  146.city2 = 0
 (122)  147.city2 = 0
 (123)  148.city2 = 0
 (124)  149.city2 = 0
 (125)  150.city2 = 0
 (126)  151.city2 = 0
 (127)  152.city2 = 0
 (128)  153.city2 = 0
 (129)  155.city2 = 0
 (130)  156.city2 = 0
 (131)  157.city2 = 0
 (132)  158.city2 = 0
 (133)  159.city2 = 0
 (134)  160.city2 = 0
 (135)  161.city2 = 0
 (136)  162.city2 = 0
 (137)  163.city2 = 0
 (138)  164.city2 = 0
 (139)  165.city2 = 0
 (140)  166.city2 = 0
 (141)  167.city2 = 0
 (142)  168.city2 = 0
 (143)  169.city2 = 0
 (144)  170.city2 = 0
 (145)  171.city2 = 0
 (146)  172.city2 = 0
 (147)  173.city2 = 0
 (148)  174.city2 = 0
 (149)  175.city2 = 0
 (150)  176.city2 = 0
 (151)  177.city2 = 0
 (152)  179.city2 = 0
 (153)  180.city2 = 0
 (154)  181.city2 = 0
 (155)  182.city2 = 0
 (156)  184.city2 = 0
 (157)  185.city2 = 0
 (158)  186.city2 = 0
 (159)  187.city2 = 0
 (160)  189.city2 = 0
 (161)  190.city2 = 0
 (162)  192.city2 = 0
 (163)  194.city2 = 0
 (164)  195.city2 = 0
 (165)  196.city2 = 0
       Constraint 1 dropped
       Constraint 2 dropped
       Constraint 3 dropped
       Constraint 4 dropped
       Constraint 5 dropped
       Constraint 6 dropped
       Constraint 8 dropped
       Constraint 9 dropped
       Constraint 10 dropped
       Constraint 11 dropped
       Constraint 12 dropped
       Constraint 13 dropped
       Constraint 14 dropped
       Constraint 15 dropped
       Constraint 16 dropped
       Constraint 17 dropped
       Constraint 18 dropped
       Constraint 19 dropped
       Constraint 20 dropped
       Constraint 21 dropped
       Constraint 22 dropped
       Constraint 23 dropped
       Constraint 24 dropped
       Constraint 25 dropped
       Constraint 26 dropped
       Constraint 27 dropped
       Constraint 28 dropped
       Constraint 29 dropped
       Constraint 30 dropped
       Constraint 31 dropped
       Constraint 32 dropped
       Constraint 33 dropped
       Constraint 34 dropped
       Constraint 35 dropped
       Constraint 36 dropped
       Constraint 37 dropped
       Constraint 38 dropped
       Constraint 39 dropped
       Constraint 40 dropped
       Constraint 41 dropped
       Constraint 42 dropped
       Constraint 43 dropped
       Constraint 44 dropped
       Constraint 45 dropped
       Constraint 46 dropped
       Constraint 47 dropped
       Constraint 48 dropped
       Constraint 49 dropped
       Constraint 50 dropped
       Constraint 51 dropped
       Constraint 52 dropped
       Constraint 53 dropped
       Constraint 54 dropped
       Constraint 55 dropped
       Constraint 56 dropped
       Constraint 57 dropped
       Constraint 58 dropped
       Constraint 59 dropped
       Constraint 60 dropped
       Constraint 61 dropped
       Constraint 62 dropped
       Constraint 63 dropped
       Constraint 64 dropped
       Constraint 65 dropped
       Constraint 66 dropped
       Constraint 67 dropped
       Constraint 68 dropped
       Constraint 69 dropped
       Constraint 70 dropped
       Constraint 71 dropped
       Constraint 72 dropped
       Constraint 73 dropped
       Constraint 74 dropped
       Constraint 75 dropped
       Constraint 76 dropped
       Constraint 77 dropped
       Constraint 78 dropped
       Constraint 79 dropped
       Constraint 80 dropped
       Constraint 81 dropped
       Constraint 82 dropped
       Constraint 83 dropped
       Constraint 84 dropped
       Constraint 85 dropped
       Constraint 86 dropped
       Constraint 87 dropped
       Constraint 88 dropped
       Constraint 89 dropped
       Constraint 90 dropped
       Constraint 91 dropped
       Constraint 92 dropped
       Constraint 93 dropped
       Constraint 94 dropped
       Constraint 95 dropped
       Constraint 96 dropped
       Constraint 97 dropped
       Constraint 98 dropped
       Constraint 99 dropped
       Constraint 100 dropped
       Constraint 101 dropped
       Constraint 102 dropped
       Constraint 103 dropped
       Constraint 104 dropped
       Constraint 105 dropped
       Constraint 106 dropped
       Constraint 107 dropped
       Constraint 108 dropped
       Constraint 109 dropped
       Constraint 111 dropped
       Constraint 112 dropped
       Constraint 113 dropped
       Constraint 114 dropped
       Constraint 115 dropped
       Constraint 116 dropped
       Constraint 117 dropped
       Constraint 118 dropped
       Constraint 119 dropped
       Constraint 120 dropped
       Constraint 121 dropped
       Constraint 122 dropped
       Constraint 123 dropped
       Constraint 124 dropped
       Constraint 125 dropped
       Constraint 126 dropped
       Constraint 127 dropped
       Constraint 128 dropped
       Constraint 129 dropped
       Constraint 130 dropped
       Constraint 131 dropped
       Constraint 132 dropped
       Constraint 133 dropped
       Constraint 134 dropped
       Constraint 135 dropped
       Constraint 136 dropped
       Constraint 137 dropped
       Constraint 138 dropped
       Constraint 139 dropped
       Constraint 140 dropped
       Constraint 141 dropped
       Constraint 142 dropped
       Constraint 143 dropped
       Constraint 144 dropped
       Constraint 145 dropped
       Constraint 146 dropped
       Constraint 147 dropped
       Constraint 148 dropped
       Constraint 149 dropped
       Constraint 150 dropped
       Constraint 151 dropped
       Constraint 152 dropped
       Constraint 153 dropped
       Constraint 154 dropped
       Constraint 155 dropped
       Constraint 156 dropped
       Constraint 157 dropped
       Constraint 158 dropped
       Constraint 159 dropped
       Constraint 160 dropped
       Constraint 161 dropped
       Constraint 162 dropped
       Constraint 163 dropped
       Constraint 164 dropped
       Constraint 165 dropped

       F(  2,   165) =  237.29
            Prob > F =    0.0000

. scalar f_p_value = r(F);

. estadd scalar f_p_value = r(F);

added scalar:
          e(f_p_value) =  237.28629

. eststo reg_base_cube: regress tract_dvoteshare $indep_vars i.city2 
> if incl == 1, cluster(city2);

Linear regression                               Number of obs     =      6,037
                                                F(5, 165)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2896
                                                Root MSE          =     .12728

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |   .5172797   .0773659     6.69   0.000      .364525    .6700345
                  perc_tract_d_sq |  -1.229886   .2011089    -6.12   0.000    -1.626964   -.8328071
                  perc_tract_d_cu |   .8033133   .1378068     5.83   0.000     .5312214    1.075405
                     perc_tract_c |   .2049741   .0547244     3.75   0.000     .0969238    .3130244
                  perc_tract_c_sq |  -.6037504   .1195041    -5.05   0.000    -.8397048   -.3677961
                  perc_tract_c_cu |   .4287234   .0803855     5.33   0.000     .2700066    .5874403
                                  |
                            city2 |
                          Albany  |    .147353   .0041072    35.88   0.000     .1392436    .1554623
                         Altoona  |  -.3094956   .0025441  -121.65   0.000    -.3145189   -.3044724
                        Amarillo  |  -.3016864   .0066744   -45.20   0.000    -.3148647   -.2885081
                       Arlington  |   .1724576   .0031268    55.16   0.000      .166284    .1786313
                         Atlanta  |   .1660223   .0054447    30.49   0.000      .155272    .1767726
                   Atlantic City  |   .1217669   .0081955    14.86   0.000     .1055852    .1379485
                         Augusta  |    .218363    .020115    10.86   0.000      .178647    .2580789
                          Aurora  |   .1025635   .0081663    12.56   0.000     .0864395    .1186875
                          Austin  |   .1499628   .0088351    16.97   0.000     .1325183    .1674074
                       Baltimore  |   .2157191   .0068518    31.48   0.000     .2021907    .2292476
                        Bay City  |  -.1185726   .0073002   -16.24   0.000    -.1329865   -.1041587
                        Beaumont  |   .2256758   .0034261    65.87   0.000     .2189111    .2324406
                         Belmont  |    .138228   .0023254    59.44   0.000     .1336367    .1428193
                      Bergen Co.  |    -.01725    .001569   -10.99   0.000     -.020348    -.014152
                      Birmingham  |   .1667771     .00767    21.74   0.000      .151633    .1819212
                          Boston  |   .1684704   .0042577    39.57   0.000     .1600639    .1768769
                        Brockton  |   .1616237   .0052597    30.73   0.000     .1512388    .1720087
                           Bronx  |   .1435653    .003401    42.21   0.000     .1368502    .1502805
                       Brookline  |   .2137407   .0046541    45.93   0.000     .2045514      .22293
                        Brooklyn  |   .0380234   .0053064     7.17   0.000     .0275461    .0485006
                         Buffalo  |   .1521998   .0028643    53.14   0.000     .1465444    .1578551
                       Cambridge  |   .1979982   .0051301    38.60   0.000      .187869    .2081274
                          Camden  |   .0306827   .0019612    15.64   0.000     .0268104     .034555
                          Canton  |   .0066067   .0026329     2.51   0.013     .0014081    .0118053
                       Charlotte  |   .0536384   .0050134    10.70   0.000     .0437397    .0635371
                     Chattanooga  |    .057338   .0017584    32.61   0.000     .0538661    .0608099
                         Chelsea  |   .0958673   .0050767    18.88   0.000     .0858438    .1058909
                         Chicago  |   .1754477    .003682    47.65   0.000     .1681778    .1827176
                       Cleveland  |   .1336651   .0020787    64.30   0.000     .1295608    .1377694
                        Columbia  |   .0318519   .0090304     3.53   0.001     .0140218     .049682
                        Columbus  |   .1237529   .0020358    60.79   0.000     .1197333    .1277725
                  Council Bluffs  |    -.21373   .0090042   -23.74   0.000    -.2315082   -.1959518
                          Dallas  |   .0515042   .0025132    20.49   0.000      .046542    .0564665
                       Davenport  |  -.0685976   .0012908   -53.15   0.000    -.0711461   -.0660491
                          Dayton  |   .0356964   .0027837    12.82   0.000     .0302001    .0411927
                         Decatur  |   .0030914   .0040736     0.76   0.449    -.0049518    .0111345
                          Denver  |   .1677377   .0029008    57.82   0.000     .1620102    .1734651
                      Des Moines  |    .006426   .0040223     1.60   0.112    -.0015159    .0143679
                         Detroit  |   .1413157   .0029774    47.46   0.000     .1354369    .1471945
                         Dubuque  |  -.0923949   .0073076   -12.64   0.000    -.1068232   -.0779665
                          Duluth  |   .0924437   .0032565    28.39   0.000      .086014    .0988735
                          Durham  |   .2221523   .0087735    25.32   0.000     .2048295    .2394751
                  East St. Louis  |   .2591387    .006487    39.95   0.000     .2463305     .271947
                         El Paso  |   .0669687   .0051054    13.12   0.000     .0568884     .077049
                          Elmira  |  -.1105804   .0035479   -31.17   0.000    -.1175856   -.1035753
                            Erie  |  -.0018231   .0021267    -0.86   0.393    -.0060222    .0023759
                       Essex Co.  |   .1730142   .0036406    47.52   0.000     .1658261    .1802022
                      Evansville  |  -.0371731   .0018722   -19.86   0.000    -.0408697   -.0334766
                         Everett  |   .0121358   .0034065     3.56   0.000     .0054098    .0188617
                           Flint  |   .2977842   .0024018   123.98   0.000     .2930419    .3025264
                      Fort Wayne  |   .0251729   .0057033     4.41   0.000     .0139121    .0364337
                      Fort Worth  |   .0433529   .0063607     6.82   0.000     .0307939    .0559118
                          Fresno  |    .073267   .0031727    23.09   0.000     .0670028    .0795313
                       Galveston  |   .0078552   .0058315     1.35   0.180    -.0036587    .0193692
                    Grand Rapids  |   .0493405   .0016706    29.53   0.000      .046042     .052639
             Greater Kansas City  |   .1264912   .0065378    19.35   0.000     .1135828    .1393997
                      Greensboro  |   .1674243   .0046144    36.28   0.000     .1583134    .1765352
                      Harrisburg  |    .176146   .0082926    21.24   0.000     .1597727    .1925193
                        Hartford  |   .2038932   .0023742    85.88   0.000     .1992054     .208581
                Holyoke Chicopee  |  -.0520768   .0021174   -24.60   0.000    -.0562575   -.0478962
                         Houston  |   .1259364   .0059487    21.17   0.000     .1141911    .1376817
                      Hudson Co.  |   .0415488   .0062818     6.61   0.000     .0291458    .0539518
                    Indianapolis  |   .0508054   .0027559    18.44   0.000     .0453641    .0562468
                         Jackson  |  -.0261567   .0033692    -7.76   0.000    -.0328091   -.0195044
                    Jacksonville  |   .0560748    .009349     6.00   0.000     .0376156    .0745339
                       Johnstown  |  -.2678748   .0049086   -54.57   0.000    -.2775666    -.258183
                          Joliet  |   .0092207   .0024167     3.82   0.000     .0044491    .0139924
                         Kenosha  |  -.1588316   .0056306   -28.21   0.000    -.1699489   -.1477143
                       Knoxville  |  -.0002808   .0053449    -0.05   0.958    -.0108339    .0102724
                   Lake Co. Gary  |   .2302129   .0063277    36.38   0.000     .2177192    .2427066
                         Lansing  |   .0638517   .0025333    25.20   0.000     .0588499    .0688536
                            Lima  |  -.1183825   .0031357   -37.75   0.000    -.1245737   -.1121913
                         Lincoln  |   -.004591   .0023061    -1.99   0.048    -.0091443   -.0000377
                     Little Rock  |   .2006072   .0027138    73.92   0.000      .195249    .2059654
                     Los Angeles  |   .1140641    .003029    37.66   0.000     .1080835    .1200446
           Lower Westchester Co.  |   .0224071   .0042842     5.23   0.000     .0139482    .0308659
                           Macon  |   .0970495   .0160354     6.05   0.000     .0653885    .1287104
                         Madison  |   .1696183   .0025529    66.44   0.000     .1645778    .1746588
                          Malden  |   .0154425    .008009     1.93   0.056    -.0003707    .0312558
                      Manchester  |  -.1072127   .0029292   -36.60   0.000    -.1129962   -.1014292
                       Manhattan  |   .1690232   .0114105    14.81   0.000     .1464938    .1915526
                         Medford  |   .0481311   .0042667    11.28   0.000     .0397066    .0565555
                         Melrose  |   .0632315    .002038    31.03   0.000     .0592075    .0672554
                         Memphis  |   .1596612     .00615    25.96   0.000     .1475184     .171804
                           Miami  |  -.0502359   .0026557   -18.92   0.000    -.0554794   -.0449924
                   Milwaukee Co.  |     .13881   .0042532    32.64   0.000     .1304122    .1472077
                     Minneapolis  |   .2043601   .0029794    68.59   0.000     .1984774    .2102427
                          Mobile  |  -.0287536   .0059998    -4.79   0.000    -.0405999   -.0169074
                      Montgomery  |   .0569295   .0075716     7.52   0.000     .0419797    .0718792
                        Muskegon  |   .2327674   .0097054    23.98   0.000     .2136046    .2519301
                       Nashville  |   .0324594   .0088844     3.65   0.000     .0149177     .050001
                     New Britain  |   .0223396   .0008464    26.39   0.000     .0206685    .0240108
                      New Castle  |   -.157802   .0057882   -27.26   0.000    -.1692306   -.1463735
                       New Haven  |   .0262102   .0025974    10.09   0.000     .0210819    .0313386
                     New Orleans  |   .1657221   .0076231    21.74   0.000     .1506708    .1807735
                          Newton  |   .1693339   .0024081    70.32   0.000     .1645792    .1740886
                   Niagara Falls  |   .0432239   .0044301     9.76   0.000     .0344769    .0519709
                         Norfolk  |   .1645307   .0078148    21.05   0.000     .1491008    .1799605
                         Oakland  |   .2331022   .0039786    58.59   0.000     .2252468    .2409577
                           Ogden  |  -.1248343   .0034904   -35.77   0.000    -.1317259   -.1179427
                   Oklahoma City  |   .0262264    .002096    12.51   0.000     .0220879    .0303649
                           Omaha  |   .0586283   .0049435    11.86   0.000     .0488676    .0683889
                         Oshkosh  |  -.1007435   .0109588    -9.19   0.000     -.122381   -.0791059
       Pawtucket & Central Falls  |    .036029   .0043895     8.21   0.000     .0273622    .0446958
                          Peoria  |    .127352    .005377    23.68   0.000     .1167354    .1379686
                    Philadelphia  |   .1724256   .0075462    22.85   0.000     .1575261    .1873251
                         Phoenix  |   .1227269     .00579    21.20   0.000     .1112949     .134159
                      Pittsburgh  |   .1184408    .003834    30.89   0.000     .1108707    .1260109
                         Pontiac  |   .1758352    .003348    52.52   0.000     .1692248    .1824456
                     Port Arthur  |   .1297638    .007098    18.28   0.000     .1157491    .1437785
                        Portland  |   .2086297   .0028829    72.37   0.000     .2029375     .214322
                    Poughkeepsie  |   .0867859   .0039105    22.19   0.000     .0790647     .094507
                      Providence  |   .1189538   .0022675    52.46   0.000     .1144767    .1234308
                          Pueblo  |  -.0299035   .0051992    -5.75   0.000     -.040169    -.019638
                          Queens  |   .0823294   .0043598    18.88   0.000     .0737213    .0909376
                          Quincy  |   .0065028   .0042827     1.52   0.131    -.0019532    .0149587
                          Racine  |  -.0650593   .0022439   -28.99   0.000    -.0694898   -.0606287
                          Revere  |  -.0030601   .0052225    -0.59   0.559    -.0133716    .0072514
                        Richmond  |    .094837   .0020773    45.65   0.000     .0907355    .0989385
                       Rochester  |    .166214   .0028624    58.07   0.000     .1605624    .1718657
                        Rockford  |  -.0321989   .0053007    -6.07   0.000    -.0426648    -.021733
                      Sacramento  |   .1522369   .0034881    43.64   0.000     .1453498     .159124
                         Saginaw  |   .0750791   .0031764    23.64   0.000     .0688074    .0813509
                  Salt Lake City  |   .1053268   .0050597    20.82   0.000     .0953368    .1153168
                     San Antonio  |   .0787418    .005451    14.45   0.000     .0679791    .0895045
                       San Diego  |   .0895551   .0055708    16.08   0.000     .0785559    .1005543
                   San Francisco  |   .1687579   .0054232    31.12   0.000       .15805    .1794658
                        San Jose  |   .1041027   .0047439    21.94   0.000     .0947361    .1134693
                        Savannah  |   .2293909   .0016349   140.30   0.000     .2261628     .232619
                     Schenectady  |  -.1192094   .0049101   -24.28   0.000    -.1289041   -.1095146
                         Seattle  |   .2226902   .0030046    74.12   0.000     .2167578    .2286225
                      Shreveport  |   .0872355   .0031214    27.95   0.000     .0810725    .0933985
                      Sioux City  |  -.1681025   .0052406   -32.08   0.000    -.1784497   -.1577553
                      Somerville  |   .2204349   .0049083    44.91   0.000     .2107438    .2301261
                      South Bend  |   .0543016   .0028392    19.13   0.000     .0486958    .0599075
                         Spokane  |  -.0865835   .0017996   -48.11   0.000    -.0901367   -.0830304
                     Springfield  |  -.0123546   .0073446    -1.68   0.094    -.0268561    .0021468
                      St. Joseph  |  -.1662165   .0173826    -9.56   0.000    -.2005376   -.1318955
                       St. Louis  |   .1987163   .0031566    62.95   0.000     .1924838    .2049489
                        St. Paul  |   .1457633   .0035039    41.60   0.000     .1388451    .1526815
                  St. Petersburg  |   .0970194   .0047179    20.56   0.000     .0877042    .1063347
Stamford, Darien, and New Canaan  |   .0611805   .0035565    17.20   0.000     .0541584    .0682027
                   Staten Island  |  -.1335199   .0046486   -28.72   0.000    -.1426984   -.1243414
                        Stockton  |   .0546961   .0038682    14.14   0.000     .0470586    .0623336
                        Syracuse  |   .0659004   .0018097    36.42   0.000     .0623273    .0694735
                          Tacoma  |  -.0011822   .0051504    -0.23   0.819    -.0113514     .008987
                           Tampa  |   .0343387   .0106452     3.23   0.002     .0133204     .055357
                     Terre Haute  |   -.090119   .0043829   -20.56   0.000    -.0987729   -.0814651
                          Toledo  |   .0812798   .0021871    37.16   0.000     .0769615     .085598
                          Topeka  |  -.0547281   .0064048    -8.54   0.000     -.067374   -.0420822
                         Trenton  |   .1497256   .0025491    58.74   0.000     .1446924    .1547587
                           Tulsa  |    .023493   .0044329     5.30   0.000     .0147406    .0322455
                       Union Co.  |   .0649052   .0011018    58.91   0.000     .0627298    .0670805
                           Utica  |  -.0580021   .0014656   -39.57   0.000    -.0608959   -.0551083
                            Waco  |    .032363   .0026202    12.35   0.000     .0271895    .0375364
                          Warren  |  -.0599116   .0034213   -17.51   0.000    -.0666668   -.0531565
                       Waterbury  |   .0321516   .0029852    10.77   0.000     .0262575    .0380457
                        Waterloo  |   .0022797   .0063529     0.36   0.720    -.0102637    .0148232
                       Watertown  |   .0897941   .0080618    11.14   0.000     .0738764    .1057117
                         Wichita  |  -.0508497   .0109388    -4.65   0.000    -.0724478   -.0292517
                    Wilkes-Barre  |   -.060143    .007098    -8.47   0.000    -.0741577   -.0461283
                   Winston-Salem  |   .1805589   .0067218    26.86   0.000      .167287    .1938308
                      Woonsocket  |  -.1369675   .0073161   -18.72   0.000    -.1514126   -.1225223
                            York  |    .037709   .0056791     6.64   0.000     .0264959    .0489221
                      Youngstown  |   .0599378    .003347    17.91   0.000     .0533293    .0665463
                                  |
                            _cons |   .6431006    .007098    90.60   0.000     .6290859    .6571153
---------------------------------------------------------------------------------------------------

. testparm i.city2;

 ( 1)  2.city2 = 0
 ( 2)  3.city2 = 0
 ( 3)  4.city2 = 0
 ( 4)  5.city2 = 0
 ( 5)  7.city2 = 0
 ( 6)  8.city2 = 0
 ( 7)  9.city2 = 0
 ( 8)  10.city2 = 0
 ( 9)  11.city2 = 0
 (10)  12.city2 = 0
 (11)  14.city2 = 0
 (12)  15.city2 = 0
 (13)  16.city2 = 0
 (14)  17.city2 = 0
 (15)  20.city2 = 0
 (16)  21.city2 = 0
 (17)  23.city2 = 0
 (18)  24.city2 = 0
 (19)  25.city2 = 0
 (20)  26.city2 = 0
 (21)  27.city2 = 0
 (22)  28.city2 = 0
 (23)  29.city2 = 0
 (24)  30.city2 = 0
 (25)  32.city2 = 0
 (26)  33.city2 = 0
 (27)  34.city2 = 0
 (28)  36.city2 = 0
 (29)  37.city2 = 0
 (30)  38.city2 = 0
 (31)  39.city2 = 0
 (32)  40.city2 = 0
 (33)  42.city2 = 0
 (34)  43.city2 = 0
 (35)  44.city2 = 0
 (36)  45.city2 = 0
 (37)  47.city2 = 0
 (38)  48.city2 = 0
 (39)  49.city2 = 0
 (40)  50.city2 = 0
 (41)  51.city2 = 0
 (42)  52.city2 = 0
 (43)  53.city2 = 0
 (44)  54.city2 = 0
 (45)  55.city2 = 0
 (46)  56.city2 = 0
 (47)  57.city2 = 0
 (48)  58.city2 = 0
 (49)  59.city2 = 0
 (50)  60.city2 = 0
 (51)  61.city2 = 0
 (52)  62.city2 = 0
 (53)  63.city2 = 0
 (54)  64.city2 = 0
 (55)  65.city2 = 0
 (56)  66.city2 = 0
 (57)  67.city2 = 0
 (58)  69.city2 = 0
 (59)  70.city2 = 0
 (60)  72.city2 = 0
 (61)  73.city2 = 0
 (62)  74.city2 = 0
 (63)  76.city2 = 0
 (64)  77.city2 = 0
 (65)  78.city2 = 0
 (66)  79.city2 = 0
 (67)  80.city2 = 0
 (68)  82.city2 = 0
 (69)  83.city2 = 0
 (70)  84.city2 = 0
 (71)  86.city2 = 0
 (72)  88.city2 = 0
 (73)  89.city2 = 0
 (74)  90.city2 = 0
 (75)  92.city2 = 0
 (76)  94.city2 = 0
 (77)  96.city2 = 0
 (78)  97.city2 = 0
 (79)  98.city2 = 0
 (80)  99.city2 = 0
 (81)  100.city2 = 0
 (82)  101.city2 = 0
 (83)  102.city2 = 0
 (84)  103.city2 = 0
 (85)  104.city2 = 0
 (86)  106.city2 = 0
 (87)  107.city2 = 0
 (88)  108.city2 = 0
 (89)  109.city2 = 0
 (90)  111.city2 = 0
 (91)  112.city2 = 0
 (92)  114.city2 = 0
 (93)  115.city2 = 0
 (94)  116.city2 = 0
 (95)  117.city2 = 0
 (96)  119.city2 = 0
 (97)  120.city2 = 0
 (98)  121.city2 = 0
 (99)  122.city2 = 0
 (100)  123.city2 = 0
 (101)  124.city2 = 0
 (102)  125.city2 = 0
 (103)  126.city2 = 0
 (104)  127.city2 = 0
 (105)  128.city2 = 0
 (106)  129.city2 = 0
 (107)  130.city2 = 0
 (108)  131.city2 = 0
 (109)  132.city2 = 0
 (110)  133.city2 = 0
 (111)  134.city2 = 0
 (112)  136.city2 = 0
 (113)  137.city2 = 0
 (114)  138.city2 = 0
 (115)  139.city2 = 0
 (116)  140.city2 = 0
 (117)  141.city2 = 0
 (118)  142.city2 = 0
 (119)  143.city2 = 0
 (120)  145.city2 = 0
 (121)  146.city2 = 0
 (122)  147.city2 = 0
 (123)  148.city2 = 0
 (124)  149.city2 = 0
 (125)  150.city2 = 0
 (126)  151.city2 = 0
 (127)  152.city2 = 0
 (128)  153.city2 = 0
 (129)  155.city2 = 0
 (130)  156.city2 = 0
 (131)  157.city2 = 0
 (132)  158.city2 = 0
 (133)  159.city2 = 0
 (134)  160.city2 = 0
 (135)  161.city2 = 0
 (136)  162.city2 = 0
 (137)  163.city2 = 0
 (138)  164.city2 = 0
 (139)  165.city2 = 0
 (140)  166.city2 = 0
 (141)  167.city2 = 0
 (142)  168.city2 = 0
 (143)  169.city2 = 0
 (144)  170.city2 = 0
 (145)  171.city2 = 0
 (146)  172.city2 = 0
 (147)  173.city2 = 0
 (148)  174.city2 = 0
 (149)  175.city2 = 0
 (150)  176.city2 = 0
 (151)  177.city2 = 0
 (152)  179.city2 = 0
 (153)  180.city2 = 0
 (154)  181.city2 = 0
 (155)  182.city2 = 0
 (156)  184.city2 = 0
 (157)  185.city2 = 0
 (158)  186.city2 = 0
 (159)  187.city2 = 0
 (160)  189.city2 = 0
 (161)  190.city2 = 0
 (162)  192.city2 = 0
 (163)  194.city2 = 0
 (164)  195.city2 = 0
 (165)  196.city2 = 0
       Constraint 1 dropped
       Constraint 2 dropped
       Constraint 3 dropped
       Constraint 4 dropped
       Constraint 5 dropped
       Constraint 6 dropped
       Constraint 8 dropped
       Constraint 9 dropped
       Constraint 10 dropped
       Constraint 11 dropped
       Constraint 12 dropped
       Constraint 13 dropped
       Constraint 14 dropped
       Constraint 15 dropped
       Constraint 16 dropped
       Constraint 17 dropped
       Constraint 18 dropped
       Constraint 19 dropped
       Constraint 20 dropped
       Constraint 21 dropped
       Constraint 22 dropped
       Constraint 23 dropped
       Constraint 24 dropped
       Constraint 25 dropped
       Constraint 26 dropped
       Constraint 27 dropped
       Constraint 28 dropped
       Constraint 29 dropped
       Constraint 30 dropped
       Constraint 31 dropped
       Constraint 32 dropped
       Constraint 33 dropped
       Constraint 34 dropped
       Constraint 35 dropped
       Constraint 36 dropped
       Constraint 37 dropped
       Constraint 38 dropped
       Constraint 39 dropped
       Constraint 40 dropped
       Constraint 41 dropped
       Constraint 43 dropped
       Constraint 44 dropped
       Constraint 45 dropped
       Constraint 46 dropped
       Constraint 47 dropped
       Constraint 48 dropped
       Constraint 49 dropped
       Constraint 50 dropped
       Constraint 51 dropped
       Constraint 52 dropped
       Constraint 53 dropped
       Constraint 54 dropped
       Constraint 55 dropped
       Constraint 56 dropped
       Constraint 57 dropped
       Constraint 58 dropped
       Constraint 59 dropped
       Constraint 60 dropped
       Constraint 61 dropped
       Constraint 62 dropped
       Constraint 63 dropped
       Constraint 64 dropped
       Constraint 65 dropped
       Constraint 66 dropped
       Constraint 67 dropped
       Constraint 68 dropped
       Constraint 69 dropped
       Constraint 70 dropped
       Constraint 71 dropped
       Constraint 72 dropped
       Constraint 73 dropped
       Constraint 74 dropped
       Constraint 75 dropped
       Constraint 76 dropped
       Constraint 77 dropped
       Constraint 78 dropped
       Constraint 79 dropped
       Constraint 80 dropped
       Constraint 81 dropped
       Constraint 82 dropped
       Constraint 83 dropped
       Constraint 84 dropped
       Constraint 85 dropped
       Constraint 86 dropped
       Constraint 87 dropped
       Constraint 88 dropped
       Constraint 89 dropped
       Constraint 90 dropped
       Constraint 91 dropped
       Constraint 92 dropped
       Constraint 93 dropped
       Constraint 94 dropped
       Constraint 95 dropped
       Constraint 96 dropped
       Constraint 97 dropped
       Constraint 98 dropped
       Constraint 99 dropped
       Constraint 100 dropped
       Constraint 101 dropped
       Constraint 102 dropped
       Constraint 103 dropped
       Constraint 104 dropped
       Constraint 105 dropped
       Constraint 106 dropped
       Constraint 107 dropped
       Constraint 108 dropped
       Constraint 109 dropped
       Constraint 110 dropped
       Constraint 111 dropped
       Constraint 112 dropped
       Constraint 113 dropped
       Constraint 114 dropped
       Constraint 115 dropped
       Constraint 116 dropped
       Constraint 117 dropped
       Constraint 118 dropped
       Constraint 119 dropped
       Constraint 120 dropped
       Constraint 121 dropped
       Constraint 122 dropped
       Constraint 123 dropped
       Constraint 124 dropped
       Constraint 125 dropped
       Constraint 126 dropped
       Constraint 127 dropped
       Constraint 128 dropped
       Constraint 129 dropped
       Constraint 130 dropped
       Constraint 131 dropped
       Constraint 132 dropped
       Constraint 133 dropped
       Constraint 134 dropped
       Constraint 135 dropped
       Constraint 136 dropped
       Constraint 137 dropped
       Constraint 138 dropped
       Constraint 139 dropped
       Constraint 140 dropped
       Constraint 141 dropped
       Constraint 142 dropped
       Constraint 143 dropped
       Constraint 144 dropped
       Constraint 145 dropped
       Constraint 146 dropped
       Constraint 147 dropped
       Constraint 148 dropped
       Constraint 149 dropped
       Constraint 150 dropped
       Constraint 151 dropped
       Constraint 152 dropped
       Constraint 153 dropped
       Constraint 154 dropped
       Constraint 155 dropped
       Constraint 157 dropped
       Constraint 158 dropped
       Constraint 160 dropped
       Constraint 162 dropped
       Constraint 164 dropped
       Constraint 165 dropped

       F(  6,   165) =  524.19
            Prob > F =    0.0000

. scalar f_p_value = r(F);

. estadd scalar f_p_value = r(F);

added scalar:
          e(f_p_value) =  524.1948

. eststo reg_all_cov_lin: regress tract_dvoteshare perc_tract_d perc_tract_c 
> $controls i.city2 
> if incl == 1, cluster(city2);

Linear regression                               Number of obs     =      6,037
                                                F(10, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7492
                                                Root MSE          =     .07565

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |   .0311538   .0181298     1.72   0.088    -.0046424    .0669501
                     perc_tract_c |   .0153095   .0094717     1.62   0.108    -.0033918    .0340108
                       _yr_median |  -.0000263   .0002616    -0.10   0.920    -.0005428    .0004901
                       median_age |  -.0018161   .0005504    -3.30   0.001    -.0029029   -.0007292
                male_female_ratio |   .0122462   .0126208     0.97   0.333    -.0126728    .0371652
                    perc_hs_total |  -.1164369   .0367998    -3.16   0.002     -.189096   -.0437777
               perc_somecol_total |   .0853837   .0831106     1.03   0.306    -.0787137    .2494812
                  perc_bach_total |   .4633276   .1149767     4.03   0.000     .2363125    .6903428
                   perc_pop_white |  -.5289293   .1489745    -3.55   0.001    -.8230713   -.2347873
                   perc_pop_black |   .0549327   .0673952     0.82   0.416    -.0781355    .1880008
                   perc_pop_asian |  -.3279543   .0625146    -5.25   0.000    -.4513859   -.2045227
                                  |
                            city2 |
                          Albany  |  -.0204896   .0372848    -0.55   0.583    -.0941064    .0531273
                         Altoona  |  -.1453078   .0217934    -6.67   0.000    -.1883376   -.1022779
                        Amarillo  |  -.2857433   .0102249   -27.95   0.000    -.3059318   -.2655548
                       Arlington  |   .0584553   .0483105     1.21   0.228    -.0369312    .1538417
                         Atlanta  |  -.1043598   .0552669    -1.89   0.061    -.2134812    .0047616
                   Atlantic City  |  -.0993252   .0553056    -1.80   0.074    -.2085231    .0098727
                         Augusta  |   .0687956   .0478009     1.44   0.152    -.0255847     .163176
                          Aurora  |  -.0415015   .0550355    -0.75   0.452     -.150166     .067163
                          Austin  |   .0099068   .0444427     0.22   0.824    -.0778428    .0976564
                       Baltimore  |  -.0469348   .0472053    -0.99   0.322    -.1401391    .0462695
                        Bay City  |   .0250852   .0117134     2.14   0.034     .0019578    .0482127
                        Beaumont  |   .0108037   .0334775     0.32   0.747    -.0552958    .0769032
                         Belmont  |   .0211404   .0509346     0.42   0.679    -.0794273     .121708
                      Bergen Co.  |  -.1535225   .0629526    -2.44   0.016    -.2778189   -.0292261
                      Birmingham  |  -.0576889   .0450051    -1.28   0.202     -.146549    .0311711
                          Boston  |  -.0350187   .0597548    -0.59   0.559    -.1530012    .0829639
                        Brockton  |  -.0413295   .0498019    -0.83   0.408    -.1396606    .0570016
                           Bronx  |  -.1096176   .0680447    -1.61   0.109    -.2439683     .024733
                       Brookline  |   .0071755   .0613224     0.12   0.907    -.1139022    .1282532
                        Brooklyn  |  -.1315928   .0522455    -2.52   0.013    -.2347486   -.0284369
                         Buffalo  |  -.0043277   .0291523    -0.15   0.882    -.0618873    .0532319
                       Cambridge  |   .0180047    .060914     0.30   0.768    -.1022667     .138276
                          Camden  |  -.0302657   .0285569    -1.06   0.291    -.0866497    .0261184
                          Canton  |  -.0117745   .0029588    -3.98   0.000    -.0176165   -.0059325
                       Charlotte  |  -.1353052   .0469099    -2.88   0.004    -.2279262   -.0426842
                     Chattanooga  |  -.0603053   .0162907    -3.70   0.000    -.0924705   -.0281402
                         Chelsea  |  -.1056192   .0748369    -1.41   0.160    -.2533807    .0421423
                         Chicago  |  -.0543192   .0587562    -0.92   0.357    -.1703301    .0616918
                       Cleveland  |  -.0361108   .0324894    -1.11   0.268    -.1002594    .0280378
                        Columbia  |  -.1064553   .0306423    -3.47   0.001    -.1669569   -.0459538
                        Columbus  |   .0221263   .0177325     1.25   0.214    -.0128855    .0571381
                  Council Bluffs  |  -.0243544   .0134716    -1.81   0.072    -.0509534    .0022445
                          Dallas  |  -.1548917   .0507417    -3.05   0.003    -.2550784    -.054705
                       Davenport  |   -.000837   .0034444    -0.24   0.808    -.0076378    .0059638
                          Dayton  |  -.0767575   .0178734    -4.29   0.000    -.1120476   -.0414674
                         Decatur  |  -.0682496   .0052453   -13.01   0.000    -.0786061   -.0578931
                          Denver  |     .02546   .0454332     0.56   0.576    -.0642454    .1151653
                      Des Moines  |   .0142797   .0121057     1.18   0.240    -.0096222    .0381817
                         Detroit  |  -.0275258   .0315355    -0.87   0.384    -.0897909    .0347394
                         Dubuque  |   .0058161   .0135747     0.43   0.669    -.0209864    .0326187
                          Duluth  |   .0943406   .0051163    18.44   0.000     .0842387    .1044425
                          Durham  |  -.0513027   .0533405    -0.96   0.338    -.1566206    .0540152
                  East St. Louis  |   -.042102   .0407738    -1.03   0.303    -.1226076    .0384037
                         El Paso  |   -.054832   .0509153    -1.08   0.283    -.1553615    .0456976
                          Elmira  |  -.0504698   .0087157    -5.79   0.000    -.0676784   -.0332612
                            Erie  |   .0401598   .0073943     5.43   0.000     .0255601    .0547594
                       Essex Co.  |  -.0934825   .0623912    -1.50   0.136    -.2166706    .0297056
                      Evansville  |  -.0257764   .0030376    -8.49   0.000     -.031774   -.0197788
                         Everett  |   -.087705   .0516088    -1.70   0.091    -.1896038    .0141937
                           Flint  |  -.0159678   .0424156    -0.38   0.707    -.0997151    .0677795
                      Fort Wayne  |  -.0370877   .0155112    -2.39   0.018    -.0677138   -.0064616
                      Fort Worth  |  -.0978833   .0427522    -2.29   0.023    -.1822952   -.0134714
                          Fresno  |  -.0830026   .0499594    -1.66   0.099    -.1816447    .0156395
                       Galveston  |  -.0885051   .0306742    -2.89   0.004    -.1490696   -.0279406
                    Grand Rapids  |  -.0490046   .0275706    -1.78   0.077    -.1034413     .005432
             Greater Kansas City  |  -.0136778   .0377191    -0.36   0.717    -.0881521    .0607965
                      Greensboro  |  -.0709553   .0397779    -1.78   0.076    -.1494945    .0075839
                      Harrisburg  |   .0048295   .0319542     0.15   0.880    -.0582623    .0679212
                        Hartford  |  -.0336173   .0487712    -0.69   0.492    -.1299133    .0626788
                Holyoke Chicopee  |  -.0206194   .0125891    -1.64   0.103    -.0454758     .004237
                         Houston  |   -.114609   .0547886    -2.09   0.038    -.2227861    -.006432
                      Hudson Co.  |  -.1547329   .0742723    -2.08   0.039    -.3013796   -.0080862
                    Indianapolis  |  -.0543133   .0236814    -2.29   0.023     -.101071   -.0075557
                         Jackson  |  -.0383137   .0024752   -15.48   0.000    -.0432008   -.0334266
                    Jacksonville  |  -.0456519   .0215439    -2.12   0.036    -.0881892   -.0031147
                       Johnstown  |  -.0494666   .0228347    -2.17   0.032    -.0945525   -.0043808
                          Joliet  |  -.0671634   .0266082    -2.52   0.013    -.1196998    -.014627
                         Kenosha  |  -.0621815   .0088491    -7.03   0.000    -.0796535   -.0447095
                       Knoxville  |   .0461325   .0035897    12.85   0.000     .0390448    .0532202
                   Lake Co. Gary  |  -.0180943   .0628401    -0.29   0.774    -.1421686    .1059801
                         Lansing  |   .0370138   .0149135     2.48   0.014     .0075679    .0664598
                            Lima  |  -.1227013   .0183943    -6.67   0.000    -.1590199   -.0863826
                         Lincoln  |  -.0116352   .0079782    -1.46   0.147    -.0273877    .0041173
                     Little Rock  |  -.0266519   .0346654    -0.77   0.443    -.0950968     .041793
                     Los Angeles  |  -.0796878   .0690077    -1.15   0.250    -.2159398    .0565641
           Lower Westchester Co.  |   -.148435   .0616851    -2.41   0.017    -.2702288   -.0266412
                           Macon  |  -.1660964   .0344739    -4.82   0.000    -.2341632   -.0980296
                         Madison  |   .1196083   .0226141     5.29   0.000     .0749579    .1642586
                          Malden  |  -.0679501   .0530686    -1.28   0.202    -.1727312     .036831
                      Manchester  |  -.0433345    .006205    -6.98   0.000     -.055586   -.0310831
                       Manhattan  |   -.035397   .0726603    -0.49   0.627    -.1788609    .1080669
                         Medford  |  -.0444129   .0445389    -1.00   0.320    -.1323526    .0435267
                         Melrose  |  -.0036105   .0400462    -0.09   0.928    -.0826796    .0754586
                         Memphis  |  -.0713507   .0361724    -1.97   0.050    -.1427712    .0000697
                           Miami  |  -.3148668    .080492    -3.91   0.000     -.473794   -.1559397
                   Milwaukee Co.  |  -.0257531   .0342628    -0.75   0.453    -.0934031    .0418969
                     Minneapolis  |   .0488089   .0348334     1.40   0.163    -.0199677    .1175855
                          Mobile  |  -.2087699   .0382406    -5.46   0.000    -.2842738   -.1332659
                      Montgomery  |  -.1200214   .0247834    -4.84   0.000    -.1689548    -.071088
                        Muskegon  |  -.0140991   .0392416    -0.36   0.720    -.0915796    .0633814
                       Nashville  |  -.1060952   .0363727    -2.92   0.004    -.1779112   -.0342793
                     New Britain  |  -.0488235   .0246706    -1.98   0.049    -.0975343   -.0001127
                      New Castle  |  -.0204436   .0281264    -0.73   0.468    -.0759776    .0350903
                       New Haven  |  -.0530038    .025841    -2.05   0.042    -.1040254   -.0019822
                     New Orleans  |  -.0459751   .0463358    -0.99   0.323    -.1374627    .0455125
                          Newton  |   .0079142   .0636374     0.12   0.901    -.1177345    .1335629
                   Niagara Falls  |  -.0056381   .0059328    -0.95   0.343     -.017352    .0060758
                         Norfolk  |  -.0611248   .0446741    -1.37   0.173    -.1493315    .0270819
                         Oakland  |   .0156532   .0742126     0.21   0.833    -.1308756     .162182
                           Ogden  |  -.1145628    .016501    -6.94   0.000     -.147143   -.0819825
                   Oklahoma City  |    -.09032   .0343043    -2.63   0.009    -.1580521    -.022588
                           Omaha  |  -.0293822   .0177028    -1.66   0.099    -.0643354    .0055711
                         Oshkosh  |   .0008988   .0088711     0.10   0.919    -.0166167    .0184143
       Pawtucket & Central Falls  |  -.0174006   .0226868    -0.77   0.444    -.0621945    .0273932
                          Peoria  |  -.0102629   .0228101    -0.45   0.653    -.0553002    .0347744
                    Philadelphia  |  -.0177259   .0437903    -0.40   0.686    -.1041874    .0687357
                         Phoenix  |  -.0173609    .037668    -0.46   0.645    -.0917343    .0570126
                      Pittsburgh  |   .0138012   .0246962     0.56   0.577    -.0349602    .0625626
                         Pontiac  |  -.0056703   .0284696    -0.20   0.842     -.061882    .0505414
                     Port Arthur  |  -.0919218   .0385375    -2.39   0.018     -.168012   -.0158316
                        Portland  |   .1103316   .0405261     2.72   0.007     .0303151    .1903481
                    Poughkeepsie  |  -.0674461   .0432829    -1.56   0.121    -.1529058    .0180137
                      Providence  |  -.0402309   .0480661    -0.84   0.404    -.1351348    .0546729
                          Pueblo  |   -.042572   .0199326    -2.14   0.034    -.0819278   -.0032163
                          Queens  |  -.1022109   .0726162    -1.41   0.161    -.2455877    .0411659
                          Quincy  |  -.0198371   .0391412    -0.51   0.613    -.0971193    .0574451
                          Racine  |  -.0283601   .0052052    -5.45   0.000    -.0386375   -.0180826
                          Revere  |  -.0332028   .0381582    -0.87   0.385    -.1085442    .0421385
                        Richmond  |   -.079681   .0398179    -2.00   0.047    -.1582993   -.0010627
                       Rochester  |  -.0277455   .0344116    -0.81   0.421    -.0956894    .0401984
                        Rockford  |  -.0531243   .0145958    -3.64   0.000     -.081943   -.0243057
                      Sacramento  |  -.0085437   .0507863    -0.17   0.867    -.1088185    .0917312
                         Saginaw  |   -.026764   .0186334    -1.44   0.153    -.0635547    .0100267
                  Salt Lake City  |   .0329319   .0280479     1.17   0.242    -.0224471    .0883109
                     San Antonio  |  -.0043309   .0412551    -0.10   0.917    -.0857868     .077125
                       San Diego  |  -.0716923   .0605204    -1.18   0.238    -.1911866    .0478021
                   San Francisco  |  -.0050955   .0845435    -0.06   0.952    -.1720221     .161831
                        San Jose  |  -.0372584   .0666289    -0.56   0.577    -.1688135    .0942968
                        Savannah  |   .0047504   .0275751     0.17   0.863     -.049695    .0591959
                     Schenectady  |  -.0861962   .0139201    -6.19   0.000    -.1136806   -.0587117
                         Seattle  |   .0643028   .0561768     1.14   0.254    -.0466153    .1752209
                      Shreveport  |  -.1892726    .056231    -3.37   0.001    -.3002976   -.0782476
                      Sioux City  |   -.142062   .0125173   -11.35   0.000    -.1667768   -.1173473
                      Somerville  |   .0628657   .0507197     1.24   0.217    -.0372776     .163009
                      South Bend  |  -.0031956   .0134748    -0.24   0.813    -.0298009    .0234096
                         Spokane  |  -.0435313   .0099281    -4.38   0.000    -.0631338   -.0239289
                     Springfield  |  -.0308422   .0081331    -3.79   0.000    -.0469005   -.0147839
                      St. Joseph  |  -.0459474   .0120394    -3.82   0.000    -.0697186   -.0221762
                       St. Louis  |  -.0245388   .0381386    -0.64   0.521    -.0998413    .0507637
                        St. Paul  |   .0542918   .0307762     1.76   0.080     -.006474    .1150577
                  St. Petersburg  |  -.0561735   .0323973    -1.73   0.085    -.1201403    .0077932
Stamford, Darien, and New Canaan  |   -.163995   .0654887    -2.50   0.013    -.2932989   -.0346911
                   Staten Island  |  -.2058604   .0451023    -4.56   0.000    -.2949124   -.1168084
                        Stockton  |  -.0785146   .0499447    -1.57   0.118    -.1771276    .0200984
                        Syracuse  |  -.0084435   .0118918    -0.71   0.479    -.0319233    .0150362
                          Tacoma  |  -.0044121   .0298199    -0.15   0.883    -.0632899    .0544657
                           Tampa  |  -.1277673   .0452962    -2.82   0.005    -.2172022   -.0383324
                     Terre Haute  |  -.0750433   .0049268   -15.23   0.000    -.0847709   -.0653157
                          Toledo  |  -.0123403   .0157958    -0.78   0.436    -.0435281    .0188476
                          Topeka  |  -.0274916   .0104586    -2.63   0.009    -.0481415   -.0068418
                         Trenton  |  -.0806053   .0552705    -1.46   0.147    -.1897338    .0285232
                           Tulsa  |  -.0875566    .034921    -2.51   0.013    -.1565062   -.0186069
                       Union Co.  |  -.1357921   .0648075    -2.10   0.038     -.263751   -.0078332
                           Utica  |  -.0571117   .0110366    -5.17   0.000    -.0789028   -.0353206
                            Waco  |   -.119628   .0306111    -3.91   0.000     -.180068   -.0591881
                          Warren  |   .0495281   .0249791     1.98   0.049     .0002083    .0988479
                       Waterbury  |  -.1221343   .0396112    -3.08   0.002    -.2003445    -.043924
                        Waterloo  |  -.0001663   .0072241    -0.02   0.982    -.0144299    .0140972
                       Watertown  |  -.0330866   .0474275    -0.70   0.486    -.1267297    .0605565
                         Wichita  |  -.1056854   .0285732    -3.70   0.000    -.1621017   -.0492691
                    Wilkes-Barre  |  -.0661932   .0049065   -13.49   0.000    -.0758809   -.0565055
                   Winston-Salem  |  -.0357506   .0331646    -1.08   0.283    -.1012324    .0297312
                      Woonsocket  |  -.0880975   .0048175   -18.29   0.000    -.0976093   -.0785857
                            York  |  -.0547876   .0336848    -1.63   0.106    -.1212963    .0117211
                      Youngstown  |  -.0129774   .0167408    -0.78   0.439    -.0460312    .0200763
                                  |
                            _cons |   .9731622   .0461277    21.10   0.000     .8820855    1.064239
---------------------------------------------------------------------------------------------------

. testparm i.city2;

 ( 1)  2.city2 = 0
 ( 2)  3.city2 = 0
 ( 3)  4.city2 = 0
 ( 4)  5.city2 = 0
 ( 5)  7.city2 = 0
 ( 6)  8.city2 = 0
 ( 7)  9.city2 = 0
 ( 8)  10.city2 = 0
 ( 9)  11.city2 = 0
 (10)  12.city2 = 0
 (11)  14.city2 = 0
 (12)  15.city2 = 0
 (13)  16.city2 = 0
 (14)  17.city2 = 0
 (15)  20.city2 = 0
 (16)  21.city2 = 0
 (17)  23.city2 = 0
 (18)  24.city2 = 0
 (19)  25.city2 = 0
 (20)  26.city2 = 0
 (21)  27.city2 = 0
 (22)  28.city2 = 0
 (23)  29.city2 = 0
 (24)  30.city2 = 0
 (25)  32.city2 = 0
 (26)  33.city2 = 0
 (27)  34.city2 = 0
 (28)  36.city2 = 0
 (29)  37.city2 = 0
 (30)  38.city2 = 0
 (31)  39.city2 = 0
 (32)  40.city2 = 0
 (33)  42.city2 = 0
 (34)  43.city2 = 0
 (35)  44.city2 = 0
 (36)  45.city2 = 0
 (37)  47.city2 = 0
 (38)  48.city2 = 0
 (39)  49.city2 = 0
 (40)  50.city2 = 0
 (41)  51.city2 = 0
 (42)  52.city2 = 0
 (43)  53.city2 = 0
 (44)  54.city2 = 0
 (45)  55.city2 = 0
 (46)  56.city2 = 0
 (47)  57.city2 = 0
 (48)  58.city2 = 0
 (49)  59.city2 = 0
 (50)  60.city2 = 0
 (51)  61.city2 = 0
 (52)  62.city2 = 0
 (53)  63.city2 = 0
 (54)  64.city2 = 0
 (55)  65.city2 = 0
 (56)  66.city2 = 0
 (57)  67.city2 = 0
 (58)  69.city2 = 0
 (59)  70.city2 = 0
 (60)  72.city2 = 0
 (61)  73.city2 = 0
 (62)  74.city2 = 0
 (63)  76.city2 = 0
 (64)  77.city2 = 0
 (65)  78.city2 = 0
 (66)  79.city2 = 0
 (67)  80.city2 = 0
 (68)  82.city2 = 0
 (69)  83.city2 = 0
 (70)  84.city2 = 0
 (71)  86.city2 = 0
 (72)  88.city2 = 0
 (73)  89.city2 = 0
 (74)  90.city2 = 0
 (75)  92.city2 = 0
 (76)  94.city2 = 0
 (77)  96.city2 = 0
 (78)  97.city2 = 0
 (79)  98.city2 = 0
 (80)  99.city2 = 0
 (81)  100.city2 = 0
 (82)  101.city2 = 0
 (83)  102.city2 = 0
 (84)  103.city2 = 0
 (85)  104.city2 = 0
 (86)  106.city2 = 0
 (87)  107.city2 = 0
 (88)  108.city2 = 0
 (89)  109.city2 = 0
 (90)  111.city2 = 0
 (91)  112.city2 = 0
 (92)  114.city2 = 0
 (93)  115.city2 = 0
 (94)  116.city2 = 0
 (95)  117.city2 = 0
 (96)  119.city2 = 0
 (97)  120.city2 = 0
 (98)  121.city2 = 0
 (99)  122.city2 = 0
 (100)  123.city2 = 0
 (101)  124.city2 = 0
 (102)  125.city2 = 0
 (103)  126.city2 = 0
 (104)  127.city2 = 0
 (105)  128.city2 = 0
 (106)  129.city2 = 0
 (107)  130.city2 = 0
 (108)  131.city2 = 0
 (109)  132.city2 = 0
 (110)  133.city2 = 0
 (111)  134.city2 = 0
 (112)  136.city2 = 0
 (113)  137.city2 = 0
 (114)  138.city2 = 0
 (115)  139.city2 = 0
 (116)  140.city2 = 0
 (117)  141.city2 = 0
 (118)  142.city2 = 0
 (119)  143.city2 = 0
 (120)  145.city2 = 0
 (121)  146.city2 = 0
 (122)  147.city2 = 0
 (123)  148.city2 = 0
 (124)  149.city2 = 0
 (125)  150.city2 = 0
 (126)  151.city2 = 0
 (127)  152.city2 = 0
 (128)  153.city2 = 0
 (129)  155.city2 = 0
 (130)  156.city2 = 0
 (131)  157.city2 = 0
 (132)  158.city2 = 0
 (133)  159.city2 = 0
 (134)  160.city2 = 0
 (135)  161.city2 = 0
 (136)  162.city2 = 0
 (137)  163.city2 = 0
 (138)  164.city2 = 0
 (139)  165.city2 = 0
 (140)  166.city2 = 0
 (141)  167.city2 = 0
 (142)  168.city2 = 0
 (143)  169.city2 = 0
 (144)  170.city2 = 0
 (145)  171.city2 = 0
 (146)  172.city2 = 0
 (147)  173.city2 = 0
 (148)  174.city2 = 0
 (149)  175.city2 = 0
 (150)  176.city2 = 0
 (151)  177.city2 = 0
 (152)  179.city2 = 0
 (153)  180.city2 = 0
 (154)  181.city2 = 0
 (155)  182.city2 = 0
 (156)  184.city2 = 0
 (157)  185.city2 = 0
 (158)  186.city2 = 0
 (159)  187.city2 = 0
 (160)  189.city2 = 0
 (161)  190.city2 = 0
 (162)  192.city2 = 0
 (163)  194.city2 = 0
 (164)  195.city2 = 0
 (165)  196.city2 = 0
       Constraint 1 dropped
       Constraint 2 dropped
       Constraint 3 dropped
       Constraint 4 dropped
       Constraint 5 dropped
       Constraint 6 dropped
       Constraint 8 dropped
       Constraint 9 dropped
       Constraint 10 dropped
       Constraint 11 dropped
       Constraint 12 dropped
       Constraint 13 dropped
       Constraint 14 dropped
       Constraint 15 dropped
       Constraint 16 dropped
       Constraint 17 dropped
       Constraint 18 dropped
       Constraint 19 dropped
       Constraint 20 dropped
       Constraint 21 dropped
       Constraint 22 dropped
       Constraint 23 dropped
       Constraint 24 dropped
       Constraint 25 dropped
       Constraint 26 dropped
       Constraint 28 dropped
       Constraint 29 dropped
       Constraint 30 dropped
       Constraint 31 dropped
       Constraint 32 dropped
       Constraint 33 dropped
       Constraint 34 dropped
       Constraint 35 dropped
       Constraint 36 dropped
       Constraint 37 dropped
       Constraint 38 dropped
       Constraint 39 dropped
       Constraint 40 dropped
       Constraint 41 dropped
       Constraint 42 dropped
       Constraint 45 dropped
       Constraint 46 dropped
       Constraint 47 dropped
       Constraint 48 dropped
       Constraint 49 dropped
       Constraint 50 dropped
       Constraint 51 dropped
       Constraint 52 dropped
       Constraint 53 dropped
       Constraint 54 dropped
       Constraint 55 dropped
       Constraint 56 dropped
       Constraint 59 dropped
       Constraint 60 dropped
       Constraint 61 dropped
       Constraint 62 dropped
       Constraint 63 dropped
       Constraint 64 dropped
       Constraint 65 dropped
       Constraint 66 dropped
       Constraint 67 dropped
       Constraint 68 dropped
       Constraint 69 dropped
       Constraint 70 dropped
       Constraint 71 dropped
       Constraint 72 dropped
       Constraint 73 dropped
       Constraint 74 dropped
       Constraint 75 dropped
       Constraint 78 dropped
       Constraint 79 dropped
       Constraint 80 dropped
       Constraint 81 dropped
       Constraint 82 dropped
       Constraint 83 dropped
       Constraint 84 dropped
       Constraint 85 dropped
       Constraint 86 dropped
       Constraint 87 dropped
       Constraint 88 dropped
       Constraint 89 dropped
       Constraint 90 dropped
       Constraint 91 dropped
       Constraint 92 dropped
       Constraint 93 dropped
       Constraint 94 dropped
       Constraint 95 dropped
       Constraint 96 dropped
       Constraint 97 dropped
       Constraint 98 dropped
       Constraint 99 dropped
       Constraint 100 dropped
       Constraint 101 dropped
       Constraint 102 dropped
       Constraint 104 dropped
       Constraint 105 dropped
       Constraint 106 dropped
       Constraint 107 dropped
       Constraint 108 dropped
       Constraint 109 dropped
       Constraint 110 dropped
       Constraint 111 dropped
       Constraint 112 dropped
       Constraint 113 dropped
       Constraint 114 dropped
       Constraint 115 dropped
       Constraint 116 dropped
       Constraint 117 dropped
       Constraint 118 dropped
       Constraint 120 dropped
       Constraint 121 dropped
       Constraint 122 dropped
       Constraint 123 dropped
       Constraint 124 dropped
       Constraint 125 dropped
       Constraint 126 dropped
       Constraint 128 dropped
       Constraint 129 dropped
       Constraint 130 dropped
       Constraint 131 dropped
       Constraint 132 dropped
       Constraint 133 dropped
       Constraint 134 dropped
       Constraint 135 dropped
       Constraint 136 dropped
       Constraint 137 dropped
       Constraint 138 dropped
       Constraint 139 dropped
       Constraint 140 dropped
       Constraint 141 dropped
       Constraint 142 dropped
       Constraint 143 dropped
       Constraint 144 dropped
       Constraint 145 dropped
       Constraint 146 dropped
       Constraint 147 dropped
       Constraint 148 dropped
       Constraint 149 dropped
       Constraint 150 dropped
       Constraint 151 dropped
       Constraint 152 dropped
       Constraint 153 dropped
       Constraint 154 dropped
       Constraint 155 dropped
       Constraint 156 dropped
       Constraint 157 dropped
       Constraint 158 dropped
       Constraint 159 dropped
       Constraint 160 dropped
       Constraint 161 dropped
       Constraint 162 dropped
       Constraint 163 dropped
       Constraint 164 dropped
       Constraint 165 dropped

       F( 11,   165) = 1422.66
            Prob > F =    0.0000

. scalar f_p_value = r(F);

. estadd scalar f_p_value = r(F);

added scalar:
          e(f_p_value) =  1422.6642

. eststo reg_all_cov: regress tract_dvoteshare $indep_vars 
> $controls i.city2 
> if incl == 1, cluster(city2);

Linear regression                               Number of obs     =      6,037
                                                F(14, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7498
                                                Root MSE          =      .0756

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |   .1154092   .0384688     3.00   0.003     .0394548    .1913637
                  perc_tract_d_sq |  -.2508264   .1069537    -2.35   0.020    -.4620007   -.0396521
                  perc_tract_d_cu |    .170444   .0711611     2.40   0.018     .0299402    .3109478
                     perc_tract_c |   .1176371   .0365098     3.22   0.002     .0455504    .1897238
                  perc_tract_c_sq |  -.2794245   .0673651    -4.15   0.000    -.4124332   -.1464158
                  perc_tract_c_cu |   .1815133   .0434454     4.18   0.000     .0957328    .2672939
                       _yr_median |  -.0000198   .0002638    -0.08   0.940    -.0005406    .0005009
                       median_age |  -.0018038   .0005496    -3.28   0.001     -.002889   -.0007187
                male_female_ratio |   .0120995   .0125576     0.96   0.337    -.0126948    .0368939
                    perc_hs_total |  -.1171767   .0368388    -3.18   0.002     -.189913   -.0444405
               perc_somecol_total |   .0861978   .0825774     1.04   0.298    -.0768468    .2492423
                  perc_bach_total |   .4616059   .1147337     4.02   0.000     .2350705    .6881414
                   perc_pop_white |  -.5274211   .1493774    -3.53   0.001    -.8223587   -.2324836
                   perc_pop_black |   .0554143   .0675158     0.82   0.413     -.077892    .1887205
                   perc_pop_asian |  -.3266841   .0625967    -5.22   0.000    -.4502779   -.2030902
                                  |
                            city2 |
                          Albany  |  -.0186224    .037273    -0.50   0.618    -.0922159    .0549712
                         Altoona  |  -.1426388   .0212042    -6.73   0.000    -.1845052   -.1007723
                        Amarillo  |  -.2838497   .0093274   -30.43   0.000    -.3022661   -.2654333
                       Arlington  |   .0538454   .0491792     1.09   0.275    -.0432562     .150947
                         Atlanta  |  -.1025239   .0549851    -1.86   0.064    -.2110889    .0060412
                   Atlantic City  |   -.097423   .0548537    -1.78   0.078    -.2057287    .0108827
                         Augusta  |   .0702702    .046783     1.50   0.135    -.0221003    .1626407
                          Aurora  |  -.0410845    .055062    -0.75   0.457    -.1498015    .0676325
                          Austin  |    .012591   .0434894     0.29   0.773    -.0732763    .0984584
                       Baltimore  |  -.0453012   .0462316    -0.98   0.329     -.136583    .0459806
                        Bay City  |   .0288467   .0135052     2.14   0.034     .0021815     .055512
                        Beaumont  |   .0088032   .0336642     0.26   0.794     -.057665    .0752714
                         Belmont  |   .0231641   .0507075     0.46   0.648    -.0769552    .1232833
                      Bergen Co.  |  -.1518403   .0625961    -2.43   0.016    -.2754329   -.0282476
                      Birmingham  |  -.0574694   .0447673    -1.28   0.201    -.1458599    .0309212
                          Boston  |  -.0338435   .0590447    -0.57   0.567     -.150424     .082737
                        Brockton  |  -.0393239   .0493183    -0.80   0.426    -.1367002    .0580525
                           Bronx  |  -.1075809   .0671835    -1.60   0.111    -.2402311    .0250693
                       Brookline  |   .0088916   .0608813     0.15   0.884    -.1113152    .1290984
                        Brooklyn  |  -.1297017   .0514697    -2.52   0.013    -.2313258   -.0280776
                         Buffalo  |  -.0001898   .0286304    -0.01   0.995     -.056719    .0563394
                       Cambridge  |   .0199291   .0602538     0.33   0.741    -.0990388     .138897
                          Camden  |  -.0275955   .0287353    -0.96   0.338    -.0843318    .0291408
                          Canton  |  -.0126724   .0027744    -4.57   0.000    -.0181503   -.0071946
                       Charlotte  |  -.1353702   .0466617    -2.90   0.004    -.2275011   -.0432392
                     Chattanooga  |  -.0568602    .016061    -3.54   0.001    -.0885718   -.0251486
                         Chelsea  |   -.104497   .0742756    -1.41   0.161    -.2511501    .0421561
                         Chicago  |  -.0529028   .0578544    -0.91   0.362    -.1671333    .0613276
                       Cleveland  |  -.0347353   .0321107    -1.08   0.281    -.0981362    .0286656
                        Columbia  |  -.1134095   .0307683    -3.69   0.000    -.1741598   -.0526592
                        Columbus  |   .0220928   .0180551     1.22   0.223    -.0135561    .0577416
                  Council Bluffs  |  -.0264992   .0155316    -1.71   0.090    -.0571656    .0041671
                          Dallas  |  -.1516782   .0505197    -3.00   0.003    -.2514266   -.0519299
                       Davenport  |  -.0005067   .0035681    -0.14   0.887    -.0075517    .0065383
                          Dayton  |  -.0750951   .0177956    -4.22   0.000    -.1102315   -.0399588
                         Decatur  |  -.0700152   .0067916   -10.31   0.000    -.0834248   -.0566055
                          Denver  |   .0270915   .0449776     0.60   0.548    -.0617144    .1158973
                      Des Moines  |   .0148332   .0115827     1.28   0.202    -.0080362    .0377027
                         Detroit  |  -.0257845   .0306546    -0.84   0.401    -.0863104    .0347414
                         Dubuque  |   .0022116   .0152323     0.15   0.885    -.0278638     .032287
                          Duluth  |   .0911495   .0051145    17.82   0.000     .0810511    .1012478
                          Durham  |  -.0516648   .0536165    -0.96   0.337    -.1575276     .054198
                  East St. Louis  |  -.0442748   .0408763    -1.08   0.280    -.1249828    .0364332
                         El Paso  |  -.0564394    .050951    -1.11   0.270    -.1570394    .0441606
                          Elmira  |  -.0511773   .0084254    -6.07   0.000    -.0678127   -.0345419
                            Erie  |   .0403394   .0075606     5.34   0.000     .0254115    .0552674
                       Essex Co.  |  -.0922629   .0621363    -1.48   0.139    -.2149476    .0304219
                      Evansville  |  -.0259339   .0032008    -8.10   0.000    -.0322538    -.019614
                         Everett  |  -.0870835   .0511764    -1.70   0.091    -.1881285    .0139615
                           Flint  |  -.0131921   .0429363    -0.31   0.759    -.0979675    .0715833
                      Fort Wayne  |  -.0343434   .0180477    -1.90   0.059    -.0699776    .0012908
                      Fort Worth  |  -.0984339   .0424008    -2.32   0.021    -.1821519   -.0147159
                          Fresno  |   -.080003   .0503997    -1.59   0.114    -.1795145    .0195086
                       Galveston  |  -.0848967   .0295261    -2.88   0.005    -.1431944   -.0265989
                    Grand Rapids  |  -.0492876    .027642    -1.78   0.076    -.1038652    .0052899
             Greater Kansas City  |  -.0127725   .0375045    -0.34   0.734    -.0868231    .0612781
                      Greensboro  |  -.0760067   .0415738    -1.83   0.069    -.1580918    .0060785
                      Harrisburg  |   .0047328   .0302677     0.16   0.876    -.0550292    .0644947
                        Hartford  |   -.030406    .048326    -0.63   0.530    -.1258229     .065011
                Holyoke Chicopee  |  -.0221411   .0126725    -1.75   0.082    -.0471622      .00288
                         Houston  |  -.1099576   .0539692    -2.04   0.043    -.2165169   -.0033983
                      Hudson Co.  |   -.153259   .0737079    -2.08   0.039    -.2987913   -.0077268
                    Indianapolis  |  -.0540686   .0230817    -2.34   0.020    -.0996422    -.008495
                         Jackson  |  -.0376488   .0023448   -16.06   0.000    -.0422785    -.033019
                    Jacksonville  |   -.049343   .0216195    -2.28   0.024    -.0920295   -.0066565
                       Johnstown  |  -.0496486   .0229149    -2.17   0.032    -.0948928   -.0044043
                          Joliet  |  -.0674513   .0269443    -2.50   0.013    -.1206513   -.0142513
                         Kenosha  |   -.062617   .0087461    -7.16   0.000    -.0798857   -.0453483
                       Knoxville  |   .0471809   .0037308    12.65   0.000     .0398146    .0545472
                   Lake Co. Gary  |  -.0113244   .0627846    -0.18   0.857    -.1352892    .1126405
                         Lansing  |   .0376318   .0143517     2.62   0.010     .0092952    .0659684
                            Lima  |  -.1181418    .019081    -6.19   0.000    -.1558162   -.0804673
                         Lincoln  |  -.0120646   .0086177    -1.40   0.163    -.0290797    .0049505
                     Little Rock  |  -.0308866   .0346868    -0.89   0.375    -.0993738    .0376006
                     Los Angeles  |  -.0780365   .0683264    -1.14   0.255    -.2129434    .0568703
           Lower Westchester Co.  |  -.1464714   .0610344    -2.40   0.018    -.2669805   -.0259623
                           Macon  |  -.1629366   .0332208    -4.90   0.000    -.2285292    -.097344
                         Madison  |   .1202153   .0217297     5.53   0.000     .0773112    .1631194
                          Malden  |  -.0673879   .0525331    -1.28   0.201    -.1711117     .036336
                      Manchester  |  -.0450084   .0057709    -7.80   0.000    -.0564028    -.033614
                       Manhattan  |  -.0322144   .0716551    -0.45   0.654    -.1736935    .1092646
                         Medford  |  -.0411071   .0443326    -0.93   0.355    -.1286394    .0464253
                         Melrose  |  -.0034543   .0408267    -0.08   0.933    -.0840643    .0771558
                         Memphis  |  -.0700341   .0357541    -1.96   0.052    -.1406287    .0005604
                           Miami  |  -.3125614   .0803546    -3.89   0.000    -.4712172   -.1539056
                   Milwaukee Co.  |  -.0243793   .0336203    -0.73   0.469    -.0907608    .0420023
                     Minneapolis  |   .0484599   .0343354     1.41   0.160    -.0193334    .1162532
                          Mobile  |  -.2054973   .0386585    -5.32   0.000    -.2818263   -.1291682
                      Montgomery  |  -.1188447   .0240513    -4.94   0.000    -.1663326   -.0713568
                        Muskegon  |  -.0146115    .037967    -0.38   0.701    -.0895752    .0603522
                       Nashville  |  -.1048527   .0356377    -2.94   0.004    -.1752174   -.0344879
                     New Britain  |  -.0481282   .0245627    -1.96   0.052     -.096626    .0003696
                      New Castle  |  -.0161259   .0287261    -0.56   0.575     -.072844    .0405922
                       New Haven  |  -.0528143   .0268914    -1.96   0.051    -.1059098    .0002813
                     New Orleans  |  -.0450703   .0460368    -0.98   0.329    -.1359675    .0458269
                          Newton  |   .0112413   .0638804     0.18   0.861    -.1148871    .1373697
                   Niagara Falls  |  -.0011554   .0050382    -0.23   0.819     -.011103    .0087923
                         Norfolk  |   -.059835   .0443434    -1.35   0.179    -.1473886    .0277187
                         Oakland  |   .0178433   .0741128     0.24   0.810    -.1284884    .1641751
                           Ogden  |  -.1127925    .015952    -7.07   0.000    -.1442888   -.0812961
                   Oklahoma City  |  -.0881087   .0337625    -2.61   0.010     -.154771   -.0214464
                           Omaha  |  -.0259388   .0168933    -1.54   0.127    -.0592936    .0074161
                         Oshkosh  |   .0019303   .0108181     0.18   0.859    -.0194295      .02329
       Pawtucket & Central Falls  |    -.01338   .0219868    -0.61   0.544    -.0567918    .0300318
                          Peoria  |  -.0063804   .0227742    -0.28   0.780    -.0513468    .0385859
                    Philadelphia  |  -.0153714   .0429991    -0.36   0.721    -.1002708    .0695281
                         Phoenix  |  -.0144476   .0370664    -0.39   0.697    -.0876332    .0587379
                      Pittsburgh  |   .0149772   .0242322     0.62   0.537     -.032868    .0628224
                         Pontiac  |  -.0062474   .0286025    -0.22   0.827    -.0627214    .0502266
                     Port Arthur  |    -.08689   .0372117    -2.34   0.021    -.1603625   -.0134175
                        Portland  |   .1098673   .0401722     2.73   0.007     .0305496     .189185
                    Poughkeepsie  |  -.0734907   .0435025    -1.69   0.093    -.1593839    .0124026
                      Providence  |   -.038861   .0478611    -0.81   0.418    -.1333601    .0556382
                          Pueblo  |  -.0415571   .0191536    -2.17   0.031    -.0793749   -.0037393
                          Queens  |  -.1007981   .0715258    -1.41   0.161    -.2420219    .0404257
                          Quincy  |  -.0183086   .0388567    -0.47   0.638    -.0950291    .0584119
                          Racine  |  -.0319922   .0055572    -5.76   0.000    -.0429646   -.0210198
                          Revere  |  -.0326858   .0376474    -0.87   0.387    -.1070185    .0416469
                        Richmond  |  -.0792899   .0395501    -2.00   0.047    -.1573794   -.0012004
                       Rochester  |  -.0257385    .033754    -0.76   0.447     -.092384    .0409069
                        Rockford  |  -.0528237   .0152285    -3.47   0.001    -.0828914   -.0227559
                      Sacramento  |  -.0032591   .0513607    -0.06   0.949    -.1046681    .0981499
                         Saginaw  |  -.0242341   .0190039    -1.28   0.204    -.0617563    .0132882
                  Salt Lake City  |   .0359148   .0274589     1.31   0.193    -.0183012    .0901309
                     San Antonio  |   -.003524   .0406568    -0.09   0.931    -.0837986    .0767506
                       San Diego  |  -.0700246   .0599607    -1.17   0.245    -.1884136    .0483645
                   San Francisco  |  -.0031138   .0841754    -0.04   0.971    -.1693135     .163086
                        San Jose  |  -.0416303   .0666467    -0.62   0.533    -.1732205    .0899599
                        Savannah  |   .0071414   .0281402     0.25   0.800    -.0484199    .0627028
                     Schenectady  |  -.0835301   .0133386    -6.26   0.000    -.1098665   -.0571937
                         Seattle  |   .0649265   .0558025     1.16   0.246    -.0452524    .1751054
                      Shreveport  |  -.1915358     .05673    -3.38   0.001     -.303546   -.0795256
                      Sioux City  |  -.1429652   .0127443   -11.22   0.000    -.1681282   -.1178021
                      Somerville  |   .0648096    .050308     1.29   0.199    -.0345209    .1641401
                      South Bend  |   .0014529   .0132592     0.11   0.913    -.0247266    .0276324
                         Spokane  |  -.0442164   .0098981    -4.47   0.000    -.0637596   -.0246732
                     Springfield  |  -.0335837   .0080319    -4.18   0.000    -.0494422   -.0177252
                      St. Joseph  |  -.0417532    .013292    -3.14   0.002    -.0679976   -.0155087
                       St. Louis  |  -.0232524    .037584    -0.62   0.537    -.0974599    .0509551
                        St. Paul  |   .0543483   .0301272     1.80   0.073    -.0051363    .1138328
                  St. Petersburg  |  -.0532196   .0327351    -1.63   0.106    -.1178532     .011414
Stamford, Darien, and New Canaan  |  -.1622475   .0655206    -2.48   0.014    -.2916144   -.0328805
                   Staten Island  |  -.2051593   .0448131    -4.58   0.000    -.2936403   -.1166782
                        Stockton  |  -.0842067    .051369    -1.64   0.103    -.1856319    .0172186
                        Syracuse  |  -.0058598   .0115654    -0.51   0.613     -.028695    .0169755
                          Tacoma  |  -.0073676   .0298718    -0.25   0.805    -.0663478    .0516127
                           Tampa  |  -.1266395   .0448007    -2.83   0.005    -.2150962   -.0381829
                     Terre Haute  |  -.0757076   .0051346   -14.74   0.000    -.0858456   -.0655697
                          Toledo  |  -.0103257   .0152038    -0.68   0.498    -.0403448    .0196935
                          Topeka  |  -.0355972   .0103836    -3.43   0.001     -.056099   -.0150954
                         Trenton  |  -.0800434   .0551517    -1.45   0.149    -.1889375    .0288507
                           Tulsa  |  -.0854911   .0344478    -2.48   0.014    -.1535064   -.0174757
                       Union Co.  |    -.13518   .0647598    -2.09   0.038    -.2630447   -.0073153
                           Utica  |  -.0553461   .0110079    -5.03   0.000    -.0770806   -.0336115
                            Waco  |  -.1206859   .0310271    -3.89   0.000    -.1819472   -.0594247
                          Warren  |   .0433879   .0246245     1.76   0.080    -.0052318    .0920076
                       Waterbury  |  -.1228011   .0400885    -3.06   0.003    -.2019537   -.0436485
                        Waterloo  |   .0009712   .0068456     0.14   0.887     -.012545    .0144873
                       Watertown  |  -.0310716   .0462792    -0.67   0.503    -.1224475    .0603042
                         Wichita  |  -.1030968   .0278994    -3.70   0.000    -.1581826    -.048011
                    Wilkes-Barre  |  -.0615303    .005061   -12.16   0.000     -.071523   -.0515376
                   Winston-Salem  |  -.0381896    .033378    -1.14   0.254    -.1040925    .0277134
                      Woonsocket  |  -.0890218    .004621   -19.26   0.000    -.0981458   -.0798979
                            York  |  -.0561703   .0341644    -1.64   0.102     -.123626    .0112854
                      Youngstown  |  -.0133157    .016613    -0.80   0.424    -.0461172    .0194858
                                  |
                            _cons |    .967201    .045366    21.32   0.000     .8776283    1.056774
---------------------------------------------------------------------------------------------------

. testparm i.city2;

 ( 1)  2.city2 = 0
 ( 2)  3.city2 = 0
 ( 3)  4.city2 = 0
 ( 4)  5.city2 = 0
 ( 5)  7.city2 = 0
 ( 6)  8.city2 = 0
 ( 7)  9.city2 = 0
 ( 8)  10.city2 = 0
 ( 9)  11.city2 = 0
 (10)  12.city2 = 0
 (11)  14.city2 = 0
 (12)  15.city2 = 0
 (13)  16.city2 = 0
 (14)  17.city2 = 0
 (15)  20.city2 = 0
 (16)  21.city2 = 0
 (17)  23.city2 = 0
 (18)  24.city2 = 0
 (19)  25.city2 = 0
 (20)  26.city2 = 0
 (21)  27.city2 = 0
 (22)  28.city2 = 0
 (23)  29.city2 = 0
 (24)  30.city2 = 0
 (25)  32.city2 = 0
 (26)  33.city2 = 0
 (27)  34.city2 = 0
 (28)  36.city2 = 0
 (29)  37.city2 = 0
 (30)  38.city2 = 0
 (31)  39.city2 = 0
 (32)  40.city2 = 0
 (33)  42.city2 = 0
 (34)  43.city2 = 0
 (35)  44.city2 = 0
 (36)  45.city2 = 0
 (37)  47.city2 = 0
 (38)  48.city2 = 0
 (39)  49.city2 = 0
 (40)  50.city2 = 0
 (41)  51.city2 = 0
 (42)  52.city2 = 0
 (43)  53.city2 = 0
 (44)  54.city2 = 0
 (45)  55.city2 = 0
 (46)  56.city2 = 0
 (47)  57.city2 = 0
 (48)  58.city2 = 0
 (49)  59.city2 = 0
 (50)  60.city2 = 0
 (51)  61.city2 = 0
 (52)  62.city2 = 0
 (53)  63.city2 = 0
 (54)  64.city2 = 0
 (55)  65.city2 = 0
 (56)  66.city2 = 0
 (57)  67.city2 = 0
 (58)  69.city2 = 0
 (59)  70.city2 = 0
 (60)  72.city2 = 0
 (61)  73.city2 = 0
 (62)  74.city2 = 0
 (63)  76.city2 = 0
 (64)  77.city2 = 0
 (65)  78.city2 = 0
 (66)  79.city2 = 0
 (67)  80.city2 = 0
 (68)  82.city2 = 0
 (69)  83.city2 = 0
 (70)  84.city2 = 0
 (71)  86.city2 = 0
 (72)  88.city2 = 0
 (73)  89.city2 = 0
 (74)  90.city2 = 0
 (75)  92.city2 = 0
 (76)  94.city2 = 0
 (77)  96.city2 = 0
 (78)  97.city2 = 0
 (79)  98.city2 = 0
 (80)  99.city2 = 0
 (81)  100.city2 = 0
 (82)  101.city2 = 0
 (83)  102.city2 = 0
 (84)  103.city2 = 0
 (85)  104.city2 = 0
 (86)  106.city2 = 0
 (87)  107.city2 = 0
 (88)  108.city2 = 0
 (89)  109.city2 = 0
 (90)  111.city2 = 0
 (91)  112.city2 = 0
 (92)  114.city2 = 0
 (93)  115.city2 = 0
 (94)  116.city2 = 0
 (95)  117.city2 = 0
 (96)  119.city2 = 0
 (97)  120.city2 = 0
 (98)  121.city2 = 0
 (99)  122.city2 = 0
 (100)  123.city2 = 0
 (101)  124.city2 = 0
 (102)  125.city2 = 0
 (103)  126.city2 = 0
 (104)  127.city2 = 0
 (105)  128.city2 = 0
 (106)  129.city2 = 0
 (107)  130.city2 = 0
 (108)  131.city2 = 0
 (109)  132.city2 = 0
 (110)  133.city2 = 0
 (111)  134.city2 = 0
 (112)  136.city2 = 0
 (113)  137.city2 = 0
 (114)  138.city2 = 0
 (115)  139.city2 = 0
 (116)  140.city2 = 0
 (117)  141.city2 = 0
 (118)  142.city2 = 0
 (119)  143.city2 = 0
 (120)  145.city2 = 0
 (121)  146.city2 = 0
 (122)  147.city2 = 0
 (123)  148.city2 = 0
 (124)  149.city2 = 0
 (125)  150.city2 = 0
 (126)  151.city2 = 0
 (127)  152.city2 = 0
 (128)  153.city2 = 0
 (129)  155.city2 = 0
 (130)  156.city2 = 0
 (131)  157.city2 = 0
 (132)  158.city2 = 0
 (133)  159.city2 = 0
 (134)  160.city2 = 0
 (135)  161.city2 = 0
 (136)  162.city2 = 0
 (137)  163.city2 = 0
 (138)  164.city2 = 0
 (139)  165.city2 = 0
 (140)  166.city2 = 0
 (141)  167.city2 = 0
 (142)  168.city2 = 0
 (143)  169.city2 = 0
 (144)  170.city2 = 0
 (145)  171.city2 = 0
 (146)  172.city2 = 0
 (147)  173.city2 = 0
 (148)  174.city2 = 0
 (149)  175.city2 = 0
 (150)  176.city2 = 0
 (151)  177.city2 = 0
 (152)  179.city2 = 0
 (153)  180.city2 = 0
 (154)  181.city2 = 0
 (155)  182.city2 = 0
 (156)  184.city2 = 0
 (157)  185.city2 = 0
 (158)  186.city2 = 0
 (159)  187.city2 = 0
 (160)  189.city2 = 0
 (161)  190.city2 = 0
 (162)  192.city2 = 0
 (163)  194.city2 = 0
 (164)  195.city2 = 0
 (165)  196.city2 = 0
       Constraint 1 dropped
       Constraint 2 dropped
       Constraint 3 dropped
       Constraint 4 dropped
       Constraint 5 dropped
       Constraint 6 dropped
       Constraint 8 dropped
       Constraint 9 dropped
       Constraint 10 dropped
       Constraint 11 dropped
       Constraint 12 dropped
       Constraint 13 dropped
       Constraint 14 dropped
       Constraint 15 dropped
       Constraint 16 dropped
       Constraint 17 dropped
       Constraint 18 dropped
       Constraint 19 dropped
       Constraint 20 dropped
       Constraint 21 dropped
       Constraint 22 dropped
       Constraint 23 dropped
       Constraint 24 dropped
       Constraint 25 dropped
       Constraint 26 dropped
       Constraint 28 dropped
       Constraint 29 dropped
       Constraint 30 dropped
       Constraint 31 dropped
       Constraint 32 dropped
       Constraint 33 dropped
       Constraint 34 dropped
       Constraint 35 dropped
       Constraint 36 dropped
       Constraint 37 dropped
       Constraint 38 dropped
       Constraint 39 dropped
       Constraint 40 dropped
       Constraint 41 dropped
       Constraint 42 dropped
       Constraint 44 dropped
       Constraint 45 dropped
       Constraint 46 dropped
       Constraint 47 dropped
       Constraint 48 dropped
       Constraint 49 dropped
       Constraint 50 dropped
       Constraint 52 dropped
       Constraint 54 dropped
       Constraint 55 dropped
       Constraint 56 dropped
       Constraint 58 dropped
       Constraint 59 dropped
       Constraint 60 dropped
       Constraint 61 dropped
       Constraint 62 dropped
       Constraint 63 dropped
       Constraint 64 dropped
       Constraint 65 dropped
       Constraint 66 dropped
       Constraint 67 dropped
       Constraint 69 dropped
       Constraint 71 dropped
       Constraint 72 dropped
       Constraint 73 dropped
       Constraint 74 dropped
       Constraint 75 dropped
       Constraint 76 dropped
       Constraint 77 dropped
       Constraint 78 dropped
       Constraint 79 dropped
       Constraint 80 dropped
       Constraint 81 dropped
       Constraint 82 dropped
       Constraint 84 dropped
       Constraint 85 dropped
       Constraint 86 dropped
       Constraint 87 dropped
       Constraint 88 dropped
       Constraint 89 dropped
       Constraint 90 dropped
       Constraint 91 dropped
       Constraint 92 dropped
       Constraint 93 dropped
       Constraint 94 dropped
       Constraint 95 dropped
       Constraint 96 dropped
       Constraint 97 dropped
       Constraint 98 dropped
       Constraint 99 dropped
       Constraint 100 dropped
       Constraint 101 dropped
       Constraint 102 dropped
       Constraint 104 dropped
       Constraint 105 dropped
       Constraint 106 dropped
       Constraint 107 dropped
       Constraint 108 dropped
       Constraint 109 dropped
       Constraint 111 dropped
       Constraint 112 dropped
       Constraint 113 dropped
       Constraint 114 dropped
       Constraint 115 dropped
       Constraint 116 dropped
       Constraint 117 dropped
       Constraint 118 dropped
       Constraint 120 dropped
       Constraint 121 dropped
       Constraint 122 dropped
       Constraint 123 dropped
       Constraint 124 dropped
       Constraint 125 dropped
       Constraint 126 dropped
       Constraint 128 dropped
       Constraint 129 dropped
       Constraint 130 dropped
       Constraint 131 dropped
       Constraint 132 dropped
       Constraint 133 dropped
       Constraint 134 dropped
       Constraint 135 dropped
       Constraint 136 dropped
       Constraint 137 dropped
       Constraint 138 dropped
       Constraint 139 dropped
       Constraint 140 dropped
       Constraint 141 dropped
       Constraint 142 dropped
       Constraint 143 dropped
       Constraint 145 dropped
       Constraint 146 dropped
       Constraint 147 dropped
       Constraint 148 dropped
       Constraint 149 dropped
       Constraint 150 dropped
       Constraint 151 dropped
       Constraint 152 dropped
       Constraint 153 dropped
       Constraint 154 dropped
       Constraint 155 dropped
       Constraint 156 dropped
       Constraint 157 dropped
       Constraint 158 dropped
       Constraint 159 dropped
       Constraint 160 dropped
       Constraint 161 dropped
       Constraint 163 dropped
       Constraint 164 dropped
       Constraint 165 dropped

       F( 15,   165) =  200.65
            Prob > F =    0.0000

. scalar f_p_value = r(F);

. estadd scalar f_p_value = r(F);

added scalar:
          e(f_p_value) =  200.65408

. eststo reg_all_cov_no_c: regress tract_dvoteshare perc_tract_d perc_tract_d_sq 
> perc_tract_d_cu $controls i.city2 
> if incl == 1, cluster(city2);

Linear regression                               Number of obs     =      6,037
                                                F(11, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7485
                                                Root MSE          =     .07577

                                                     (Std. err. adjusted for 166 clusters in city2)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 tract_dvoteshare | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
                     perc_tract_d |   .0794858   .0443789     1.79   0.075    -.0081378    .1671095
                  perc_tract_d_sq |  -.1343012   .0964657    -1.39   0.166    -.3247675    .0561651
                  perc_tract_d_cu |   .0761377   .0644274     1.18   0.239    -.0510706     .203346
                       _yr_median |  -.0000572   .0002488    -0.23   0.818    -.0005484    .0004339
                       median_age |  -.0018962   .0005239    -3.62   0.000    -.0029305   -.0008619
                male_female_ratio |   .0130369   .0125514     1.04   0.300    -.0117452     .037819
                    perc_hs_total |  -.1157805   .0368054    -3.15   0.002    -.1884506   -.0431103
               perc_somecol_total |   .0790948     .08041     0.98   0.327    -.0796703      .23786
                  perc_bach_total |   .4592745   .1136551     4.04   0.000     .2348686    .6836804
                   perc_pop_white |   -.527728   .1494979    -3.53   0.001    -.8229035   -.2325525
                   perc_pop_black |   .0550249   .0681202     0.81   0.420    -.0794747    .1895245
                   perc_pop_asian |  -.3264681   .0617837    -5.28   0.000    -.4484567   -.2044796
                                  |
                            city2 |
                          Albany  |  -.0193586   .0375065    -0.52   0.606    -.0934132     .054696
                         Altoona  |  -.1430531   .0228129    -6.27   0.000    -.1880959   -.0980103
                        Amarillo  |   -.290293   .0130144   -22.31   0.000    -.3159893   -.2645968
                       Arlington  |   .0590247   .0489753     1.21   0.230    -.0376744    .1557237
                         Atlanta  |  -.0990992   .0535257    -1.85   0.066    -.2047829    .0065845
                   Atlantic City  |  -.0960914   .0544778    -1.76   0.080    -.2036549    .0114721
                         Augusta  |   .0726255   .0469473     1.55   0.124    -.0200693    .1653204
                          Aurora  |  -.0417217   .0559139    -0.75   0.457    -.1521207    .0686773
                          Austin  |   .0090905   .0456425     0.20   0.842    -.0810281     .099209
                       Baltimore  |  -.0446652   .0467134    -0.96   0.340    -.1368983     .047568
                        Bay City  |   .0232104    .011395     2.04   0.043     .0007116    .0457091
                        Beaumont  |   .0051192   .0366265     0.14   0.889    -.0671978    .0774362
                         Belmont  |   .0254348   .0497836     0.51   0.610    -.0728602    .1237297
                      Bergen Co.  |  -.1484973   .0612926    -2.42   0.016    -.2695162   -.0274784
                      Birmingham  |  -.0554884   .0444483    -1.25   0.214    -.1432492    .0322725
                          Boston  |  -.0287851   .0576113    -0.50   0.618    -.1425355    .0849653
                        Brockton  |  -.0357312   .0478915    -0.75   0.457    -.1302903    .0588279
                           Bronx  |  -.1051551   .0668471    -1.57   0.118     -.237141    .0268309
                       Brookline  |   .0146295   .0587805     0.25   0.804    -.1014294    .1306883
                        Brooklyn  |  -.1287372   .0516705    -2.49   0.014    -.2307578   -.0267166
                         Buffalo  |  -.0045191   .0297371    -0.15   0.879    -.0632333    .0541951
                       Cambridge  |   .0242348   .0587346     0.41   0.680    -.0917334    .1402031
                          Camden  |  -.0286016   .0284397    -1.01   0.316    -.0847541     .027551
                          Canton  |  -.0151289   .0026688    -5.67   0.000    -.0203982   -.0098596
                       Charlotte  |  -.1336077    .046489    -2.87   0.005    -.2253976   -.0418177
                     Chattanooga  |  -.0613898   .0168702    -3.64   0.000     -.094699   -.0280806
                         Chelsea  |  -.1005675   .0736214    -1.37   0.174    -.2459288    .0447939
                         Chicago  |  -.0481423   .0566223    -0.85   0.396      -.15994    .0636553
                       Cleveland  |  -.0350195   .0323666    -1.08   0.281    -.0989257    .0288866
                        Columbia  |  -.1084962   .0314901    -3.45   0.001    -.1706718   -.0463206
                        Columbus  |   .0223846   .0178443     1.25   0.211     -.012848    .0576171
                  Council Bluffs  |  -.0290589   .0119717    -2.43   0.016    -.0526965   -.0054214
                          Dallas  |  -.1508449   .0496125    -3.04   0.003    -.2488021   -.0528878
                       Davenport  |   .0020974   .0033344     0.63   0.530    -.0044862    .0086809
                          Dayton  |  -.0792001   .0191103    -4.14   0.000    -.1169322   -.0414679
                         Decatur  |  -.0701337   .0058669   -11.95   0.000    -.0817175   -.0585499
                          Denver  |    .031833   .0430907     0.74   0.461    -.0532472    .1169132
                      Des Moines  |   .0140531   .0124915     1.13   0.262    -.0106107    .0387168
                         Detroit  |  -.0240581   .0304058    -0.79   0.430    -.0840926    .0359764
                         Dubuque  |  -.0017725   .0104156    -0.17   0.865    -.0223376    .0187925
                          Duluth  |   .0913297     .00548    16.67   0.000     .0805097    .1021497
                          Durham  |   -.049499   .0534357    -0.93   0.356    -.1550049     .056007
                  East St. Louis  |  -.0433208   .0415229    -1.04   0.298    -.1253056     .038664
                         El Paso  |  -.0575297   .0527847    -1.09   0.277    -.1617502    .0466907
                          Elmira  |  -.0539448   .0075259    -7.17   0.000    -.0688042   -.0390854
                            Erie  |   .0370541   .0065266     5.68   0.000     .0241677    .0499405
                       Essex Co.  |  -.0911009   .0618779    -1.47   0.143    -.2132754    .0310736
                      Evansville  |  -.0243384   .0024141   -10.08   0.000    -.0291048   -.0195719
                         Everett  |  -.0831236   .0496649    -1.67   0.096    -.1811842     .014937
                           Flint  |  -.0135039   .0417275    -0.32   0.747    -.0958927    .0688849
                      Fort Wayne  |  -.0355614   .0154569    -2.30   0.023    -.0660801   -.0050426
                      Fort Worth  |  -.1011295   .0448168    -2.26   0.025    -.1896179   -.0126411
                          Fresno  |  -.0794094   .0490037    -1.62   0.107    -.1761646    .0173457
                       Galveston  |   -.091641   .0326517    -2.81   0.006      -.15611   -.0271721
                    Grand Rapids  |  -.0454283   .0261782    -1.74   0.085    -.0971158    .0062592
             Greater Kansas City  |  -.0110453   .0369453    -0.30   0.765    -.0839917    .0619012
                      Greensboro  |  -.0714333   .0401391    -1.78   0.077    -.1506857    .0078191
                      Harrisburg  |  -.0020359   .0351141    -0.06   0.954    -.0713667     .067295
                        Hartford  |   -.031212   .0483975    -0.64   0.520    -.1267702    .0643461
                Holyoke Chicopee  |  -.0205518   .0119806    -1.72   0.088    -.0442067    .0031032
                         Houston  |  -.1155443   .0560445    -2.06   0.041    -.2262012   -.0048874
                      Hudson Co.  |  -.1500022    .072865    -2.06   0.041    -.2938702   -.0061343
                    Indianapolis  |  -.0514262   .0226661    -2.27   0.025    -.0961791   -.0066733
                         Jackson  |  -.0392268   .0028266   -13.88   0.000    -.0448076   -.0336459
                    Jacksonville  |  -.0469398   .0222107    -2.11   0.036    -.0907937   -.0030859
                       Johnstown  |  -.0501776   .0235556    -2.13   0.035    -.0966868   -.0036684
                          Joliet  |  -.0696247   .0281854    -2.47   0.015    -.1252752   -.0139742
                         Kenosha  |  -.0624059    .007808    -7.99   0.000    -.0778224   -.0469894
                       Knoxville  |    .048969   .0031266    15.66   0.000     .0427957    .0551423
                   Lake Co. Gary  |  -.0106135   .0600465    -0.18   0.860    -.1291719     .107945
                         Lansing  |   .0405043   .0133131     3.04   0.003     .0142183    .0667904
                            Lima  |  -.1246189   .0174234    -7.15   0.000    -.1590205   -.0902174
                         Lincoln  |  -.0132486   .0089778    -1.48   0.142    -.0309748    .0044776
                     Little Rock  |   -.026137   .0345671    -0.76   0.451    -.0943879    .0421139
                     Los Angeles  |  -.0750909   .0677293    -1.11   0.269    -.2088186    .0586369
           Lower Westchester Co.  |  -.1489126   .0625235    -2.38   0.018    -.2723619   -.0254633
                           Macon  |  -.1641101   .0341244    -4.81   0.000    -.2314868   -.0967334
                         Madison  |    .122522   .0213758     5.73   0.000     .0803167    .1647273
                          Malden  |  -.0629332   .0514515    -1.22   0.223    -.1645214     .038655
                      Manchester  |  -.0432206   .0051004    -8.47   0.000    -.0532911   -.0331501
                       Manhattan  |  -.0321893   .0722662    -0.45   0.657     -.174875    .1104963
                         Medford  |  -.0367669   .0415343    -0.89   0.377    -.1187741    .0452403
                         Melrose  |   .0001324   .0390316     0.00   0.997    -.0769333    .0771982
                         Memphis  |   -.070652   .0362444    -1.95   0.053    -.1422146    .0009107
                           Miami  |  -.3122878   .0802215    -3.89   0.000    -.4706807   -.1538949
                   Milwaukee Co.  |  -.0234465   .0336209    -0.70   0.487    -.0898292    .0429361
                     Minneapolis  |   .0478998   .0356427     1.34   0.181    -.0224748    .1182743
                          Mobile  |  -.2046046   .0367542    -5.57   0.000    -.2771737   -.1320355
                      Montgomery  |  -.1187906   .0245699    -4.83   0.000    -.1673025   -.0702786
                        Muskegon  |  -.0142009   .0399123    -0.36   0.722    -.0930056    .0646039
                       Nashville  |  -.1047278    .036435    -2.87   0.005    -.1766668   -.0327888
                     New Britain  |  -.0494526   .0254864    -1.94   0.054    -.0997741    .0008688
                      New Castle  |   -.015098   .0303339    -0.50   0.619    -.0749906    .0447946
                       New Haven  |  -.0514264   .0255402    -2.01   0.046    -.1018541   -.0009987
                     New Orleans  |  -.0429076   .0453994    -0.95   0.346    -.1325462     .046731
                          Newton  |   .0137424   .0618663     0.22   0.824    -.1084094    .1358941
                   Niagara Falls  |   -.007917    .006617    -1.20   0.233     -.020982     .005148
                         Norfolk  |    -.05577   .0430528    -1.30   0.197    -.1407755    .0292354
                         Oakland  |   .0186153   .0737178     0.25   0.801    -.1269364     .164167
                           Ogden  |  -.1152954   .0174183    -6.62   0.000    -.1496868   -.0809039
                   Oklahoma City  |  -.0897494   .0348106    -2.58   0.011    -.1584809   -.0210178
                           Omaha  |  -.0337337   .0202716    -1.66   0.098    -.0737589    .0062915
                         Oshkosh  |   .0040492   .0104826     0.39   0.700    -.0166481    .0247466
       Pawtucket & Central Falls  |  -.0205888   .0249975    -0.82   0.411     -.069945    .0287675
                          Peoria  |  -.0062613   .0215719    -0.29   0.772    -.0488537    .0363312
                    Philadelphia  |  -.0176146   .0443205    -0.40   0.692     -.105123    .0698938
                         Phoenix  |  -.0208871   .0403557    -0.52   0.605    -.1005672     .058793
                      Pittsburgh  |   .0146625   .0247022     0.59   0.554    -.0341106    .0634356
                         Pontiac  |  -.0087332   .0300089    -0.29   0.771    -.0679842    .0505178
                     Port Arthur  |  -.0988989   .0422253    -2.34   0.020    -.1822703   -.0155274
                        Portland  |   .1126117   .0398192     2.83   0.005     .0339907    .1912326
                    Poughkeepsie  |  -.0700142   .0448105    -1.56   0.120    -.1584902    .0184617
                      Providence  |  -.0380143   .0477185    -0.80   0.427    -.1322319    .0562032
                          Pueblo  |   -.048001   .0225822    -2.13   0.035    -.0925884   -.0034136
                          Queens  |  -.0945038   .0698763    -1.35   0.178    -.2324708    .0434632
                          Quincy  |  -.0127114    .036587    -0.35   0.729    -.0849504    .0595277
                          Racine  |  -.0282289   .0048297    -5.84   0.000    -.0377649    -.018693
                          Revere  |  -.0273398   .0364217    -0.75   0.454    -.0992523    .0445728
                        Richmond  |  -.0766286   .0392184    -1.95   0.052    -.1540632     .000806
                       Rochester  |   -.023928   .0331286    -0.72   0.471    -.0893386    .0414826
                        Rockford  |  -.0531799   .0145028    -3.67   0.000    -.0818148   -.0245449
                      Sacramento  |  -.0029182   .0484223    -0.06   0.952    -.0985255    .0926891
                         Saginaw  |  -.0223793   .0169541    -1.32   0.189    -.0558542    .0110956
                  Salt Lake City  |   .0330101   .0286563     1.15   0.251    -.0235703    .0895905
                     San Antonio  |  -.0046269   .0420418    -0.11   0.912    -.0876362    .0783824
                       San Diego  |  -.0671938   .0592395    -1.13   0.258     -.184159    .0497714
                   San Francisco  |  -.0002844    .083416    -0.00   0.997    -.1649847    .1644159
                        San Jose  |  -.0363574   .0663878    -0.55   0.585    -.1674365    .0947217
                        Savannah  |    .005356   .0275838     0.19   0.846    -.0491068    .0598188
                     Schenectady  |  -.0800343   .0106781    -7.50   0.000    -.1011177    -.058951
                         Seattle  |   .0666675   .0559097     1.19   0.235    -.0437231    .1770582
                      Shreveport  |   -.187819   .0557696    -3.37   0.001    -.2979331   -.0777049
                      Sioux City  |  -.1431363   .0134776   -10.62   0.000     -.169747   -.1165256
                      Somerville  |   .0707297   .0477974     1.48   0.141    -.0236436     .165103
                      South Bend  |  -.0018144   .0133223    -0.14   0.892    -.0281186    .0244897
                         Spokane  |  -.0418243   .0088416    -4.73   0.000    -.0592815    -.024367
                     Springfield  |  -.0320351   .0088259    -3.63   0.000    -.0494614   -.0146088
                      St. Joseph  |  -.0442785   .0123341    -3.59   0.000    -.0686316   -.0199255
                       St. Louis  |  -.0253662   .0388862    -0.65   0.515    -.1021448    .0514124
                        St. Paul  |   .0541827   .0312584     1.73   0.085    -.0075353    .1159007
                  St. Petersburg  |   -.052978   .0314064    -1.69   0.094    -.1149883    .0090323
Stamford, Darien, and New Canaan  |  -.1632861   .0660993    -2.47   0.015    -.2937956   -.0327765
                   Staten Island  |  -.2022773   .0438906    -4.61   0.000    -.2889369   -.1156176
                        Stockton  |  -.0798125   .0514376    -1.55   0.123    -.1813732    .0217483
                        Syracuse  |  -.0095004   .0125709    -0.76   0.451     -.034321    .0153203
                          Tacoma  |  -.0039412   .0292246    -0.13   0.893    -.0616435    .0537611
                           Tampa  |  -.1253785   .0449559    -2.79   0.006    -.2141414   -.0366156
                     Terre Haute  |  -.0749355   .0054463   -13.76   0.000     -.085689    -.064182
                          Toledo  |  -.0125367   .0161299    -0.78   0.438    -.0443844    .0193109
                          Topeka  |  -.0329579   .0125347    -2.63   0.009     -.057707   -.0082089
                         Trenton  |  -.0785566   .0549363    -1.43   0.155    -.1870253    .0299121
                           Tulsa  |  -.0873805   .0355201    -2.46   0.015     -.157513   -.0172479
                       Union Co.  |  -.1339911   .0646215    -2.07   0.040    -.2615828   -.0063994
                           Utica  |  -.0550213   .0104913    -5.24   0.000    -.0757359   -.0343068
                            Waco  |  -.1233277   .0325471    -3.79   0.000    -.1875901   -.0590652
                          Warren  |   .0447442   .0228772     1.96   0.052    -.0004256    .0899139
                       Waterbury  |  -.1227313   .0399817    -3.07   0.003    -.2016729   -.0437897
                        Waterloo  |  -.0019125   .0081621    -0.23   0.815    -.0180282    .0142032
                       Watertown  |  -.0224416   .0430133    -0.52   0.603     -.107369    .0624859
                         Wichita  |  -.1048063   .0289664    -3.62   0.000    -.1619989   -.0476137
                    Wilkes-Barre  |  -.0732948   .0086513    -8.47   0.000    -.0903763   -.0562133
                   Winston-Salem  |  -.0374386   .0339468    -1.10   0.272    -.1044647    .0295874
                      Woonsocket  |  -.0937864   .0068044   -13.78   0.000    -.1072213   -.0803514
                            York  |  -.0569692   .0342322    -1.66   0.098    -.1245588    .0106204
                      Youngstown  |  -.0120929   .0165257    -0.73   0.465    -.0447221    .0205362
                                  |
                            _cons |   .9851353   .0527399    18.68   0.000     .8810032    1.089267
---------------------------------------------------------------------------------------------------

. testparm i.city2;

 ( 1)  2.city2 = 0
 ( 2)  3.city2 = 0
 ( 3)  4.city2 = 0
 ( 4)  5.city2 = 0
 ( 5)  7.city2 = 0
 ( 6)  8.city2 = 0
 ( 7)  9.city2 = 0
 ( 8)  10.city2 = 0
 ( 9)  11.city2 = 0
 (10)  12.city2 = 0
 (11)  14.city2 = 0
 (12)  15.city2 = 0
 (13)  16.city2 = 0
 (14)  17.city2 = 0
 (15)  20.city2 = 0
 (16)  21.city2 = 0
 (17)  23.city2 = 0
 (18)  24.city2 = 0
 (19)  25.city2 = 0
 (20)  26.city2 = 0
 (21)  27.city2 = 0
 (22)  28.city2 = 0
 (23)  29.city2 = 0
 (24)  30.city2 = 0
 (25)  32.city2 = 0
 (26)  33.city2 = 0
 (27)  34.city2 = 0
 (28)  36.city2 = 0
 (29)  37.city2 = 0
 (30)  38.city2 = 0
 (31)  39.city2 = 0
 (32)  40.city2 = 0
 (33)  42.city2 = 0
 (34)  43.city2 = 0
 (35)  44.city2 = 0
 (36)  45.city2 = 0
 (37)  47.city2 = 0
 (38)  48.city2 = 0
 (39)  49.city2 = 0
 (40)  50.city2 = 0
 (41)  51.city2 = 0
 (42)  52.city2 = 0
 (43)  53.city2 = 0
 (44)  54.city2 = 0
 (45)  55.city2 = 0
 (46)  56.city2 = 0
 (47)  57.city2 = 0
 (48)  58.city2 = 0
 (49)  59.city2 = 0
 (50)  60.city2 = 0
 (51)  61.city2 = 0
 (52)  62.city2 = 0
 (53)  63.city2 = 0
 (54)  64.city2 = 0
 (55)  65.city2 = 0
 (56)  66.city2 = 0
 (57)  67.city2 = 0
 (58)  69.city2 = 0
 (59)  70.city2 = 0
 (60)  72.city2 = 0
 (61)  73.city2 = 0
 (62)  74.city2 = 0
 (63)  76.city2 = 0
 (64)  77.city2 = 0
 (65)  78.city2 = 0
 (66)  79.city2 = 0
 (67)  80.city2 = 0
 (68)  82.city2 = 0
 (69)  83.city2 = 0
 (70)  84.city2 = 0
 (71)  86.city2 = 0
 (72)  88.city2 = 0
 (73)  89.city2 = 0
 (74)  90.city2 = 0
 (75)  92.city2 = 0
 (76)  94.city2 = 0
 (77)  96.city2 = 0
 (78)  97.city2 = 0
 (79)  98.city2 = 0
 (80)  99.city2 = 0
 (81)  100.city2 = 0
 (82)  101.city2 = 0
 (83)  102.city2 = 0
 (84)  103.city2 = 0
 (85)  104.city2 = 0
 (86)  106.city2 = 0
 (87)  107.city2 = 0
 (88)  108.city2 = 0
 (89)  109.city2 = 0
 (90)  111.city2 = 0
 (91)  112.city2 = 0
 (92)  114.city2 = 0
 (93)  115.city2 = 0
 (94)  116.city2 = 0
 (95)  117.city2 = 0
 (96)  119.city2 = 0
 (97)  120.city2 = 0
 (98)  121.city2 = 0
 (99)  122.city2 = 0
 (100)  123.city2 = 0
 (101)  124.city2 = 0
 (102)  125.city2 = 0
 (103)  126.city2 = 0
 (104)  127.city2 = 0
 (105)  128.city2 = 0
 (106)  129.city2 = 0
 (107)  130.city2 = 0
 (108)  131.city2 = 0
 (109)  132.city2 = 0
 (110)  133.city2 = 0
 (111)  134.city2 = 0
 (112)  136.city2 = 0
 (113)  137.city2 = 0
 (114)  138.city2 = 0
 (115)  139.city2 = 0
 (116)  140.city2 = 0
 (117)  141.city2 = 0
 (118)  142.city2 = 0
 (119)  143.city2 = 0
 (120)  145.city2 = 0
 (121)  146.city2 = 0
 (122)  147.city2 = 0
 (123)  148.city2 = 0
 (124)  149.city2 = 0
 (125)  150.city2 = 0
 (126)  151.city2 = 0
 (127)  152.city2 = 0
 (128)  153.city2 = 0
 (129)  155.city2 = 0
 (130)  156.city2 = 0
 (131)  157.city2 = 0
 (132)  158.city2 = 0
 (133)  159.city2 = 0
 (134)  160.city2 = 0
 (135)  161.city2 = 0
 (136)  162.city2 = 0
 (137)  163.city2 = 0
 (138)  164.city2 = 0
 (139)  165.city2 = 0
 (140)  166.city2 = 0
 (141)  167.city2 = 0
 (142)  168.city2 = 0
 (143)  169.city2 = 0
 (144)  170.city2 = 0
 (145)  171.city2 = 0
 (146)  172.city2 = 0
 (147)  173.city2 = 0
 (148)  174.city2 = 0
 (149)  175.city2 = 0
 (150)  176.city2 = 0
 (151)  177.city2 = 0
 (152)  179.city2 = 0
 (153)  180.city2 = 0
 (154)  181.city2 = 0
 (155)  182.city2 = 0
 (156)  184.city2 = 0
 (157)  185.city2 = 0
 (158)  186.city2 = 0
 (159)  187.city2 = 0
 (160)  189.city2 = 0
 (161)  190.city2 = 0
 (162)  192.city2 = 0
 (163)  194.city2 = 0
 (164)  195.city2 = 0
 (165)  196.city2 = 0
       Constraint 1 dropped
       Constraint 2 dropped
       Constraint 3 dropped
       Constraint 4 dropped
       Constraint 5 dropped
       Constraint 6 dropped
       Constraint 9 dropped
       Constraint 10 dropped
       Constraint 11 dropped
       Constraint 12 dropped
       Constraint 13 dropped
       Constraint 14 dropped
       Constraint 15 dropped
       Constraint 16 dropped
       Constraint 17 dropped
       Constraint 18 dropped
       Constraint 19 dropped
       Constraint 20 dropped
       Constraint 21 dropped
       Constraint 22 dropped
       Constraint 23 dropped
       Constraint 24 dropped
       Constraint 25 dropped
       Constraint 26 dropped
       Constraint 28 dropped
       Constraint 29 dropped
       Constraint 30 dropped
       Constraint 31 dropped
       Constraint 32 dropped
       Constraint 33 dropped
       Constraint 34 dropped
       Constraint 35 dropped
       Constraint 36 dropped
       Constraint 37 dropped
       Constraint 38 dropped
       Constraint 39 dropped
       Constraint 40 dropped
       Constraint 41 dropped
       Constraint 42 dropped
       Constraint 44 dropped
       Constraint 45 dropped
       Constraint 46 dropped
       Constraint 47 dropped
       Constraint 48 dropped
       Constraint 49 dropped
       Constraint 50 dropped
       Constraint 51 dropped
       Constraint 52 dropped
       Constraint 53 dropped
       Constraint 54 dropped
       Constraint 55 dropped
       Constraint 56 dropped
       Constraint 58 dropped
       Constraint 59 dropped
       Constraint 60 dropped
       Constraint 61 dropped
       Constraint 62 dropped
       Constraint 63 dropped
       Constraint 64 dropped
       Constraint 65 dropped
       Constraint 66 dropped
       Constraint 67 dropped
       Constraint 69 dropped
       Constraint 70 dropped
       Constraint 71 dropped
       Constraint 72 dropped
       Constraint 73 dropped
       Constraint 74 dropped
       Constraint 75 dropped
       Constraint 77 dropped
       Constraint 78 dropped
       Constraint 79 dropped
       Constraint 80 dropped
       Constraint 81 dropped
       Constraint 82 dropped
       Constraint 83 dropped
       Constraint 84 dropped
       Constraint 85 dropped
       Constraint 86 dropped
       Constraint 87 dropped
       Constraint 88 dropped
       Constraint 89 dropped
       Constraint 90 dropped
       Constraint 91 dropped
       Constraint 92 dropped
       Constraint 93 dropped
       Constraint 94 dropped
       Constraint 95 dropped
       Constraint 96 dropped
       Constraint 97 dropped
       Constraint 98 dropped
       Constraint 99 dropped
       Constraint 100 dropped
       Constraint 101 dropped
       Constraint 102 dropped
       Constraint 104 dropped
       Constraint 105 dropped
       Constraint 106 dropped
       Constraint 107 dropped
       Constraint 108 dropped
       Constraint 109 dropped
       Constraint 110 dropped
       Constraint 111 dropped
       Constraint 112 dropped
       Constraint 113 dropped
       Constraint 114 dropped
       Constraint 115 dropped
       Constraint 116 dropped
       Constraint 117 dropped
       Constraint 118 dropped
       Constraint 120 dropped
       Constraint 121 dropped
       Constraint 122 dropped
       Constraint 123 dropped
       Constraint 124 dropped
       Constraint 125 dropped
       Constraint 126 dropped
       Constraint 128 dropped
       Constraint 129 dropped
       Constraint 130 dropped
       Constraint 131 dropped
       Constraint 133 dropped
       Constraint 134 dropped
       Constraint 135 dropped
       Constraint 136 dropped
       Constraint 137 dropped
       Constraint 138 dropped
       Constraint 139 dropped
       Constraint 140 dropped
       Constraint 141 dropped
       Constraint 142 dropped
       Constraint 143 dropped
       Constraint 144 dropped
       Constraint 145 dropped
       Constraint 146 dropped
       Constraint 147 dropped
       Constraint 148 dropped
       Constraint 149 dropped
       Constraint 150 dropped
       Constraint 151 dropped
       Constraint 152 dropped
       Constraint 153 dropped
       Constraint 154 dropped
       Constraint 155 dropped
       Constraint 156 dropped
       Constraint 157 dropped
       Constraint 158 dropped
       Constraint 159 dropped
       Constraint 160 dropped
       Constraint 161 dropped
       Constraint 163 dropped
       Constraint 164 dropped
       Constraint 165 dropped

       F( 12,   165) = 1350.56
            Prob > F =    0.0000

. scalar f_p_value = r(F);

. estadd scalar f_p_value = r(F);

added scalar:
          e(f_p_value) =  1350.5596

. scalar clust = e(N_clust);

. estadd local city_controls "Yes": reg_base_c_d reg_base_cube reg_all*;

.  estadd local cluster_se "City": reg_base_c_d reg_base_cube reg_all*;

. estadd scalar clust: reg_base_c_d reg_base_cube reg_all*;

. #delimit cr
delimiter now cr
. 
. * Export regressions
. 
. #delimit ;
delimiter now ;
. esttab reg_* using "$OUTPUT_PATH/main_regressions.tex", 
>         se star(* 0.10 **       0.05 *** 0.01) ar2 replace booktabs label
>         drop(*.city2)
>         stats(city_controls cluster_se clust f_p_value N r2_a, label("City fixed effects"
>         "Clustered SE" "Clusters" "F-stat on city fixed effects" "Observations" 
>         "Adjusted R$^2$"));
(output written to C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/main_regressions.tex)

. #delimit cr
delimiter now cr
. 
. log close
      name:  <unnamed>
       log:  C:/Users/lijia/OneDrive - University of Toronto/Documents/School/1-5 ECO375/ECO375 Project//3 - Output/regression_analysis_log.log
  log type:  text
 closed on:  31 Mar 2023, 10:54:23
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
